{
    "visaID": "visa3.1",
    "visaType": "visa3",
    "visaName": "Adoption visa (subclass 102)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/adoption-102",
    "content": "Subclass 102\nAdoption visa\nThis visa lets children adopted outside Australia live in Australia with their adoptive parent.\nFor Applicants\nFor Sponsors\n\n\n\n\n\n\n\n\nIntercountry adoption\nWe can't help arrange adoptions and we do not issue letters of no objection. Our role is to assess and decide applications for visas.\nLearn more about adopting a child overseas from Intercountry Adoptions Australia.\nWe are unable to accept adoption visa applications for children who have been adopted in Pakistan.\nWith this visa the child can\nstay in Australia indefinitely with their adoptive parent\nwork and study in Australia\nenrol in Australia's public healthcare scheme, Medicare\nsponsor their relatives to come to Australia\napply for Australian citizenship, if eligible \nTravel to and from Australia for 5 years\nThe child can travel to and from Australia as many times as they want for 5 years from the date we grant this visa. This is as long as the travel facility on this visa remains valid.\nIf the child wants to travel after the initial 5-year travel facility:\nthey will need to apply for and be granted a Resident Return (RRV) so they can re-enter Australia as a permanent resident\nthey might also want to consider Australian citizenship. If they become an Australian citizen, they don't require a visa to enter Australia. They will need to apply for an Australian passport and use it to leave and re-enter Australia. See more about eligibility requirements and current processing times for Australian citizenship\nTo see when the child's travel facility ends, use VEVO.\nHow long the child can stay\nThis is a permanent visa. It lets the child stay in Australia indefinitely.\nThe child becomes a permanent resident on the day we grant the visa.\nInclude other children\nIf the child has siblings who also want to apply for an Adoption visa, submit separate applications for each sibling.\nThe child's dependent children can be included on their application when they apply or added to their application at any time before we decide the application.\nDependent children of the child who apply for the visa must meet our health requirement.\nFamily members who are not coming to Australia might also have to meet our health requirement.\nCost\nThe visa costs AUD3,140.00 for the main applicant.\nThere is also an additional charge for each of the child's dependent children who apply for the visa.\nThere might be other costs for health exams, police certificates and biometrics. \nTo work out what the visa might cost use the Visa Pricing Estimator. The estimator does not take into account the other costs.\nApply from\nThe child must be outside Australia when the application is submitted.\nProcessing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nThe application might take longer to process if:\nit is not filled in correctly\nit does not include all the documents we need or we need more information \nit takes us time to verify the information\nWe can't process the application if the correct visa application charge is not paid. We will advise if this is the case and if necessary return the application.\nYour obligations\nThe child must enter Australia before the date specified in their grant letter. The first entry date is generally set at 12 months from the date of visa grant.\nThe child and their family members must meet all visa conditions and obey Australian laws.\nSee what conditions might be attached to this visa on our visa conditions page.\nVisa label\nWe will digitally link the visa to the child's passport. They will not get a label in their passport.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}