{
    "visaID": "visa4.2.6",
    "visaType": "visa4.2",
    "visaName": "Premium Investor stream",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/business-innovation-and-investment-188/premium-investor",
    "content": "Business Innovation and Investment (provisional) visa (subclass 188)\nPremium Investor stream\nThis provisional visa is for people who are nominated by Austrade and who invest at least AUD15 million in Australian investments and/or philanthropic contributions.\n\n\n\n\n\n\n\n\nWith this visa, you can\ncarry out investment activity in Australia\nstay in Australia for 4 years and 3 months\nbring eligible members of your family with you\napply for a permanent Business Innovation and Investment (Permanent) visa (subclass 888) Premium Investor stream\nHow long you can stay\nThis is a provisional visa. You can stay in Australia for 4 years and 3 months.\nThe visa is granted with multiple entry. You can leave and re-enter Australia as many times as you want while the visa is valid.\nThe visa starts on the date we grant it.\nStay longer\nThis is a provisional visa. You must apply for a new visa if you want to stay longer. Explore your visa options\nOnce you have this visa, you can apply for permanent residence through the Business Innovation and Investment (Permanent) visa (subclass 888) Premium Investor stream if certain requirements are met.\nInclude family\nYou can include members of the family unit in your application when you apply. You can also add dependent children to your application at any time before we decide your application.\nFamily members who apply for the visa must meet our health and character requirements.\nIn order for the primary applicant to be granted this visa, family members who are not coming to Australia must meet our character requirements and might have to meet our health requirements.\n \nCost\nThis visa costs AUD9,455.00 for the main applicant.\nThere is also a charge for each family member who applies for the visa with you:\nfamily members over 18 years old: AUD4,725.00\nfamily members under 18 years old: AUD2,365.00\nYou must pay an extra charge for any applicant 18 years old or older who has less than functional English.This charge is the second instalment. Pay it only when we ask you to. We will refund the charge if we do not grant you the visa. The second instalment charges are:\nmain applicant: AUD9,795\nfamily members: AUD4,890\nTo work out what your visa will cost use the Visa Pricing Estimator. The estimator does not take into account the second instalment or other costs. You might also have to pay other costs for health checks, police certificates and biometrics.\nApply from\nYou can be in or outside Australia when you apply for the visa and when we decide on your application, but not in immigration clearance.\nProcessing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application can take longer to process if:\nyou do not complete the application form correctly\nyou do not include all the documents we need or we need more information from you\nit takes us time to verify your information\nYour obligations\nYou and your family members who are part of your application must comply with all visa conditions and Australian laws. \nIf you apply for a Business Innovation and Investment (Permanent visa (subclass 888) Premisum Investor stream, you must genuinely have a realistic commitment to maintain business and investment activity.  \nYou must also hold your investment of AUD15 million for a minimum of 12 months and follow Australian workplace laws.\nLearn more about conditions for this visa.\nFollow Australian workplace laws\nAll workers in Australia (including visa holders) have rights and protections at work. Pay rates and workplace conditions are set by Australian law.\nAdequate health insurance\nWe recommend you take out health insurance to cover any unforeseen medical treatment you might need in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability.\nSee what we consider adequate health insurance.\nLearn more about health insurance for overseas visitors.\nReciprocal healthcare agreements\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Sevices Australia about reciprocal healthcare agreements.\nTravel\nYou can travel outside Australia and return as many times as you want while the visa is valid.\nThe time you spend outside Australia does not extend the visa.\nVisa label\nAustralian visas are digital.\nWe do not put a visa label in your passport. Instead, we link your digital visa record to your passport.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}