{
    "visaID": "visa5.6",
    "visaType": "visa5",
    "visaName": "Resolution of Status visa (subclass 851)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resolution-of-status-851",
    "content": "Subclass 851\nResolution of Status\nThis visa allows for the permanent resolution of status for certain visa holders, including TPV and SHEV holders who arrived in Australia before 14 February 2023.\n\n\n\n\n\n\n\n\nOverview\nThe Australian Government has fulfilled its election commitment to make Temporary Protection visa (TPV) and Safe Haven Enterprise visa (SHEV) holders eligible to apply for a permanent Resolution of Status (RoS) visa.\nProviding permanent residence to TPV and SHEV holders empowers them to move forward with their lives. Permanent residency will enable TPV/SHEV holders to:\ngain secure employment\ngrow businesses\nstudy more easily\nsponsor eligible family members to Australia\neventually become an Australian citizen.\nAnyone who has submitted a TPV or SHEV application before 14 February 2023 that has not been finally determined, has had the existing application automatically converted to a RoS visa application. This includes subsequent TPV or SHEV applications.\nCurrent TPV and SHEV holders who had not submitted a subsequent TPV or SHEV application before 14 February 2023 can apply for a RoS visa online via ImmiAccount. They must apply before their current TPV or SHEV ceases to remain lawful.\nWe are committed to supporting the transition to a Resolution of Status visa for those who held or have applied for a TPV or SHEV before 14 February 2023. The Department continues to actively process all RoS visa applications. \nIf you have any concerns about your eligibility to apply for a RoS visa, you can contact specialist community legal service providers (listed in the Factsheet below). If you need assistance, you can also contact the Department’s Status Resolution Service for assistance.\nWith this visa, you can:\nlive, work and study in Australia permanently\naccess government services such as Medicare and Centrelink services\naccess short-term counselling for torture and trauma\nsponsor eligible family members for permanent residence through the family visa stream of the Migration Program\ntravel to and from Australia for 5 years\nif eligible, become an Australian citizen\nif eligible, attend English language classes for free.\nRequirements\nAll applicants need to meet health, character and security requirements. Any applicants aged 18 or over must sign the Australian Values Statement.\nYou may be asked to provide additional identity information, or to clarify information in relation to your identity. In some cases this may require an interview. The Department will contact you if additional information is required.\nConverted TPV or SHEV applications\nIf you applied for an initial TPV or SHEV before 14 February 2023 you do not need to apply for a RoS visa. If we find that you meet the criteria for the TPV or SHEV, the Department will convert your application to an application for a RoS visa. The Department will notify you if you have been granted a RoS visa.\nYou do not need to apply for a RoS visa if you hold a TPV or SHEV and have applied for a subsequent TPV or SHEV before 14 February 2023. The Department has converted your application to an application for a RoS visa. The Department will notify you if we have granted you a RoS visa.\nCurrent TPV and SHEV holders (with no application before the Department)\nCurrent TPV and SHEV holders who had not submitted a subsequent TPV or SHEV application before 14 February 2023 can apply for a RoS visa. You must apply before your current TPV or SHEV ceases to remain lawful.\nYou must apply for a RoS visa online via ImmiAccount.\nOnline applications for a RoS visa include the notification of an application bar lift (as unauthorised maritime arrivals are otherwise subject to the application bar in section 46A of the Migration Act 1958).\nFor assistance with ImmiAccount technical issues see Technical help. If you are still unable to lodge your application you can contact our Global Service Centre, or the legal service provider in your state or territory for free assistance. For a list of providers see the RoS visa factsheet (200KB PDF).\nThere are limited circumstances where we will authorise applicants to lodge a RoS visa application using the paper application form (including verified ImmiAccount systems issues).\nExtending your TPV or SHEV\nWe will extend the TPV/SHEV of current TPV or SHEV holders who make a valid application for a RoS visa until we have made a decision on the RoS visa. To ensure that your TPV or SHEV is extended and that you remain lawful, you must apply for a RoS visa before your TPV or SHEV ceases.\nIf you are currently unlawful\nIf you are currently an unlawful non-citizen because your TPV or SHEV expired before 14 February 2023, note that an application for a RoS visa is also an application for a bridging visa.\nFor current TPV or SHEV holders, you must apply for a RoS visa before your TPV or SHEV ceases.\nHow long can you stay\nThis is a permanent visa. It lets you stay in Australia indefinitely.\nYou become an Australian permanent resident on the day we grant your visa.\nFor Australian citizenship purposes, your permanent residence starts on the day we grant your visa.\nIncluding family members\nFamily members may apply together on the same application form. Each applicant must meet the requirements in their own right for the grant of the visa.\nNewborn child\nIf a child is born after you submit your application and before we make a decision on your application, we will include the child in that application. You must tell us as soon as possible by completing Form 1022 Notification of change of circumstances (172KB PDF). You must also provide a clear colour copy of the child's original birth certificate, and attach both of these documents in ImmiAccount or send them via email to the address provided in your RoS visa or subsequent TPV or SHEV application acknowledgement letter.\nIf a child is born in Australia, they are automatically granted the same visa their parents hold at the time of the child’s birth.\nIf either parent is an Australian citizen or Australian permanent resident at the time of the child’s birth, the child will be an Australian citizen by birth. In such cases an Australian citizenship certificate should be obtained and attached in ImmiAccount. For more details see: Get a citizenship certificate.\nCost\nThere is no cost.\nApply from\nYou must be in Australia when you apply for the visa.\nProcessing times\nThe Department continues to actively process all RoS visa applications. \nSome cases are more complex than others and the department may need to request additional information from applicants, including in relation to identity. It is important that applicants cooperate with this process to allow applications to be processed as quickly as possible. \nInformation regarding the processing of the RoS visa caseload is available in the Unauthorised Maritime Arrival legacy caseload reports available at Humanitarian program statistics.\nYour obligations\nYou and your family members must obey all Australian laws.\nTravel\nThere are no travel restrictions on the Resolution of Status visa.\nYou can travel to and from Australia for 5 years from the date we grant the visa. To re-enter Australia after 5 years you will need a Resident Return visa (RRV).\nIf you want to travel outside Australia after we grant the visa and you do not have a current passport, you should first contact any Australian Passport Office of the Department of Foreign Affairs and Trade to apply for a travel document.\nFact sheet\nA fact sheet with useful information about the Resolution of Status visa process is available below in the following languages:\nArabic (560KB PDF)\nBurmese (357KB PDF)\nDari (554KB PDF)\nEnglish (200KB PDF)\nFarsi (207KB PDF)\nPashto (546KB PDF)\nRohingya (122KB PDF)\nTamil (344KB PDF)\nVisa label\nWe will digitally link your visa to your travel document or ImmiCard. You will not get a label in your travel document. \nIrregular travel to Australia\nThe Government remains committed to Operation Sovereign Borders. Australia’s border protection policies have not and will not change. Any person who attempts to travel to Australia irregularly will not settle permanently here.\nAnyone who attempts to travel to Australia by voyage without a valid visa will be turned back to their point of departure, returned to their home country or transferred to another country.\nAustralia's tough border protection policies are designed to protect Australia's borders, combat people smuggling and deter people from attempting dangerous boat voyages across the open ocean.\nThe Government’s policy on transitory persons remains unchanged. Transitory persons will not settle in Australia. We encourage them to engage in third country migration options including:\nResettlement in the United States or New Zealand or private sponsorship in Canada\nAssisted Voluntary Return (AVR) home or to another country in which they have right of entry.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}