{
    "visaID": "visa4.6",
    "visaType": "visa4",
    "visaName": "Investor visa (subclass 891)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/investor-891",
    "content": "Subclass 891\nInvestor visa\nThis visa is for people who undertake business and investment activities in Australia. It allows you to stay in Australia indefinitely. To apply as a primary applicant, you must have a qualifying visa granted on a particular basis.\n\n\n\n\n\n\n\n\nWith this visa, you can\nstay in Australia permanently\nwork and study in Australia\nenrol in Australia's public health care scheme, Medicare\nsponsor your relatives to come to Australia\ntravel to and from Australia for 5 years\nif eligible, become an Australian citizen\nNewly arrived residents may have to wait before they can access certain Australian Government payments and benefits. \nHow long you can stay\nThis is a permanent visa. It lets you stay in Australia indefinitely. The visa has a travel component that expires 5 years after the date of visa grant.\nYou become a permanent resident on the day we grant the visa.\nFor citizenship purposes, your permanent residency starts on the day:\nwe grant the visa, if you are in Australia\nyou enter Australia on this visa, if you are outside Australia\nInclude family\nYou can include members of the family unit in your application. You can:\ninclude them when you lodge your visa application\nadd them after you lodge your application but before we decide on your visa\nA member of the family unit can include family members who hold an eligible visa that was granted on the basis that they were a member of your family unit at the time their eligible visa was granted. This provision may apply even where the person would no longer meet the definition of members of the family unit, for example a child who has turned 23 years of age since their eligible visa was granted.\nMembers of the family unit who apply for the visa must meet our health and character. Members of the family unit not accompanying you to Australia may also need to meet our health and character requirements.\nCost\nApplication charge\nThe visa costs AUD2,890.00\nThere is also a charge for each member of the family unit who applies for the visa with you.\nSecond instalment charge\nYou might have to pay an extra charge for any applicant 18 years old or older who has less than functional English and who does not hold an eligible visa when they apply. This charge is called the second instalment. This charge is only payable if you are requested to pay it and we send you an invoice.   \nThe second instalment charge for family members is AUD4,890.\nYou might also have to pay other costs for health checks, police certificates and biometrics.\nTo work out what your visa will cost use the Visa Pricing Estimator.\nThe Visa Pricing estimator does not include the second instalment or other costs.\nWe can't process your application if you do not pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\nApply from\nYou must be in Australia when you submit your application. Members of your family unit can be in or outside Australia but not in immigration clearance.\nYou must hold an eligible visa to make a valid application for this visa.\nProcessing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nWe assess applications on a case by case basis, and actual processing times can vary due to individual circumstances including:\nwhether you have lodged a complete application, including all necessary supporting documents\nhow quickly you respond to any requests for additional information\nhow long it takes to perform required checks on the supporting information provided\nhow long it takes to receive additional information from external agencies, particularly in relation to health, character, and national security requirements\nfor permanent migration visa applications, how many places are available in the migration program\n \nYour obligations\nYou and members of your family unit must obey all Australian laws.\nWe expect you to continue your business or investment activity in Australia, or make a realistic commitment to doing so.\nTravel\nYou can travel to and from Australia as many times as you want for 5 years from the date we grant this visa. \nAfter 5 years you will need a Resident Return (RRV) visa  (subclass 155 and 157) to re enter Australia as a \npermanent resident. \nTo see when your travel facility ends, use VEVO.\n \nVisa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}