{
    "visaID": "visa1.4.6",
    "visaType": "visa1.4",
    "visaName": "Sponsored family stream",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/visitor-600/sponsored-family-stream",
    "content": "Visitor visa (subclass 600)\nSponsored family stream\nThis visa stream lets people who are sponsored, usually by a family member, come to Australia to see their family members.\nFor Applicants\nFor Sponsors\n\n\n\n\n\n\n\n\nWith this visa you can\nsee family or friends\nbe in Australia as a tourist, for a cruise or for any purpose except business or medical treatment.\nYou can study or train for up to 3 months in total on this visa. If your main reason for travelling to Australia is study, a student visa might be more appropriate.\nYou can't work.\nYou should check if a Visitor (subclass 600) visa in the Tourist stream might better suit you. The Visitor visa (subclass 600) Tourist stream visa also lets you holiday in Australia to see family and friends and does not require a sponsor.\nCruise\nYou will need a visa if you enter Australia during a cruise.\nIf your cruise is a round trip cruise, the time you spend on the cruise counts as time spent in Australia - that is, we do not consider you have left Australia. A round trip cruise will not reset your stay period on your visa.\nAsk your cruise operator or travel agent if we consider your cruise to be a round trip cruise.\nHow long you can stay\nThis is a temporary visa. We might grant it for up to 12 months.\nWe determine the length of your visa on a case by case basis. Things we might consider when determining your stay period include:\nhow long you want to stay\nwhy you want to stay in Australia\nYou might not be granted the length of stay you want.\nGenerally we grant this visa with only one entry permitted. This means that after you leave Australia you need to apply for another visa before you can return.\nStay longer\nYou can't stay in Australia longer by extending this visa. You must apply for another visa.\nYou can't apply for a new visa in Australia because your visa will have condition 8503, 'No Further Stay'. In limited circumstances, you might be able to request a waiver of the No Further Stay condition.\nYou must not breach condition 8531. That is, you must not remain in Australia beyond your visa period.\nYou can explore your visa options.\nInclude family\nYou can't include family members in your application. A separate application must be made for each member of your family, including those listed on your passport.\nIf other family members are applying for this visa, your applications can be processed together. Learn more when you apply for the visa.\nNewborn child\nFind out what to do if your child is born after you apply.\nCost\nThe visa costs AUD195.00 for each applicant.\nYou might also have to pay other costs for health checks, police certificates and biometrics. \nUse the Visa Pricing Estimator to work out what your visa will cost. The estimator does not take into account the other costs.\nApply from\nYou must be outside Australia when you apply and when we decide on your application.\nProcessing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour obligations\nYou must meet all visa conditions and obey Australian laws.\nHealth insurance\nWe recommend you obtain health insurance to cover any unforeseen medical treatment you might need in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability.\nSee what we consider adequate health insurance.\nLearn more about health insurance for overseas visitors.\nReciprocal healthcare agreements\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements.\nTravel\nIf we grant you a multiple-entry visa, you can travel outside Australia and return as many times as you want while the visa is valid.\nIf we grant you a single-entry visa and you leave Australia, you can't re-enter on the visa. You must apply for another visa to come back.\nCheck if you have multiple or single entry in Visa Entitlement Verification Online (VEVO) or your visa grant letter.\nVisa record\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}