{
    "visaID": "visa4.18.4",
    "visaType": "visa4.18",
    "visaName": "Research activities",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-activity-408/research-activities",
    "content": "Temporary Activity visa (subclass 408)\nResearch Activities\nThis visa lets you observe or take part in a research project at a research or tertiary institution in Australia. You and your family who apply for the visa with you can stay here for up to 2 years.\nFor Applicants\nFor Sponsors\n\n\n\n\n\n\n\n\nWith this visa, you can\nobserve or take part in a project at a research or tertiary institution in Australia\ntravel to and from Australia as many times as you want while your visa is valid\ninclude members of the family unit in your application\nUsually, you would observe or take part in the research for up to 12 months.\nResearcher activities\nYou might be eligible for this activity type if you:\nare an academic who has made significant achievements in your field\nare employed, or were employed in the past, as an academic at a tertiary institution\nhave been invited to observe or take part in an Australian research project at an Australian tertiary or research institution, usually in collaboration with other academics employed there\nResearch student activities\nYou might be eligible for this activity type if you are:\na student or recent graduate of an overseas educational institution\nyou have been invited to undertake research related to your field of study at an Australian tertiary or research institution \nIf you have not yet graduated, you must be undertaking the research to meet the requirements for your overseas qualification.\nHow long you can stay\nThis is a temporary visa.\nWe grant the length of stay based on the activity we approve you to do on the visa.\nThe maximum stay for this visa stream is 2 years.\nThe visa is granted with multiple entry. You can leave and re-enter Australia as many times as you want while the visa is valid.\nIf you are outside Australia when the visa is granted, the visa stay period starts on the day that you enter Australia. If you are in Australia, the visa starts on the day it is granted.\nIf we grant the visa, we will let you know how long you can stay.\nStay longer\nYou can't stay in Australia longer by extending this visa. Explore your visa options.\nIf you need to stay longer to complete your research activities, you will need to submit a new application for this visa.\nInclude family\nYou can:\ninclude members of the family unit in your application when you apply, or\nadd family members to your application at any time before we make a decision\nFamily members who apply for the visa with you must also meet our health and character requirements. \nSubsequent entrants\nIf we grant you the visa, your family members might be able to apply to join you in Australia later as a subsequent entrant. \nCost\nThe visa costs AUD415.00 for the main applicant.\nThere is also a charge for each family member who applies for the visa with you.\nYou might also have to pay other costs for health checks, police certificates and biometrics.\nTo work out what your visa will cost use the Visa Pricing Estimator. The estimator does not take into account the other costs.\nApply from\nYou can be in or outside Australia, but not in immigration clearance, when you apply for the visa and when we decide your application.\nProcessing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application might take longer to process if:\nyou don't fill it in correctly\nyou don't include all the documents we need, or we need more information from you\nit takes us time to verify your information\nWe can't process your application if you don't pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\nYour obligations\nYou and your family must meet all visa conditions and follow Australian laws.\nLearn more about conditions for this visa.\nYour activities must not harm the work, training or work  conditions of Australian citizens or permanent residents.\nIf you stop working for your sponsoring or supporting organisation, you may not be eligible to hold this visa. if this happens, you must do one of the following:\nif eligible, apply for a new visa, or\nleave Australia within 28 days of stopping work for your sponsor/supporter, or earlier if your visa is expiring\n \nTravel\nYou can travel outside Australia and return as many times as you want while the visa is valid.\nThe time you spend outside Australia does not extend the visa.\nVisa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nIf we grant you a visa, we will send you a grant notification letter containing the visa grant number. You can use this number to access your digital visa record.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}