{
    "visaID": "visa7.6",
    "visaType": "visa7",
    "visaName": "Distinguished Talent visa (subclass 124)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/distinguished-talent-124#About",
    "content": "Subclass 124\nDistinguished Talent visa\nThis is a permanent visa for people who have an internationally recognised record of exceptional and outstanding achievement in an eligible field.\n\n\n\n\n\n\n\n\nWith this visa, you can\nstay in Australia permanently\nwork and study in Australia\nenrol in Australia's public health care scheme, Medicare\nsponsor your relatives to come to Australia\ntravel to and from Australia for 5 years\nif eligible, apply for Australian citizen\nNewly arrived residents may have to wait before they can access certain Australian Government payments and benefits. \nApply from\nYou can be in or outside Australia when you apply for the visa but not in immigration clearance. You must be outside Australia for your visa to be granted. \nIf you are currently in Australia and hold an eligible visa you may need to consider your eligibility for the Distinguished Talent visa (subclass 858).\nHow long you can stay\nThis is a permanent visa. It lets you stay in Australia permanently.\nYou become a permanent resident on the day we grant the visa.\nInclude family\nYou can include members of the family unit when you apply. You can also add family to your application at any time before we decide on your application.\nIf you are under 18 years old, you can include:\na parent\nmembers of the family unit of that parent\nFamily members who apply for the visa must meet our health and character requirements.\nCost\nThe visa costs AUD4,110.00 for the main applicant.\nThere is an additional charge for each family member who applies for the visa with you.\nTo work out what your visa will cost use the Visa pricing estimator. The estimator does not take into account the second instalment or other costs.\nWe can't process your application if you do not pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\nYou might have to pay an extra fee for any applicant 18 years old or older who has less than functional English. This charge is called the second instalment. We will tell you when to pay the second instalment.\nThe second instalment charge is AUD4,890.\nThe Visa Pricing Estimator does not include the second instalment or other costs. You might also have to pay other costs for health checks, police certificates and biometrics.\n \nProcessing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nWe assess applications on a case-by-case basis, and actual processing times can vary due to individual circumstances including:\nwhether you have lodged a complete application, including all necessary supporting documents\nhow quickly you respond to any requests for additional information\nhow long it takes to perform required checks on the supporting information provided\nhow long it takes to receive additional information from external agencies, particularly in relation to health, character, and national security requirements\nhow many places are available in the migration program\nYour obligations\nYou and your family members must obey all Australian laws.\nWe expect that you will contribute to Australia in your field of expertise.\nTravel\nYou can travel to and from Australia for 5 years from the date we grant the visa. After 5 years you will need a Resident Return (RRV) visa (subclass 155 or 157) to re-enter Australia as a permanent resident. To see when the 5 years ends, use VEVO.\nVisa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}