{
    "visaID": "visa4.18.8",
    "visaType": "visa4.18",
    "visaName": "Superyacht Crew",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-activity-408/superyacht-crew",
    "content": "Temporary Activity visa (subclass 408)\nSuperyacht Crew stream\nThis visa lets you work in Australia as a crew member of a superyacht. You can stay here for up to 12 months.\nFor Applicants\nFor Sponsors\n\n\n\n\n\n\n\n\nWith this visa, you can\nwork as a crew member on a superyacht\ntravel to and from Australia as many times as you want while your visa is valid\nA superyacht is a high-value luxury sailing or motor vessel that:\nis 24 metres or longer\ndoesn't carry cargo\nis used for sport or recreation\nHow long you can stay\nThis is a temporary visa. We grant the length of stay based on the activity we approve you to do on the visa.\nWe usually do not grant a visa stay period of more than 12 months for this activity. The maximum stay for this visa stream is 2 years. \nThe visa is granted with multiple entry. You can leave and re-enter Australia as many times as you want while the visa is valid.\nIf you are outside Australia when the visa is granted, the visa stay period starts on the day that you enter Australia. If you are in Australia, the visa starts on the day that it is granted.\nYour visa grant letter will tell you how long you can stay.\nStay longer\nYou can't stay in Australia longer by extending this visa.\nIf you need to stay longer to complete your superyacht activities, you will need to submit a new application for this visa.\nCost\nThe visa usually costs from AUD415.00 for the main applicant. \nYou might also have to pay other costs for health checks, police certificates and biometrics.\nTo work out what your visa will cost use the Visa Pricing Estimator. The estimator does not take into account the other costs.\nApply from\nYou can be in or outside Australia when you apply for the visa and when we decide on your application.\nProcessing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application can take longer to process if:\nyou do not fill it in correctly\nyou do not include all the documents we need, or we need more information from you\nit takes us time to verify your information\nWe can't process your application if you do not pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\nYour obligations\nYou and your family must meet all visa conditions and follow Australian laws.\nLearn more about conditions for this visa.\nYour activities must not harm the work, training or job conditions of Australian citizens or permanent residents.\nIf your sponsor or supporting organisation or individual stops your activity or employment, you must do one of the following:\nif eligible, apply for a new visa; or\nleave Australia within 28 days of stopping work for your sponsor/supporter, or earlier if your visa is expiring\nTravel\nYou can travel outside Australia and return as many times as you want while the visa is valid.\nThe time you spend outside Australia does not extend the visa.\nVisa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nIf we grant you a visa, we will send you a grant notification letter containing the visa grant number. You can use this number to access your digital visa record.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}