{
    "visaID": "visa3.8",
    "visaType": "visa3",
    "visaName": "Child visa (subclass 802)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/child-802",
    "content": "Subclass 802\nChild visa\nThis visa allows a child to stay in Australia permanently and live with their parents.\nFor Applicants\nFor Sponsors\n\n\n\n\n\n\n\n\nWith this visa the child can\nstay in Australia indefinitely\nwork and study in Australia\nenrol in Australia's public healthcare scheme, Medicare\nsponsor relatives to come to Australia\napply for Australian citizenship, if eligible\nTravel to and from Australia for 5 years\nThe child can travel to and from Australia as many times as they want for 5 years from the date we grant this visa. This is as long as the travel facility of this visa remains valid.\nIf the child wants to travel after the initial 5-year travel facility:\nthey will need to apply for and be granted a Resident Return (RRV) visa so they can re-enter Australia as a permanent resident\nthey might also want to consider Australian citizenship. If they become an Australian citizen, they don't require a visa to re-enter Australia. See more about eligibility requirements and current processing times for Australian citizenship\nTo see when the child's travel facility ends, use VEVO.\nHow long the child can stay\nThis is a permanent visa. It lets the child stay in Australia indefinitely.\nThe child becomes a permanent resident the day we grant the visa.\nInclude other children\nIf the child has siblings who also want to apply, submit separate applications for each sibling.\nThe child's dependent children can be included on their application when they apply or at any time before we decide the application.\nDependent children of the child who apply for the visa must meet our health requirement.\nFamily members who are not coming to Australia might also have to meet our health requirement.\nCost\nThe visa costs AUD3,140.00 for the main applicant.\nThere is also a charge for each dependent child who applies for the visa with you.\nThere might be other costs for health exams, police certificates and biometrics. \nTo work out what your visa will cost, use the Visa Pricing Estimator. The estimator does not take into account the other costs.\nApply from\nThe child must be in Australia, but not in immigration clearance, when the application is submitted and when we make a decision.\nThe child can't apply for this visa if they are in Australia on another visa with a no further stay condition.\nProcessing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nThe application might take longer to process if:\nit is not filled in correctly\nit does not include all the documents we need or we need more information \nit takes us time to verify the information\nWe can't process the application if the correct visa application charge is not paid. We will advise if this is the case and if necessary return the application.\nThe child's obligations\nThe child and any dependants must obey all Australian laws.\nVisa label\nWe will digitally link the visa to the child's passport. They will not get a label in their passport.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}