{
    "visaID": "visa4.21",
    "visaType": "visa4",
    "visaName": "Temporary Work (Short Stay Specialist) visa (subclass 400)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-work-400",
    "content": "Subclass 400\nTemporary Work (Short Stay Specialist) visa\nThe Highly Specialised Work stream of this temporary visa lets you do short-term, highly specialised work in Australia. It is suitable if you have specialised skills, knowledge or experience not generally available in Australia.\n\n\n\n\n\n\n\n\nWith this visa you can\ndo short-term work in a highly specialised job\nbring family members with you, but they are not allowed to work or study in Australia, except to do a language training program\nEmployers must provide a contract or letter of offer. See what they have to do in:\nLearn about employing migrants\nStep by step, Gather documents, Work documents\nHow long you can stay\nThis is a temporary visa. You can stay in Australia for up to 6 months, depending on the circumstances.\nYou must arrive in Australia within 6 months of the date the visa is granted, or a lesser period specified by the Minister. We will let you know when you must arrive in your visa grant letter.\nYour visa stay period as shown on your visa grant letter will start on your first date of arrival in Australia. The stay period will not restart each time you arrive in Australia.\nYou can check your visa details in the visa grant letter or use VEVO.\nStay longer\nYou can't stay in Australia longer by extending this visa.\nExplore your visa options\nInclude family\nYou can include Members of the family unit in your application when you apply.\nBoth you and your family members who apply for the visa must meet our health requirements and character requirements.\nAny family members included in your application are not permitted to work or study in Australia. You must be able to show that you and your family have enough means to support yourselves while in Australia.\nCost\nThe visa costs AUD415.00 for the main applicant.\nYou will not need to pay this application charge if you are:\ncoming to Australia to act as a representative of a foreign government\nlisted in a legislative instrument (your inviting organisation will tell you if this applies to you)\nThere is also a charge for each family member who applies for the visa with you.\nYou might also have to pay other costs for health checks, police certificates and biometrics.\nTo work out what your visa will cost use the Visa Pricing Estimator. The estimator does not take into account the other costs.\nApply from\nYou must be outside Australia when you apply for the visa and when we make a decision on your application.\nProcessing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application can take longer to process if:\nyou do not fill it in correctly\nyou do not include all the documents we need, or we need more information from you\nit takes us time to verify your information\nWe can't process your application if you do not pay the correct visa application charge. We will notify you if this is the case.\nWhen applying for your subclass 400 visa, you will need to allow time for the application to be processed, taking into account the date you are intending to travel to Australia.\nYour obligations\nYou and your family must comply with all visa conditions and Australian laws.\nLearn more about conditions for this visa.\nAdequate health insurance\nHealth insurance\nWe recommend you take out health insurance to cover any unforeseen medical treatment you might need in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability.\nSee more about health insurance for overseas visitors.\nReciprocal healthcare agreements\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements.\nTravel\nThis is a temporary visa. You will have 6 months from the date the visa is granted to first enter Australia (or a lesser period specified). The period of stay you were granted starts on the date you first enter Australia.\nThe visa is granted with either:\nsingle entry – you will only be allowed to enter Australia once. You can't re-enter Australia on the visa. To return to Australia after you leave, you will need to apply for a new visa, or\nmultiple entry - you can leave and re-enter Australia as many times as you want during the visa stay period.\nRe-entering Australia on a multiple entry visa does not restart the period of stay you were granted.\nThe time you spend outside Australia does not extend the visa.\nVisa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}