{
    "visaID": "visa3.12",
    "visaType": "visa3",
    "visaName": "Contributory Parent visa (subclass 143)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/contributory-parent-143",
    "content": "(Subclass 143)\nContributory Parent visa\nThis permanent visa lets a parent of a settled Australian citizen, Australian permanent resident of Australia or eligible New Zealand citizen move to Australia.\nFor Applicants\nFor Sponsors\n\n\n\n\n\n\n\n\n\nWith this visa you can\nstay in Australia indefinitely\nwork and study in Australia\nenrol in Australia's public health care scheme, Medicare\nsponsor your family members to come to Australia\ntravel to and enter Australia for 5 years\napply for Australian citizenship, if eligible\nTravel to and from Australia for 5 years\nYou can travel to and from Australia as many times as you want for 5 years from the date we grant this visa. This is as long as the travel facility on this visa remains valid.\nIf you want to travel after the initial 5-year travel facility:\nyou will need to apply for and be granted a Resident Return (RRV) so that you can re-enter Australia as a permanent resident\nyou might also want to consider Australian citizenship. If you become an Australian citizen, you don't require a visa to enter Australia. You will need to apply for an Australian passport and use it to leave and re-enter Australia. See more about eligibility requirements and current processing times for Australian citizenship\nTo see when your travel facility ends, use VEVO.\nIf you hold a Contributory Parent (Temporary) (subclass 173) visa\nYou can apply for the subclass 143 visa as a two-step process by first applying for a Contributory Parent (Temporary) (subclass 173) visa. Applying for the subclass 173 visa and then the subclass 143 visa allows you to spread the cost of the visas over a number of years.\nYou have already met the balance of family test.\nApply for a Parent visa (subclass 143) as a retiree\nIf you apply for the subclass 143 visa as a retiree you don't have to:\nmeet the balance of family test, or\nhave a sponsor or an assurance of support\nHow long you can stay\nThis is a permanent visa. It lets you stay in Australia indefinitely.\nFor citizenship purposes, your permanent residency starts on the day:\nwe grant the visa if you are in Australia\nyou enter Australia on this visa if you are outside Australia\nInclude family\nYou can include members of the family unit in your application when you apply.\nYou are required to include details of all your family members, whether they are migrating or not.\nFamily members who apply for the visa must meet our health and character requirements. Family members who are not coming to Australia might also have to meet our health and character requirements.\nIf you apply for this visa as a retiree, you:\ncan include your partner when you apply provided they are also a retiree\ncan't include your children in your application\nNewborn child\nFind out what to do if your child is born after you apply.\nCost\nThis visa costs AUD48,495. There is also an additional charge for each family member who applies with you.\nYou pay for this visa in 2 parts, called instalments.\nPay the first instalment when you apply. Pay the second instalment when we ask you to. See more about visa fees and charges.\nYou might also have to pay other costs for health checks, police certificates and biometrics. \nTo work out what your visa will cost use the Visa Pricing Estimator. The estimator does not take into account the other costs.\nApply from\nYou can be in or outside Australia when you apply for the visa.\nIf you apply in Australia, any family members who apply with you must also be in Australia, but not in immigration clearance, when you apply. If you apply outside Australia, any family members who apply for the visa with you must also be outside Australia when you apply.\nIf you are applying as a retiree you must be in Australia, but not in immigration clearance, when you apply. You can be in or outside Australia when we make a decision on your application\nProcessing times\nThe demand for these visas is greater than the number of places available each year. As a result, processing times for these applications can be lengthy.\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application might take longer to process if:\nyou do not fill it in correctly\nyou do not include all of the documents we need or we need more information from you and/or\nyour information takes a long time to verify.\nWe cannot process your application if you do not pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\nThe Reports on Migration Programs have further information on Migration Program outcomes against planning for each migration program year.\nApplications for this visa are subject to capping and queueing.\nLearn more about the Parent visa queue and processing priorities.\nAssessment\nWe assess applications for this visa in 2 stages:\nCheck eligibility and either add the application to the queue or refuse it.\nContinue assessing the application when a place becomes available and make a decision.\nDo not arrange to stay permanently in Australia until your visa is granted. We will let you know in writing if we grant you the visa.\nLearn more about the Parent visa queue and processing priorities.\nConsider another visa\nOther Parent visas available include the:\nContributory Parent (Temporary) visa (subclass 173), then a permanent Contributory Parent visa (subclass 143). This 2-step visa process and costs more than the subclass 103 visa. It also costs more than applying directly for the Contributory Parent visa (subclass 143), but the cost is spread across the 2 visas over a longer period.\nSponsored Parent (Temporary) visa (subclass 870) which is a temporary visa allowing parents to visit their children in Australia for up to three or five years at a time and a cumulative maximum 10 year period.\nYou can view all visa options on our Visa list page.\nAssessment\nWe assess applications for this visa in 2 stages.\nCheck eligibility and either add the application to the queue or refuse it.\nContinue assessing the application when a place becomes available and make a decision.\nDon't arrange to move to Australia until we grant the visa. We will let you know in writing if we grant you the visa.\nLearn more about the Parent visa queue and processing priorities.\nYour obligations\nYou must enter Australia before the date specified in your grant letter. The first entry date is generally set at 12 months from the date of visa grant.\nYou and your family members must meet all visa conditions and obey Australian laws.\nSee what conditions might be attached to this visa on our visa conditions page.\nVisa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}