{
    "visaID": "visa4.20.1",
    "visaType": "visa4.20",
    "visaName": "Government Agreement stream",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-work-403/government-agreement",
    "content": "Temporary work (International relations) visa (subclass 403)\nGovernment Agreement stream\nThis visa stream allows a person to work in Australia under the terms and conditions of a bilateral agreement between the Australian Government or a state/territory government and a government of another country.\n\n\n\n\n\n\n\n\nWith this visa, you can\nwork under the terms and conditions of a bilateral agreement between the Australian Government, or a state/ territory government, and a government of another country\ntravel to and from Australia as many times as you want\napply to bring your immediate family to Australia (if allowed under the agreement, and specified in the letter of support from the Australian signatory).\nHow long you can stay\nThis is a temporary visa. You can stay for the time we specify in your visa grant notice. This may be up to 4 years unless the Australian signatory has asked for a shorter period.\nThe visa starts:\non the day you first enter Australia, if you are outside Australia when we grant the visa or\non the date we grant the visa, if you are in Australia when we grant the visa.\nStay longer\nYou can't stay in Australia longer by extending this visa. You may apply for a further subclass 403 visa under the Government Agreement stream, if you meet the requirements.\nInclude family\nYou can include members of the family unit in your application when you apply if allowed under the agreement, and specified in the letter of support from the Australian signatory.\nFamily members who apply for the visa must meet our health and character requirements.\nCost\nThe visa costs AUD365.00 for the main applicant.\nThere is also a fee for each family member who applies for the visa with you.\nYou may also have to pay other costs for:\npolice certificates\nhealth checks, and\nbiometrics.\nTo work out what your visa will cost use the Visa Pricing Estimator. The estimator does not take into account the other costs.\nApply from\nYou can be in or outside Australia when you apply for the visa and when we decide on your application.\nProcessing times\nTo find out about processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application can take longer to process if:\nyou do not fill it in correctly\nyou do not include all the documents we need\nwe need more information from you\nit takes us time to verify your information.\nWe can't process your application if you do not pay the correct visa application charge. We will tell you if this is the case and invalidate your application.\nYour obligations\nIf granted a visa, you and your family must comply with all visa conditions and Australian laws.\nLearn more about conditions for this visa.\nTravel\nYou can travel outside Australia and return as many times as you want while the visa is valid.\nThe time you spend outside Australia does not extend the visa.\nVisa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}