{
    "visaID": "visa4.4",
    "visaType": "visa4",
    "visaName": "Global Talent visa (subclass 858)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/distinguished-talent-858",
    "content": "Subclass 858\nGlobal Talent visa\nThis is a permanent visa for people who have an internationally recognised record of exceptional and outstanding achievement in an eligible field.\n\n\n\n\n\n\n\n\nVisa pathways\nThe Global Talent visa is for the brightest and best global talent. It comprises of two visa pathways:\nGlobal Talent pathway\nDistinguished Talent pathway.\nThe Global Talent pathway provides priority processing for highly skilled applicants who:\nhave an internationally recognised record of exceptional and outstanding achievements within the Minister's defined sectors\ncurrently earn, or are likely to earn at the Fair Work High Income Threshold.\nBefore applying for the Global Talent pathway, you should submit an Expression of Interest against relevant requirements for priority processing. If successful, you will receive a unique reference and identifier to use when making a Global Talent (subclass 858) visa application.\nMore information on the Global Talent pathway, including Expression of Interest requirements and submission process, can be found at EOI requirements.\nThe Distinguished Talent pathway is for extremely talented applicants who have an internationally recognised record of exceptional and outstanding achievements working in sectors other than a Minister's defined sector for either a profession, sport, the arts, or academia and research. An expression of Interest is not required for this pathway.\nApplicants can apply for the Global Talent pathway and the Distinguished Talent pathway online via ImmiAccount.\nWith this visa you can\nstay in Australia permanently\nwork and study in Australia\nenrol in Australia's public health care scheme, Medicare\nsponsor your relatives to come to Australia\ntravel to and from Australia for 5 years\nif eligible, apply for Australian citizenship\nNewly arrived residents may need to wait before they can access certain Australian Government payments and benefits. \nApply from\nYou must either be in or outside Australia but not in immigration clearance, when you apply and when this visa is decided. \nHow long you can stay\nThis is a permanent visa. It lets you stay in Australia indefinitely.\nYou become a permanent resident on the day we grant the visa.\nFor citizenship purposes, your permanent residence starts on the day:\nwe grant the visa if you are in Australia\nyou enter Australia on this visa if you are outside Australia.\nInclude family\nYou may include members of the family unit when you apply. You can also add members of your family to your application at any time before a decision is made on your application.\nIf you are under 18 years old, you can only include your parents and members of the family unit of that parent.\nFamily members who apply for the visa must meet our health and character requirements regardless of whether they are accompanying you to Australia.\nFor more information on health requirements, refer to Meeting our health requirement.\nFor more information on character requirements, refer to Character requirements for visas.\nIf your partner or dependent children are not included in this application please tell us the reason why.\nCost\nFor the cost of the visa for the main applicant, refer to Fees and charges for visas.\nThere is an extra charge for each family member who applies for the visa with you.\nWe cannot process your application if you do not pay the correct visa application charge.\nYou may have to pay an extra fee for any applicant aged 18 years or older who has less than functional English. This charge is called the second instalment. We will tell you when to pay the second instalment. For more information on the second installment charge, refer to Fees and charges for visas.\nTo work out what your visa will cost, you can use the Visa Pricing Estimator. The estimator does not take into account the second instalment or other costs, such as health checks, police certificates and biometrics.\nFor information on the cost of health checks, refer to Your health examinations.\nFor information on the cost of biometrics, refer to biometrics.\nProcessing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nWe assess applications on a case-by-case basis. Actual processing times can vary due to individual circumstances including:\nwhether you have received a successful Expression of Interest outcome to apply for this visa under the Global Talent pathway\nwhether you have lodged an application for the Distinguished Talent pathway\nwhether you have lodged a complete application, including all required supporting documents\nhow quickly you respond to requests for additional information\nhow long it takes to perform required checks on supporting information provided\nhow long it takes to receive extra information from external agencies, in relation to health, character, and national security requirements\nhow many places are available in the migration program\nYour obligations\nYou and your family members must obey all Australian laws.\nWe expect that you will contribute to Australia in your area of expertise.\nTravel\nYou can travel to and from Australia for 5 years from the date we grant the visa. After 5 years you will need a Resident Return (RRV) visa (subclass 155 or 157) to re-enter Australia as a permanent resident. To see when the 5 years ends, use VEVO.\nVisa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}