{
    "visaID": "visa1.4.4",
    "visaType": "visa1.4",
    "visaName": "Approved Destination Status stream",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/visitor-600/approved-destination-stream",
    "content": "Visitor visa (subclass 600)\nApproved Destination Status stream\nThis visa stream is for citizens from certain areas of China visiting Australia on a tour organised by an approved travel agent.\n\n\n\n\n\n\n\n\nWith this visa you can\ncan enter Australia with your approved tour group\ncan participate in activities that are part of your tour\nmust leave Australia with your tour group before your visa expires\nHow long you can stay\nThis is a temporary visa. If we grant you a visa we will let you know how long you can stay in your visa grant letter. We consider the length of your tour when we determine your stay period.\nWe grant the visa with either:\nsingle entry. If you leave Australia you will have to apply for another visa to come back\nmultiple entry. You can leave and re-enter Australia on this visa while it is valid\nInclude family\nYou can't include family members in your application. A separate application must be made for each member of your family, including those listed on your passport.\nNewborn child\nFind out what to do if your child is born after you apply. \nCost\nThe visa costs AUD195.00.\nYou might also have to pay other costs for health checks, police certificates and biometrics. \nUse the Visa Pricing Estimator to work out what your visa will cost. The estimator does not take into account the other costs.\nApply from\nYou must be in the People's Republic of China when your visa application is lodged and when we make a decision on your application.\nProcessing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour obligations\nYou must meet all visa conditions and obey Australian laws.\nHealth insurance\nWe recommend you take out health insurance to cover any unforeseen medical treatment you might need in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability.\nSee what we consider adequate health insurance.\nLearn more about health insurance for overseas visitors.\nReciprocal healthcare agreements\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements.\nVisa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}