{
    "visaID": "visa5.1",
    "visaType": "visa5",
    "visaName": "Global Special Humanitarian (subclass 202)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/global-special-humanitarian-202",
    "content": "Subclass 202\nGlobal Special Humanitarian visa\nWith this visa you can move to Australia if you face substantial discrimination or human rights abuses, and have a proposer, and stay in Australia permanently with your immediate family.\nFor Applicants\nFor Proposers\n\n\n\n\n\n\n\n\nWith this visa, you can\nstay in Australia permanently\nwork and study in Australia\nenrol in Australia's public healthcare scheme, Medicare\npropose family members for permanent residence\ntravel to and from Australia for 5 years\nif eligible become an Australian citizen\nattend free English language classes through the Adult Migrant English Program\nHow long you can stay\nThis is a permanent visa. It lets you stay in Australia permanently.\nYou become a permanent resident on the day you enter Australia on this visa. This counts for citizenship purposes.\nInclude family\nYou can include family in your application when you apply. You can also add certain family members to your application at any time before we decide on your application.\nFor this visa, your family are:\nyour partner\nyour dependent children\nyour partner’s dependent children\nother relative who is a dependant (parent, sibling, grandparent, grandchild, aunt, uncle, niece, nephew or cousin).\nIf your child is not dependent on you, they must apply for their own visa.\nFamily members who apply for the visa must meet our health and character requirements.\nFamily members who are not coming to Australia might also have to meet our health requirement.\nIt is important to declare all your family members, even if they will not be applying with you.\nIf you do not declare a family member in your application, you may not be able to propose them for a Humanitarian visa after you arrive in Australia.\nCost\nThere is no visa application charge for this visa unless you are proposed under the Community Support Program by an Approved Proposing Organisation.\nApply from\nYou must be outside Australia and outside your country of origin when you apply for this visa.\nProcessing times\nThe Special Humanitarian Program (SHP) receives more applications each year than the number of places available. Most SHP applications will take at least 6 years from date of lodgement to process. Applicants will be notified when their application reaches the next stage of processing or when the application is finalised.\nWe generally acknowledge humanitarian visa applications in writing. This may take some weeks.\nProcessing time is lengthy and varies according to the circumstances of each applicant.\nYour application can take longer to process if:\nyour application form is not filled in correctly\nyou do not include all the documents we need, or we need more information from you\nit takes us time to verify your information.\nWe do not give processing updates.\nPriorities\nSHP applications are processed in order of priority group. Visa applications for family reunion are more likely to be successful if the proposer is an immediate or close family member because they receive a higher priority. \nPriority groups within the SHP are as follows:\nYour proposer is an immediate family member (partner or dependent child, or, if the proposer is under 18 years of age, the proposer's parent). They must also have been granted a Class XB visa or are an Australian citizen who held a Protection or Resolution of Status visa.\nYou must also meet the split-family criteria. This means your proposer:\nwas a member of your immediate family when we granted their visa\ntold us about your relationship before we granted their visa\nproposed your visa application within 5 years of us granting their visa.\nYou do not meet the split-family criteria and your proposer is a close family member (partner, child, parent or sibling) and does not hold a Protection or Resolution of Status visa.\nYour proposer is an extended family member (grandparent, grandchild, cousin, aunt, uncle, niece or nephew) and does not hold a Protection or Resolution of Status visa.\nYour proposer is a distant relative, friend or community organisation and does not hold a Protection or Resolution of Status visa.\nYour proposer holds a Protection or Resolution of Status visa.\nA person who arrived in Australia as an unauthorised maritime arrival (UMA) on or after 13 August 2012 cannot propose family members under the Humanitarian Program. This is in line with the Migration Regulations 1994.\nThe Australian Government has established policy to guide decisions on which applications ought generally to be given priority. This policy includes those who are outside their home country and are one of the following:\nYou are assessed as a refugee by the United Nations High Commissioner for Refugees (UNHCR) and referred to Australia for resettlement.\nYou are proposed by an immediate family member (for example, spouse, child under 18) who holds a Class XB visa (subclass 200, 201, 202, 203 or 204).\nYou are a member of an identified minority group (such as women and girls, ethnic minorities and LGBTQI+) who are referred by UNHCR or proposed by a family member in Australia.\nAs all humanitarian applicants are in similarly compelling circumstances, the Department is unable to expedite applications outside of these priorities.\nYour obligations\nYou must enter Australia before the first entry arrival date (initial arrival date) specified in your grant letter.\nIf you signed a health undertaking, you must comply with it.\nYou and your family members must obey all Australian laws.\nAssisted Passage\nThe Assisted Passage program supports the delivery of Australia’s Offshore Humanitarian Program and provides health screening and medical related services to Special Humanitarian Program visa applicants and visa holders.\nThe Assisted Passage services are currently transitioning from International Organization for Migration (IOM) to Toll Transport Pty Ltd (Toll). During the transition, you may be contacted by either Toll or IOM depending on your location. You and your proposer are responsible for arranging and paying for your travel to Australia.\nAssistance for travel to Australia may be available through the International Organization for Migration (IOM) under their prepaid migration travel program. More information is available on the IOM website Travel to Australia with IOM\nYou or your proposer can also request Toll to assist you with arranging travel. You and your proposer are responsible for paying Toll for your travel to Australia. \nPlease tell us about your travel bookings so that we can ensure you receive settlement assistance when you arrive in Australia.\nTravel\nYou and your proposer or approved proposing organisation are responsible for arranging your travel to Australia. \nIf the first entry arrival date (initial arrival date) specified in your grant letter has passed, contact the visa processing office for a travel facilitation letter. We may first ask you to undergo a fresh medical examination.\nYou can travel to and from Australia for 5 years from the date we grant the visa. After 5 years you will need a Resident Return (RRV) visa (subclass 155) or (subclass 157) to re-enter Australia.\nVisa label\nWe will digitally link your visa to your passport or other travel document. You will not get a label.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}