{
    "visaID": "visa4.2.3",
    "visaType": "visa4.2",
    "visaName": "Significant Investor stream",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/business-innovation-and-investment-188/significant-investor-stream",
    "content": "Business Innovation and Investment (Provisional) visa (subclass 188)\nSignificant Investor stream\nThis provisional visa is for people who invest at least AUD5 million in Australian investments that meet certain requirements and maintain investment activity in Australia.\n\n\n\n\n\n\n\n\nWith this visa, you can\ncarry out investment activity in Australia\nstay in Australia for up to 5 years\nbring eligible members of your family with you\napply for a permanent Business Innovation and Investment (Permanent) visa (subclass 888) Significant Investor stream if certain requirements are met\nHow long you can stay\nThis is a provisional visa. You can stay in Australia for up to 5 years if you were invited to apply on or after 1 July 2021.\nIf you applied after 1 July 2015, and were invited to apply for this visa before 1 July 2021, you can stay in Australia for up to 4 years and 3 months.\nIf you applied for this visa  before 1 July 2015, you can stay in Australia for 4 years.\nThe visa is granted with multiple entries. You can leave and re-enter Australia as many times as you want while the visa is valid.\nThe visa starts on the date it is granted.\nStay longer\nThis is a provisional visa. You must apply for a new visa if you want to stay longer.\nOnce you have this visa, you can apply for permanent residence through the Business Innovation and Investment (Permanent) visa (subclass 888) in the Significant Investor stream, if you meet certain requirements. Explore your visa options.\nIf you need more time to apply for permanent residence, you can apply for a new Business Innovation and Investment (Provisional) visa (subclass 188) in the Significant Investor Extension stream.\nIf granted, you will be able to travel to, enter and remain in Australia for up to 7 years after the date of the grant of the original  Business Innovation and Investment (Provisional) visa (subclass 188) in the Significant Investor Extension stream.\nYou can also apply for a second Significant Investor Extension stream visa. If granted, you will be able to travel to, enter and remain in Australia for up to 9 years after the date of the grant of the original Business Innovation and Investment(Provisional) visa (subclass 188) in the Significant Investor Extention stream.\nInclude family\nYou can add your dependent child or children to your application at any time before we decide on your application. They will need to meet our health and character (if applicable) requirements.\nThe spouse or de facto partner of the main applicant who did not make a combined application at the initial lodgement of the subclass 188 visa, can make a subsequent entrant application. A subclass 188 visa can only be granted to a subsequent entrant after the main applicant’s subclass 188 visa is granted.\nComplete the online 'Application for a Business Innovation and Investment (Subsequent Entrant) Visa' application form in ImmiAccount. An application charge is applicable.\nIn order for the main applicant to be granted the visa, family members who are not coming to Australia must meet our character requirements, and might have to meet our health requirements. \nCost\nThis visa costs AUD14,240.00 for the main applicant.\nThere is also a charge for each family member who applies for the visa with you.\nadditional applicant over 18 years old: AUD7,120.00\nadditional applicant under 18 years old: AUD3,565.00\nAny applicant who was at least 18 years old at the time of application, and is assessed as not having functional English , and has not paid a second instalment of the visa application charge in relation to their application for a Business Innovation and Investment (Provisional) (subclass 188) visa will have to pay this extra charge. Pay it only when we ask you to. We will refund the charge if we do not grant the visa to that applicant.\nThe second instalment charges are:\nmain applicant: AUD9,795\nfamily members: AUD4,890\nUse the Visa pricing estimator to work out what your visa will cost. The estimator does not take into account the second instalment or other costs. You might also have to pay other costs for health checks, police certificates and biometrics.\nApply from\nYou can be in or outside Australia when you apply for the visa and when we decide on your application, but not in immigration clearance.\nProcessing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application might take longer to process if:\nyou do not complete the application form correctly\nyou do not include all the documents we need or we need more information from you\nit takes us time to verify your information\nWe can't process your application if you do not pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\nYour obligations\nYou and your family members who are part of your application must comply with all visa conditions and Australian laws.\nLearn more about conditions for this visa\nMeet your business obligations\nWhile the holder of this visa, you must have a genuine and realistic commitment to:\nyou and/or your spouse or de facto partner must have a genuine intention to live in the State or Territory whose government agency nominated you\ncontinue business and investment activity in Australia after your visa ends\nYou must also maintain your investment for the whole of the visa period and comply with Australian workplace laws.\nTo be eligible for the grant of a Business Innovation and Investment (Permanent) visa (subclass 888) in the Significant Investor stream, you must also live in Australia for at least 40 days per year for the duration of your provisional visa. Or your spouse or de facto partner must live in Australia for at least 180 days per year for the duration of your provisional visa. These days do not need to be consecutive.\nMaintain your investment\nYou must make a complying significant investment of at least AUD5 million. You must hold complying significant investments continuously for the life of your provisional visa.\nYou can switch between complying significant investments if:\nyou reinvest the funds you withdraw from an investment into other complying significant investments within 30 days\nthe sum withdrawn is the same as, or less than, the sum reinvested irrespective of any gains and losses due to market exposures\nIf you reinvest funds into a complying significant investment within 30 days, we count that as holding them continuously.\nIf you withdraw funds from venture capital or emerging company investments, you must reinvest the funds into venture capital or emerging companies.\nIf you withdraw funds from the 'balancing investment' category of investments, you can reinvest them into another balancing investment, venture capital or emerging companies.\nIf you withdraw funds from venture capital because the venture capital investment has been realised, you must reinvest those funds. You can reinvest them in any eligible complying significant investment.\nIncome that you earn from your complying significant investment in Australia may be subject to tax under Australian taxation law.\nNote that the investment rules that were in force at the time that you applied for your Business Innovation and Investment (Provisional) visa (subclass 188) in the Significant Investor stream will continue to apply for the duration of your visa. This includes any Business Innovation and Investment (Provisional) visa (subclass 188) in the Significant Investor Extension stream visas you apply for that relate to your visa.\nYou might want to seek independent legal advice to ensure that an investment is a ‘complying significant investment’. It is your responsibility to ensure your investment options comply with this visa's requirements.\nFor more information about complying significant investments, see the Complying Investment Framework information sheet, and for the 1 July 2021 changes see Business Innovation and Investment Program: Getting a better deal for Australia.\nFollow Australian workplace laws\nAll workers in Australia (including visa holders) have rights and protections at work. Pay rates and workplace conditions are set by Australian law.\nIf you operate a business in Australia, you must comply with workplace laws. The Pay and Conditions Tool (PACT) can help you with:\npay rates\nshift calculations\nleave arrangements and notice\nredundancy entitlements\nAdequate health insurance\nWe recommend you take out health insurance to cover any unforeseen medical treatment you might need in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability.\nSee what we consider adequate health insurance.\nLearn more about health insurance for overseas visitors.\nReciprocal healthcare agreements\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements.\nTravel\nYou can travel outside Australia and return as many times as you want while the visa is valid.\nThe time you spend outside Australia does not extend the visa.\nVisa label\nAustralian visas are digital.\nWe do not put a visa label in your passport. Instead, we link your digital visa record to your passport.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}