{
    "visaID": "visa3.20",
    "visaType": "visa3",
    "visaName": "Prospective Marriage visa (subclass 300)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/prospective-marriage-300",
    "content": "Subclass 300\nProspective Marriage visa\nThis visa lets you come to Australia to marry your prospective spouse and then apply for a Partner visa.\nFor Applicants\nFor Sponsors\n\n\n\n\n\n\n\n\nWith this visa you can\nlive, work and study in Australia for 9 to 15 months from the visa grant date\ntravel to and from Australia as many times as you want while the visa is valid.\nSettle in Australia\nIf you and your spouse want to settle in Australia, apply for a Partner visa (subclass 820 and 801):\nafter you are married\nbefore your Prospective Marriage visa ends.\nHow long you can stay\nThis is a temporary visa. You can stay in Australia for the period specified on the visa grant letter. This is 9 to 15 months from the visa grant date.\nInclude family members\nYou can include members of the family unit in your application.\nwhen you lodge your visa application, or\nadd a dependent child after you lodge your application but before we decide on your temporary visa.\nFamily members who apply with you must:\nbe members of the family unit\nmeet our health requirement\nmeet our character requirement\nbe outside Australia.\nFamily members who are not coming to Australia might also have to meet our health and character requirement. \nNewborn children\nFor information on what to do if your child is born after you apply, see You had a baby. \nCost\nThe visa costs AUD9,095.00 for the main applicant.\nThere is also a fee for each family member who applies for the visa with you. We cannot process your application if you do not pay the correct visa application charge. You might also have to pay other costs for health checks, police certificates and biometrics.\nTo work out how much your visa will cost, including adding additional family members, use the Visa pricing estimator. The estimator does not take into account the costs for health checks, police certificates or biometrics.\nYou will also have to pay a fee for your Partner visa (subclasses 820 and 801). You pay less for this visa if you marry your prospective spouse and apply for the Partner visa before your Prospective Marriage visa ends.\nApply for this visa\nYou must be outside of Australia when you apply for this visa. Family who apply with you must also be outside Australia.\nYour obligations\nYou and your family members must meet all visa conditions and obey Australian laws.\nSee what conditions might be attached to this visa on our visa conditions page.\nIf you are outside Australia at the time of visa grant you must enter Australia before the first entry arrival date (initial arrival date) specified in your grant letter.\nYour marriage\nYou must enter Australia on the Prospective Marriage visa before the date specified on your grant letter.\nYou must have married your prospective spouse before your Prospective Marriage visa expires.\nYou can get married in any country but your marriage must be valid under Australian law.\nAdequate health insurance\nWe recommend you take out health insurance to cover any unforeseen medical treatment you might need while in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability.\nSee what we consider adequate health insurance.\nLearn more about health insurance for overseas visitors.\nReciprocal healthcare agreements\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal health care agreements.\nTravel\nYou can travel to and from Australia as many times as you want while you hold this visa.\nIf you are outside Australia at the time of visa grant you must enter Australia before the first entry arrival date (initial arrival date) specified in your grant letter.\nVisa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nFrequently Asked Questions\nYou can find the answers to common questions about this visa at Partner Program Frequently Asked Questions (FAQs).\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}