{
    "visaID": "visa4.8",
    "visaType": "visa4",
    "visaName": "Pacific Engagement visa",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/pacific-engagement/pacific-engagement-visa-subclass-192",
    "content": "Subclass 192\nPacific Engagement visa\nThis visa allows citizens of Pacific island countries and Timor-Leste to live and work in Australia permanently. Applicants must be selected in a ballot to apply.\n\n\n\n\n\n\n\n\nWith this visa you can\nstay in Australia permanently\nlive, work and study anywhere in Australia\ntravel to and from Australia as long as your travel facility permits.\nsponsor eligible relatives to come to Australia\naccess Australia's public health care scheme, Medicare\nif eligible, apply for Australian citizenship.\nNewly arrived residents may have to wait before they can access certain Australian Government payments and benefits.\nHow long you can stay\nThis is a permanent visa. It lets you stay in Australia indefinitely.\nFor citizenship purposes, your permanent residence starts on either the day:\nwe grant the visa, if you are in Australia or\nyou enter Australia on this visa, if you are outside Australia.\nTravel\nYou can travel to and from Australia as many times as you want for 5 years from the date we grant you this visa. This is as long as the travel facility remains valid.\nIf you want to travel after the initial 5-year travel facility, you must apply for and be granted a Resident Return visa so that you can re-enter Australia as a permanent resident.\nSee when your travel facility ends, use VEVO.\nFor more information, see Overseas travel as a permanent resident.\nYou might also want to consider Australian citizenship. If you become an Australian citizen, you don’t need a visa to enter Australia. Once you are an Australian citizen you can apply for an Australian passport. You can travel to and from Australia on your Australian passport. For more information, see Australian Citizenship.\nInclude family\nYou must include all members of the family unit who wish to come to Australia with you in your application. You will not be able to add them to your application after you have submitted your application.\nWhere you have included a non-biological child a member of the family unit due to adoption, you need to provide further supporting evidence.\nGenerally, adoptions are either formal or customary. In a formal adoption, the child who is adopted becomes the legal child of the adopting parents and a legal member of the adopting family.\nCustomary adoptions are generally not recognised in Australia. Australia recognises adoptions which formally establish parental rights and responsibilities. These adoptions must comply with specific legal requirements to be recognised under Australian migration law.\nFor visa purposes, members of the family unit do not include your parents or partners parents, aunts, uncles, or cousins.\nFamily members who apply for this visa must meet our health and character requirements. They must have also complied with the conditions of any previous visas held. Family members not coming to Australia might also need to meet health and character requirements.\nNewborn child\nFind out what to do if your child is born after you apply.\nCost\nFrom AUD325.00, for the main applicant.\nFrom AUD80.00, for each family member who applies for the visa with you.\nYour application will be invalid if you do not pay the correct visa application charge.\nTo work out what your visa will cost, you can use the Visa Pricing Estimator. The estimator does not take into account other costs, such as health checks, police certificates and biometrics.\nApply from\nYou can be inside or outside Australia, but not in immigration clearance, when you apply for the visa and when we decide on your application. \nProcessing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nWe assess applications on a case-by-case basis. Actual processing times can vary due to individual circumstances including:\nwhether you have submitted a complete visa application, including all supporting documents (see Check twice, submit once)\nhow quickly you to respond to requests for more information\nhow long it takes to perform required checks on supporting information provided\nhow long it takes to receive further information from external agencies, particularly about health, character, and national security requirements.\nVisa label\nWe will electronically link your visa to your passport. You will not get a label in your passport.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}