{
    "visaID": "visa1.4.5",
    "visaType": "visa1.4",
    "visaName": "Frequent traveller stream",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/visitor-600/frequent-traveller-stream",
    "content": "Visitor visa (subclass 600)\nFrequent traveller stream\nThis visa stream is for citizens of the People's Republic of China who travel often to Australia for business or personal reasons.\n\n\n\n\n\n\n\n\nWith this visa you can\nvisit family or friends\nbe here as a tourist, for a cruise or a holiday\nundertake business visitor activities\nHow long you can stay\nThe visa can be granted for up to 10 years. You can enter Australia as often as you like while the visa is valid but you can only stay:\nup to 3 months each time you enter\nfor 12 months in total in any 24-month period\nYour visa grant letter will tell you how long you can stay.\nStay longer\nYou can't stay in Australia longer by extending this visa. You must apply for another visa.\nYou can apply for a new visa if your visa does not have a condition that prevents further stay, such as condition 8503. You might be able to request a waiver of the no further stay condition in limited circumstances.\nYou must not breach condition 8573, no more than 12 months stay in any 24-month period, or condition 8531, must not remain in Australia beyond visa period, if they are attached to your visa.\nYou can explore your visa options.\nInclude family\nYou can't include family members in your application. A separate application must be made for each member of your family, including those listed on your passport.\nNewborn child\nFind out what to do if your child is born after you apply. \nCost\nThe visa costs AUD1,435.00 for each applicant.\nYou might also have to pay other costs for health checks, police certificates and biometrics.\nUse the Visa Pricing Estimator to work out what your visa will cost. The estimator does not take into account the other costs.\nApply from\nYou must be in the People's Republic of China when you apply.\nYou must be outside Australia when we make a decision on your application.\nProcessing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour obligations\nYou must meet all visa conditions and obey Australian laws.\nHealth insurance\nWe recommend you take out health insurance to cover any unforeseen medical treatment you might need in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability.\nSee what we consider adequate health insurance.\nLearn more about health insurance for overseas visitors.\nReciprocal healthcare agreements\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements.\nTravel\nYou can travel outside Australia and return as many times as you want while the visa is valid.\nThe time you spend outside Australia does not extend the visa.\nVisa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}