{
    "visaID": "visa6.3",
    "visaType": "visa6",
    "visaName": "Bridging visa C – BVC – (subclass 030)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-c-030",
    "content": "Subclass 030\nBridging visa C (BVC)\nThis temporary visa generally allows you to stay in Australia after your current substantive visa ceases and while your new substantive visa application is being processed.\n\n\n\n\n\n\n\n\nAbout this visa\nThis is a temporary visa. Nearly all bridging visas are applied for automatically as part of applying for a substantive visa. We may grant you a BVC if you have made a valid application in Australia for a substantive visa but you do not already hold a substantive visa.\nA separate application for a BVC might be necessary where:\nyou are seeking a further BVC without work restrictions\nyou have applied for judicial review.\nYou can't use a bridging visa while you wait for a citizenship application to be decided.\nIn effect\nA BVC comes ‘into effect’ when:\nit is granted; or\nyour current substantive visa ceases; or\nanother bridging visa that is more beneficial than your current bridging visa ceases.\nVisa holders must adhere to the conditions imposed on their visa. Where you are granted a BVC, you will be notified about the conditions that apply. \nIf you hold a substantive visa when your BVC is granted, you must continue to comply with the conditions of the substantive visa. When your substantive visa ceases, the conditions of your BVC will apply.\nThe BVC does not support return travel to Australia. \nRemaining lawful during judicial review\nIf a merits review tribunal upholds our decision to refuse your substantive visa application and you apply for judicial review, you will need to apply for a bridging visa to maintain your lawful status during the judicial review proceedings. If you have applied for judicial review you can only apply for a bridging visa by webform.\nWorking in Australia\nThe initial BVC we grant when you apply for your substantive visa will not let you work, unless the substantive visa you have applied for is one of the following SkillSelect visas:\nBusiness Talent visa (subclass 132)\nBusiness Innovation and Investment (Provisional) visa (subclass 188)\nBusiness Innovation and Investment (Permanent) visa (subclass 888)\nEmployer Nomination Scheme visa (subclass 186)\nRegional Sponsored Migration Scheme visa (subclass 187)\nSkilled — Independent visa (subclass 189)\nSkilled — Nominated visa (subclass 190) \nSkilled — Regional (Provisional) visa (subclass 489).\nIf your BVC does not let you work, or has restrictions on working, you can apply for another BVC that lets you work. To be considered for a BVC that lets you work, you will usually have to demonstrate that you are experiencing financial hardship.\nWe will assess your circumstances in relation to your claim that you need to work. If you do not meet the requirements for work and you are still eligible for a BVC, we will grant you a new BVC with the same work prevention or restriction condition that was on your previous BVC.\nIf you are a Protection visa applicant and you apply for a BVC for judicial review, we can only grant you a new BVC that allows you to work if the last BVC you held allowed you to work.\nIf you are a SkillSelect visa applicant and you are granted a BVC for judicial review, this visa will not initially allow you to work. To be considered for a BVC that lets you work, you will need to make a further BVC application and demonstrate that you are experiencing financial hardship.  \nIf you are not a Protection or SkillSelect visa applicant and you apply for a BVC for judicial review you will only be granted a new BVC that does not allow you to work, even if your last BVC allowed you to work.\nWith this visa you can\nStay lawfully in Australia until your substantive visa application is finally determined, or it granted in association with judicial proceedings, until those proceedings are complete.\nA BVC will end immediately if the following situations occur:\nyou leave Australia while your BVC is in effect\nyou are granted the substantive visa you applied for\nyou are granted another bridging visa in relation to the same substantive visa application that this BVC is associated with, or\nwe cancel either your BVC or the substantive visa that you held when you were granted the BVC.\n \nHow long you can stay\nIn all other situations one of the following outcomes will determine when your BVC ceases: \nyour substantive visa application is refused or deemed invalid\nyour merits or judicial review is decided\nyou withdraw your application for the substantive visa, merits review or judicial review\na merits review tribunal tells you that it has no jurisdiction to consider your application for review.\nOnce you have been notified of an outcome you can see exactly how long you can stay in Australia in VEVO. \nBVC granted on or after 19 November 2016\nYour BVC will cease 35 calendar days after:\nour refusal decision or a decision by the Administrative Appeals Tribunal (AAT) in relation to your associated substantive visa application\na determination that your substantive visa application or an application for review by the AAT is invalid\nyou withdraw your substantive visa application or application for review by the AAT.\nYou BVC will cease 28 calendar days after:\na judicial review body upholds the decision to refuse your substantive visa application\nyou withdraw a related judicial review application.\nBVC granted before 19 November 2016\nYour BVC will cease 28 days after the date that one of the following happens:\nwe notify you that your substantive visa application is not valid\nwe notify you that your substantive visa application has been refused\nyou withdraw your substantive visa application\na merits review tribunal notifies you that it has upheld our decision to refuse your substantive visa application\na merits review tribunal notifies you that it has no jurisdiction to consider your application for review\nyou withdraw your application for merits or judicial review from a merits review tribunal or a judicial review body\na judicial review body upholds the decision to refuse your substantive visa application.\nStay longer\nYou can't stay in Australia longer by extending this visa. You must apply for a new visa if you wish to stay longer.\nExplore your visa options. \nInclude family\nIf you and your family have applied together for a substantive visa in Australia, you might have also applied together for a BVC. Check if family members already hold a BVC in VEVO.\nIf you apply separately for a BVC, you can include members of the family unit in your BVC application, if they are included in your substantive visa application.\nWe will assess each member of the family unit's application and decide which bridging visa they can be granted.\nCost\nFree\nApply from\nYou and anyone included in your application must be in Australia when the BVC application is submitted and granted.\nYour obligations\nYou and anyone included in your application must:\ncomply with all Australian laws\ncomply with the conditions of the current visa (if any held)\ncomply with the conditions of your BVC when it comes in to effect\nSee the conditions that will and might be applied to a BVC.\nTravel\nIf you leave Australia on this visa when it is in effect you will not be able to return on it.  A BVC that is in effect will cease upon departure from Australia. To see if your BVC is in effect, see VEVO.\nAs BVC holder, we cannot grant you a Bridging visa B (BVB) that allows you to travel and return to Australia whilst your substantive visa application is being processed.\nIf you leave Australia and you do not hold another visa that allows you to return, you will have to apply for and be granted a substantive visa before you can return to Australia. There is no guarantee that you will be granted a visa.\nVisa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}