{
    "visaID": "visa3.2",
    "visaType": "visa3",
    "visaName": "Aged Dependent Relative visa (subclass 114)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/aged-dependent-relative-114",
    "content": "Subclass 114\nAged Dependent Relative visa\nThis permanent visa lets a single older person, who relies on a relative living in Australia for financial support, move to Australia permanently.\nFor Applicants\nFor Sponsors\n\n\n\n\n\n\n\n\n\nWith this visa you can\nstay in Australia indefinitely\nwork and study in Australia\nenrol in Australia's public healthcare scheme, Medicare\nsponsor your relatives to come to Australia\napply for Australian citizenship, if eligible\nTravel to and from Australia for 5 years\nYou can travel to and from Australia as many times as you want for 5 years from the date we grant this visa until the travel validity expires.\nIf you want to travel after the initial 5-year travel validity:\nyou will need to apply for and be granted a Resident Return (RRV) so that you can re-enter Australia as a permanent resident\nyou might also want to consider Australian citizenship. If you become an Australian citizen, you don't require a visa to enter Australia. You will need to apply for an Australian passport and use it to leave and re-enter Australia. See more about eligibility requirements and current processing times for Australian citizenship\nTo see when your travel validity ends, use VEVO.\nHow long you can stay\nThis is a permanent visa. It lets you stay in Australia indefinitely.\nFor citizenship purposes, you become a permanent resident at the time:\nyou enter Australia on this visa; or\nif you previously have been present in Australia and held a permanent visa immediately before last leaving Australia, when we grant this visa\nInclude family\nYou can include members of the family unit in your application when you apply. You can also add them to your application at any time before we make a decision.\nYou will be required to include details of all your family members, whether they are migrating or not, in the application form.\nFor this visa, your family members are your dependent child and stepchild.\nFamily members who apply for the visa with you must meet our health and character requirements.\nFamily members who are not coming to Australia might also have to meet our health requirement.\nCost\nThe visa costs from AUD5,125.00. There is also an additional charge for each family member who applies with you.\nYou pay for this visa in 2 parts called instalments.\nPay the first instalment when you apply. Pay the second instalment when we ask you to.\nYou might also have to pay other costs for health checks, police certificates and biometrics.\nUse the Visa Pricing Estimator to work out what your visa will cost. The estimator does not take into account the second instalment or other costs.\nSee more about visa fees and charges.\nApply from\nYou and all applicants must be outside Australia when you apply and when we decide on your application.\nProcessing times\nThe demand for Other Family visas is greater than the number of places available each year. As a result, processing times for these applications can be lengthy.\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application might take longer to process if:\nyou do not fill it in correctly\nyou do not include all the documents we need or we need more information from you and/or\nyour information takes longer than usual to verify.\nWe can't process your application if you don't pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\nApplications for this visa are subject to capping and queueing.\nLearn more about the Other Family Visa queues and processing priorities.\nThe Reports on Migration Programs have further information on Migration Program outcomes against planning for each migration program year.\nYour obligations\nYou must enter Australia before the date specified in your grant letter. The first entry date is generally set at 12 months from the date of visa grant.\nYou and your family members must meet all visa conditions and obey Australian laws.\nSee what conditions might be attached to this visa on our visa conditions page.\nVisa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}