{
    "visaID": "visa3.16",
    "visaType": "visa3",
    "visaName": "Orphan Relative (subclass 837)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/orphan-relative-837",
    "content": "(Subclass 837)\nOrphan Relative visa\nThis visa lets a child who is single and already in Australia stay with a relative if their parents are deceased, can't care for them or can't be found.\nFor Applicants\nFor Sponsors\n\n\n\n\n\n\n\n\nWith this visa the child can\nstay in Australia indefinitely\nwork and study in Australia in line with Australian law\nenrol in Australia's public healthcare scheme, Medicare\nsponsor relatives to come to Australia\napply for Australian citizenship, if eligible.\nTravel to and from Australia for 5 years\nThe child can travel to and from Australia as many times as they want for 5 years from the date we grant this visa. This is as long as the travel facility of this visa remains valid.\nIf the child wants to travel after the initial 5-year travel facility, they:\nwill need to apply for and be granted a Resident Return (RRV) visa to re-enter Australia as a permanent resident\ncan also consider Australian citizenship. If they become an Australian citizen, they won't require a visa to enter Australia. They will need to apply for an Australian passport and use it to leave and re-enter Australia. See more about eligibility requirements and current processing times for Australian citizenship.\nTo see when the child's travel facility ends, use VEVO.\nHow long the child can stay\nThis is a permanent visa. It lets the child stay in Australia indefinitely.\nFor citizenship purposes, the child becomes a permanent resident on the day we grant the visa.\nInclude other children\nIf the child has siblings who also want to apply, make a separate application for each sibling.\nThe child's dependent children can be included on their application when they apply or at any time before we decide the application.\nDependent children of the child who apply for the visa must meet our health requirement.\nFamily members who are not coming to Australia might also have to meet our health requirement.\nCost\nThe visa costs AUD1,920.00 for the main applicant.\nThere is also a charge for each of the child's dependent children who apply for the visa.\nThere might also be other costs for health checks, police certificates and biometrics. \nUse the Visa Pricing Estimator to work out what your visa will cost. The estimator does not take into account the other costs.\nApply from\nThe child must be in Australia when the application is made and when we make a decision.\nThe child can't validly apply for this visa if they are in Australia on another visa with a no further stay condition.\nProcessing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nThe application might take longer to process if:\nit is not filled in correctly\nit does not include all the documents we need or we need more information from you\nit takes us time to verify your information.\nWe can't process the application if you do not pay the correct visa application charge. We will tell the applicant if this is the case. We will return the application if necessary.\nThe child's obligations\nThe child and any of their dependent children who are granted the visa must obey all Australian laws.\nVisa label\nWe will digitally link the child's visa to their passport. They will not get a label in their passport.\nIf we grant the visa, we will send a grant notification letter containing the visa grant number. Use this number to access the digital visa record.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}