{
    "visaID": "visa5.2",
    "visaType": "visa5",
    "visaName": "Protection visa (subclass 866)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/protection-866",
    "content": "Subclass 866\nProtection visa\nThis visa is for people who arrived in Australia on a valid visa and want to seek asylum. It lets you stay in Australia permanently, if you engage Australia’s protection obligations and meet all other requirements for the grant of the visa.\n\n\n\n\n\n\n\n\nWith this visa, you can\nlive, work and study in Australia permanently\naccess government services such as Medicare and Centrelink services\nsponsor eligible family members for permanent residence through the offshore Humanitarian Program\ntravel to and from Australia for 5 years\nif eligible become an Australian citizen\nattend English language classes for free if you are eligible\nHow long can you stay\nThis is a permanent visa. It lets you stay in Australia indefinitely.\nYou become an Australian permanent resident on the day we grant the visa.\nFor Australian citizenship purposes, your permanent residence starts on the day we grant the visa.\nIncluding family members\nMembers of the same family unit may apply together on the same application. They must:\nbe in Australia at the time of application\nbe eligible to apply for this visa\nMembers of the same family unit are:\nspouse or de facto partner of the family head\ndependent child or step-child of the family head\ndependent child or step-child of the family head’s partner\nother dependent relatives of the family head\nThe family head can be you. It can also be someone else in your family who has not applied for this visa.\nA dependent child is a child or step-child who is under 18 years old. A dependent child can be 18 years old or older if they are:\nincapacitated for work due to loss of their bodily or mental functions; or\nwholly or substantially reliant on their parent or step-parent for financial, psychological or physical support\nWe do not consider a child or step-child of any age to be a dependent child if they are currently married, engaged to be married or in a de facto relationship.\nChildren who are not dependent children must apply for their own visa\nOther dependent relatives may include relatives such as the family head’s:\nparent\nbrother/sister\ngrandparent/grandchild\naunt/uncle\ncousin\nniece/nephew\nor step equivalent to any of the above\nWe consider a relative to be a dependent relative of the family head if they:\ndo not have a spouse or de facto partner\nusually lives with the family head; and\nare wholly or substantially reliant on the family head for financial, psychological or physical support\nMembers of the same family unit applying for this visa must meet our health, character and security requirements.\nNewborn child\nIf a child is born after you submit your application and before we make a decision on your application, the child will be taken to be included in that application. You must tell us as soon as possible by:\ncompleting Form 1022 Notification of change of circumstances (172KB PDF)\nproviding a clear colour copy of their original birth certificate\nattaching them in ImmiAccount or sending them by post to the address where you sent your application. You will need to send a certified copy of the child’s birth certificate if you send it by post.\nIf a child is born in Australia, we automatically grant them the same visas their parents hold at the time of the child’s birth.\nIf either parent is an Australian citizen or Australian permanent resident at the time of the child’s birth, the child might be an Australian citizen by birth.\nCost\nAUD45.00\nApply from\nYou must be in Australia when you apply for the visa.\nProcessing times\nWe aim to finalise protection visa applications as quickly as possible. This is a very complex process and will take some time. You can assist us in finalising your application by responding to any requests from us within the specified timeframes.\nYour application can take longer to process if:\nyou do not fill in your application in correctly\nyou do not include all the documents we need\nwe need more information from you\nyou do not respond to requests for information quickly\nit takes us time to verify your information\nYour obligations\nYou and your family members must obey all Australian laws.\nTravel\nYou can travel to and from Australia for 5 years from the date we grant the visa. After 5 years you will need a Resident Return (RRV) visa (subclass 155) or (subclass 157) to re-enter Australia.\nIf you want to travel outside Australia, after we grant the visa, you should first contact any Australian Passport Office of the Department of Foreign Affairs and Trade to  apply for a travel document\nWe recommend that you do not use the passport or travel document issued to you by your country of nationality. If you do so, we may consider that you are no longer in need of protection from your home country and we may cancel your visa.\nTravel to the country from which we granted you protection\nTravel condition 8559 applies to this visa.\nIf we grant you this visa, you and members of your same family unit, must not enter the country or countries from which we granted you protection unless we approve that entry in writing before you travel.\nWe will only give you approval to enter the country from which we granted you protection if there are compassionate or compelling circumstances justifying your travel.\nIf you enter the country from which we granted you protection without written approval, even for a short time, you will breach condition 8559. As a result, we might cancel your visa and the visas of members of your family unit.\nBefore you travel, see condition 8559.\nVisa label\nWe will digitally link your visa to your travel document or ImmiCard. You will not get a label in your travel document.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}