{
    "visaID": "visa6.7",
    "visaType": "visa6",
    "visaName": "Maritime Crew visa (subclass 988)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/maritime-crew-988",
    "content": "Subclass 988\nMaritime Crew visa\nThis visa allows foreign crew on a Maritime Crew visa eligible ship to enter Australia by sea when on an international voyage. It is also for the partner or dependent child of a foreign crew member of an eligible ship, when on the same ship.\n\n\n\n\n\n\n\n\nWith this visa you can\narrive and depart Australia by sea as a crew member of an MCV eligible ship\nstay in Australia for as long as you are signed on as a crew member of an MCV eligible ship\nsign off your ship in Australia to leave Australia, or to join another MCV eligible ship\nonly perform work in Australia as a crew member that meets the normal operational duties of your MCV eligible ship.\nWith this visa you cannot:\nenter Australia by air only holding this visa. To fly to Australia, you will also need another visa to enter\nenter Australia by sea on a type of ship that is not specified as eligible for an MCV\nstay as a visitor or tourist, or permanently. You can hold a Visitor visa at the same time as you hold an MCV to visit or sightsee Australia while you are not working as a crew member on a ship\nwork in Australia, in port or at sea, doing work that is not directly related to the operation of the ship as a member of crew\nbypass Australia’s health and quarantine requirements.\nFor more information on visa options, see Explore visa options.\nWhich ships you can work on in Australia\nShips that do meet the eligibility for a Maritime Crew Visa include:\ncargo ships carrying goods between Australia and overseas ports\ninternational cruise ships with paying passengers\nforeign government owned and operated research ships\nships granted Public Vessel Status by Australia’s Department of Foreign Affairs and Trade\nships that have been entered for home consumption or imported under specific sections of Australia’s Customs Act 1901 and that have been registered on the Australian International Shipping Register (this does not include registration on the Australian General Shipping Register).\nShips that are not eligible include:\nsmall marine crafts, yachts and superyachts\npetroleum export tankers that go to both an offshore resource activity area and an Australian port on the same international journey\ntrawlers and cable laying vessels\nmost fishing vessels\nresearch vessels that are not owned and operated by a foreign government.\nApply from\nYou must be outside Australia when you apply. You can be inside or outside Australia when your visa is decided.\nYou must not travel to Australia without a visa.\nHow long you can stay\nMaritime Crew visas last for three years unless they are ceased for one of the following reasons:\nyou try to enter Australia, or you are working in Australia, on a ship that is not a MCV eligible ship\nwhile in Australia, you do work that is not related to the normal operational duties of the ship\nyou arrive in Australia by air and do not sign on to your ship within five days of arrival or before any other visa you hold ceases, whichever is longer\nyou sign off your ship, and you do not:\nleave Australia\nhold another type of visa or\nsign on to another MCV eligible ship within five days (or a period specified by the Department of Home Affairs)\nyour ship has been imported or brought into Australia for sale and:\nwas not registered on the Australian International Shipping Register, or\nit was registered but that registration has ceased, and\nyou do not leave Australia, hold another suitable visa, or sign on to another MCV eligible ship within five days (or a period specified by the Department of Home Affairs)\nyou leave a vessel after arriving in Australia without being immigration-cleared\nyou hold another visa and the other visa is cancelled for a reason other than on character grounds\nwe determined that it is undesirable for you to continue to hold a Maritime Crew visa.\nWhile the visa is valid you can enter Australia by sea as a member of a Maritime Crew visa eligible ship as many times as you want.\nIf you want to enter Australia by air to join a ship, and you hold a Maritime Crew visa, you will need another visa to enter.\nFor more information on visa options, see Explore visa options.\nStay longer\nYou cannot apply for a new Maritime Crew visa while you are in Australia. You must apply for another visa. You need to do this before your current visa ceases.\nFor more information on visa options, see Explore visa options.\nInclude family\nMembers of the family unit can apply for Maritime Crew visas if they are travelling on the same ship as you with permission from the vessel master. They must lodge separate application forms.\nThe Maritime Crew visa held by members of your family unit will cease if:\nyour Maritime Crew visa ceases\nthey enter Australia on a ship without you and don't hold a valid visa other than the Maritime Crew visa\nthey stop travelling with you and do not leave Australia or get another visa.\nFamily members are not permitted to work in Australia on a Maritime Crew visa.\nTravel\nYou can enter Australia by sea as a member of a Maritime Crew visa eligible ship as many times as you want while the visa is valid.\nYou cannot fly into Australia only holding a Maritime Crew visa.\nCost\nFree\nProcessing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour obligations\nYou and members of your family unit must meet all visa conditions and obey Australian laws.\nLearn more about conditions for this visa.\nHealth insurance\nYou are personally liable for all your healthcare costs while you are in Australia. Medical insurance helps limit your financial liability.\nLearn more about health insurance for overseas visitors.\nReciprocal healthcare agreements\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements.\nVisa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}