{
    "visaID": "visa1.4.1",
    "visaType": "visa1.4",
    "visaName": "Tourist stream (apply outside Australia)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/visitor-600/tourist-stream-overseas",
    "content": "Visitor visa (subclass 600)\nTourist stream (apply outside Australia)\nThis visa stream lets you visit Australia as a tourist, to go on a cruise or to visit family and friends.\n\n\n\n\n\n\n\n\nWith this visa you can\nvisit family and/or friends\nbe here as a tourist, for a cruise or for any purpose except business or medical treatment\nYou can study or train for up to 3 months on this visa. But if your main reason for travelling to Australia is study, a student visa might be more appropriate.\nYou can't work.\nCruise\nYou will need a visa if you enter Australia during a cruise.\nIf your cruise is a round trip cruise, the time you spend on the cruise counts as time spent in Australia. We do not consider you to have left Australia. A round trip cruise will not reset your stay period on your visa.\nAsk your cruise operator or travel agent if we consider your cruise to be a round trip cruise.\nHow long you can stay\nThis is a temporary visa. \nYou can stay for the period or dates specified on the visa grant letter. We determine the length of your visa on a case by case basis. Things we might consider when determining your stay period include:\nhow long you want to stay\nwhy you want to stay in Australia\nWe might not grant the length of stay you want.\nWe can grant this visa with a single entry or multiple entry.\nIf we grant you a visa with multiple entry, you can leave and return to Australia on the visa while it is valid.\nGenerally, we grant a stay period of 3 months. We might grant a stay of up to 12 months in certain circumstances.\nConsider the Visitor visa (subclass 600) Frequent Traveller stream if:\nyou hold a passport from the People’s Republic of China and\nyou travel to Australia frequently.\nParents of Australian citizens or permanent residents\nIf you are the parent or step-parent of an Australian citizen or permanent resident, and you meet all the visa criteria, we may grant you a visa that is valid for more than 12 months.\nWe consider these applications on a case-by-case basis. \nIf we grant you a visa that is valid for more than 12 months you might be able to enter Australia multiple times while the visa is valid. You can’t stay in Australia for more than 12 months in total in any 18 month period. You must also have made adequate arrangements for health insurance. \nIf you want to stay longer than 12 months on each visit you might be eligible for a Sponsored Parent (Temporary) visa.\nStay longer\nYou can't stay in Australia longer by extending this visa. You must apply for another visa in Australia.\nYou can apply for a new visa if your current visa does not have a condition that prevents further stay, such as condition 8503 - No Further Stay. We can waive a no further stay condition in limited circumstances.\nIf you want to stay longer or permanently in Australia you will need to apply for a visa that allows this.\nExplore your visa options.\nInclude family\nYou can't include family members in your application.\nEach family member, including those listed on your passport, must submit a separate application.\nCost\nThis visa costs from AUD195.00 for each applicant.\nYou might also have to pay other costs for:\nhealth checks\npolice certificates\nbiometrics \nTo work out what your visa will cost use the Visa Pricing Estimator. The estimator does not take into account the other costs.\nApply outside Australia\nTo be eligible for this visa, you must be outside Australia when you apply and when we decide your application.\nSee other eligibility requirements.\nProcessing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour obligations\nYou must comply with all visa conditions and Australian laws.\nLearn more about visa conditions.\nHealth insurance\nYou are liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability. To cover any unexpected medical treatment you might need in Australia, we strongly recommended you take out adequate health insurance.\nLearn more about health insurance for overseas visitors.\nSome countries have a reciprocal healthcare agreement with Australia.\nIn some circumstances, we might grant your visa with Condition 8501 – Maintain adequate health insurance.\nTravel\nCheck if you have multiple entry, or single entry, in VEVO or your visa grant letter.\nIf you have multiple entry, you can travel outside Australia and return while your visa is valid.\nIf you have single entry and you leave Australia, you have to apply for another visa to return.\nVisa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}