{
    "visaID": "visa6.5",
    "visaType": "visa6",
    "visaName": "Crew Travel Authority visa (subclass 942)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/crew-travel-authority-942",
    "content": "Crew Travel Authority\nThis Authority is for international airline crew who don't have an Australian or New Zealand passport, or a valid Australian visa who travel to and from Australia as they work.\n\n\n\n\n\n\n\n\nAbout this authority\nUnder the Special Purpose visa framework, a Crew Travel Authority (subclass 942) is an electronic immigration record. Commercial airlines register crew members for Crew Travel Authorities to aid uplift. The registration is valid for the life of the passport. Commercial airlines can use the Carrier Portal to check that their international aircrew can legally enter Australia.\nInternational airline flights include:\ncommercial passenger flights or\nchartered passenger flights or\nfreight or cargo flights\nCrew members with Australian or New Zealand passports do not need Crew Travel Authorities.\nIf you are a New Zealand citizen further information regarding your entry requirements, entitlements and pathway to permanent residence and citizenship can be found at the New Zealand citizens webpage.\nPrivate flight operators\nPeople operating private flights can't register for, or use a Crew Travel Authority (subclass 942) to enter Australia. The flight must be a commercial or chartered flight carrying passengers or cargo.\nTo see what other visas you might be eligible for use the Visa Finder. \nWith this travel authority you can\nvisit Australia as part of your work as an international airline crew member or aircraft safety inspector who is employed by a foreign government\narrive as a passenger (as an airline positioning crew member) on a commercial aircraft to move an international aircraft from Australia\narrive in Australia as an aircraft safety inspector, if you hold a valid government identity document showing you are employed by a foreign government, or if you hold an International Civil Aviation Organization (ICAO) Safety Inspector Certificate\nHow long you can stay\nIf you are an international airline crew member or aircraft safety inspector, you can stay in Australia for up to 30 days.\nIf you are an airline positioning crew member, you can stay in Australia for up to 5 days.\nNew Zealand passport holders\nIf you are a New Zealand citizen crew member who arrives in Australia and do not hold another visa (such as a permanent residence visa) and you wish to remain in Australia longer than the above periods, you should not enter Australia via SmartGate. Instead, you should approach a border clearance officer and make an application to be granted a Special Category visa (subclass 444) by:\ncompleting an incoming passenger card and\npresenting your New Zealand passport\nThe SCV will allow you to live, visit, work and study in Australia.\nWhen you leave Australia, your SCV will end. Next time you enter Australia, you will apply for a new SCV.\nEntering Australia on a Special Purpose visa as a crew member rather than an SCV may impact your status as a resident for social security purposes.\nIf you apply for the SCV after you arrive in Australia, you will need to apply online and attend an appointment. For further information see New Zealand citizens\nStay longer\nYou can't stay in Australia as the holder of a Special Purpose visa longer than allowed. You must apply for another type of visa if you want to stay longer.\nCost\nFree\nObligations\nYou must obey Australian laws. You cannot use a Crew Travel Authority to:\ntravel as a passenger to Australia, unless you are an airline positioning crew member or\nwork on more than one domestic leg in Australia, this domestic leg must be part of an international arrival or departure flight\nTravel\nYou can travel outside Australia and return as many times as you want when working as an airline aircrew member or as an airline safety inspector, while the Crew Travel Authority is valid.\nThe time you spend outside Australia does not extend the Crew Travel Authority.\nThe Crew Travel Authority registration is valid for the life of your passport and is based on your passport expiry date.\nVisa label\nWe will digitally link your Crew Travel Authority to your passport. You will not get a label in your passport.\nInclude family\nYou can't include family on this travel authority.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}