{
    "visaID": "visa1.2",
    "visaType": "visa1",
    "visaName": "eVisitor (subclass 651)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/evisitor-651",
    "content": "Subclass 651\neVisitor\nVisit Australia as often as you wish in a 12-month period. Stay up to 3 months each time you enter Australia.\n\n\n\n\n\n\n\n\nWith this visa you can\nTravel to Australia:\nas a tourist - for example, to cruise or have a holiday \nto visit family or friends\nas a business visitor\nYou can study or train for up to 3 months in total on this visa. But if your main reason for travelling to Australia is study, a student visa might be more appropriate.\nNote: Applicants who are seeking to train at a childcare centre, study to be a doctor, dentist, nurse or paramedic or enter health care or hospital environments should apply for the Visitor (subclass 600) visa and complete the relevant health checks.\nCruise\nYou will need a visa if you enter Australia during a cruise.\nIf your cruise is a round trip cruise, the time you spend on the cruise counts as time spent in Australia - that is, we do not consider you have left Australia. A round trip cruise will not reset your stay period on your visa.\nAsk your cruise operator or travel agent if we consider your cruise to be a round trip cruise.\nBusiness visitor\nAs a business visitor, you can:\nmake general business or employment enquiries\ninvestigate, negotiate, enter into or review a business contract\nconduct activities as part of an official government visit\ntake part in a conference, trade fair or seminar. The organisers can't pay you to take part\nYou can't:\nwork for or provide services to a business or organisation based in Australia\nsell goods or services directly to the public\nIf you want to do short-term work in Australia that isn't a business visitor activity, consider applying for a temporary work visa.\nHow long you can stay\nThis is a temporary visa. We grant it for 12 months. You can enter Australia any time your eVisitor is valid and stay for up to 3 months at a time.\nThe eVisitor is granted with multiple entry. You can leave and re-enter Australia as many times as you want while it is valid.\nThe eVisitor starts on the date it is granted. \nStay longer\nYou can't stay in Australia longer by extending this visa. You must apply for another visa.\nIf you want to have a further short stay or stay longer for a holiday you might be eligible for a Visitor visa (subclass 600) Tourist stream (apply in Australia).\nIf you want to stay longer for other reasons, you should be able to apply for a new visa that suits your circumstances.\nExplore your visa options.\nInclude family\nYou can't include family members in your application. A separate application must be made for each member of your family, including those listed on your passport.\nCost\nThe eVisitor is free.\nApply from\nYou must be outside Australia when you apply.\nDo not arrange to travel to Australia until we let you know, in writing, that we have granted you the subclass 651 visa.\nYou must be outside Australia when we decide on your application.\nProcessing times\n25% of applications: Less than 1 Day\n50% of applications: Less than 1 Day\n75% of applications: Less than 1 Day\n90% of applications: Less than 1 Day\n \nYour obligations\nYou must meet all visa conditions and obey Australian laws.\nHealth insurance\nWe recommend you take out health insurance to cover any unforeseen medical treatment you might need in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability.\nSee what we consider adequate health insurance.\nLearn more about health insurance for overseas visitors.\nReciprocal healthcare agreements\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements.\nTravel\nYou can travel outside Australia and return as many times as you want while the eVisitor is valid.\nVisa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}