{
    "visaID": "visa2.1",
    "visaType": "visa2",
    "visaName": "Student visa (subclass 500)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/student-500",
    "content": "Subclass 500\nStudent visa\nVisit Australia to participate in a course of study.\n\n\n\n\n\n\n\n\nWith this visa you can\nparticipate in an eligible course of study in Australia\ntravel in and out of Australia\nwork up to 48 hours a fortnight when your course of study or training is in session (students studying a masters by research or doctoral degree, and their families, have no work limit).\nHow long you can stay\nThis is a temporary visa to study up to 5 years. The type of course and its length will determine the length of stay\nPrimary school children starting their enrolment in years 1-4 will generally only be granted a student visa for a maximum period of 3 years.  \nStay longer\nTo continue studying in Australia, you must apply for a new Student visa.\nIf your Student visa will expire before your graduation you might be eligible for a Visitor visa (subclass 600). You will need a letter from your education provider with the date of your graduation.\nIf you hold or held a student visa and completed specific qualifications in Australia in the last six months, you might be eligible for a Temporary Graduate visa (subclass 485).\nIf you want to stay longer for other reasons, you must apply for a new visa that suits your circumstances. Explore your visa options.\nCost\nThe visa costs from AUD1,600.00 for the main applicant, unless they are exempt.\nThere is also a charge for each family member who applies for the visa.\nEligible Pacific Island and Timor-Leste citizens can apply for a partial refund of the cost, see Getting a refund.\nYou might also have to pay other costs for health checks, police certificates and biometrics.\nTo work out what your visa will cost, use the Visa Pricing Estimator. The estimator does not take into account the other costs.\nStudents affected by COVID-19\nIf you held a Student visa on or after 1 February 2020, you may be eligible to have your visa application fee waived so you can submit a further Student visa application. You may be eligible if you:\nhave deferred your study as you were unable to enter Australia due to travel restrictions\nwere forced to reduce to a part-time study load\nwere unable to complete your work-based training or placements.\nThis measure does not apply to students who are lodging a new student visa application because of ordinary reasons, including if you have:\nfailed a course or unit of study\ndeferred for personal reasons\nvoluntarily reduced your study load.\nYou must apply for a Student visa to have your application for a fee waiver considered. Attach a completed Form 1545 COVID-19 Impacted Student (229KB PDF) from your education provider.\nIf you are applying for a fee waiver in Australia, we will not issue a Bridging visa automatically as the fee exemption must be checked first. You do not need to contact the department if you have applied for a fee waiver in Australia and have not been issued a Bridging visa immediately.\nThis waiver only applies to the visa application charge.\nInclude family\nYou can include family members when you lodge your visa application. For student visas, your family member is:\nyour partner, or\nyour or your partner's dependent child who is unmarried and has not turned 18 years of age.\nWe cannot grant a student visa to your child if they have turned 18 years at the time your visa is finalised. They need to apply for their own visa.\nYou must declare your family members in your student visa application even if they do not plan to travel with you to Australia. If you do not do this, your family members will not be eligible for a student visa to join you in Australia.\nYour family members can also apply as a subsequent entrant (at a later time, separate from your application) in ImmiAccount.\nFamily members who apply for the visa must meet our requirements for health and character.\nCheck the annual school costs you will need to pay for any dependent children to go to either public or private schools in Australia.\nFor more information see ‘Evidence you have enough money for your stay’ section under Gather documents.\nApply from\nYou can be in or outside Australia when you apply for the visa and when we decide on your application. If you are in Australia you must hold an eligible substantive visa. For more information see ‘Have this visa if applying while in Australia’ under Eligibility.\nPackaged courses\nYou will need to give us Confirmation of Enrolment (CoE) for each course. The last course you take as part of the course package is your main course of study. We use your main course of study to work out what financial and English language skills evidence you must give us.\nIf your visa application includes a package of courses, course gaps must be less than two calendar months, unless the first course finishes at the end of the standard academic year and the next course commences at the beginning of the standard academic year.\nFor example, the academic year generally ends in November and starts again in February the following year, three to four months is an acceptable gap between courses. \nStandard visa grant periods apply to packaged courses.\nProcessing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nWe are currently processing all student visa applications by order of priority under the Ministerial Direction No. 107 (325KB PDF). We will continue to assess all applications in date order in each priority category. Visa applications in lower priority will take longer to process.\nYour application can take longer to process if:\nyou do not fill it in correctly\nyou do not include all the documents we need or we need more information from you\nit takes us time to verify your information.\nWe can't process your application if you do not pay the correct visa application charge. We will tell you if this is the case.\nYour obligations\nYou and your family must meet all visa conditions and follow Australian laws.\nSee which conditions will and might be attached to this visa.\nTravel\nYou can travel outside Australia and return as many times as you want while the visa is valid.\nThe time you spend outside Australia does not extend the visa.\nVisa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}