{
    "visaID": "visa4.9.1",
    "visaType": "visa4.9",
    "visaName": "Direct entry stream",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/regional-sponsor-migration-scheme-187/direct-entry-stream",
    "content": "Regional Sponsored Migration Scheme visa (subclass 187)\nDirect entry stream\nFor Applicants\nFor Sponsors\n\n\n\n\n\n\n\n\n\nWith this visa, you can\nstay in Australia indefinitely\nwork and study in Australia\nenrol in Australia’s public health care scheme, Medicare\nsponsor eligible relatives to come to Australia\ntravel to and from Australia for 5 years\nif eligible, become an Australian citizen\nNewly arrived residents may have to wait before they can access certain Australian Government payments and benefits. \nHow long you can stay\nThis is a permanent visa – it lets you stay in Australia indefinitely.\nYou become a permanent resident on the day the visa is granted.\nYour permanent residency for citizenship purposes starts:\non the day the visa is granted if you are in Australia\non the day you enter Australia on this visa if you are outside Australia\nInclude family\nYou can:\ninclude family members in your application when you apply\nadd family members to your application after you apply but before we decide on your visa\nFor this visa, your family members are:\nyour partner\nyour dependent child or stepchild\nyour partner's dependent child or stepchild\nthe dependent child or stepchild of your or your partner's dependent child or stepchild\nYou can also include someone who holds a subclass 457 visa or subclass 482 visa if we granted them that visa on the basis they are a member of your family.\nFamily members who apply for the visa with you must meet our health and character requirements.\nFamily members who do not apply for the visa with you might also have to meet the requirements.\nYou might have to pay an extra charge for family members 18 years old or older who have less than Functional English. This charge is called the second instalment.\nApply from\nYou can be in or outside Australia when you apply for the visa. If you are in Australia you must hold a substantive visa or a Bridging visa A, B or C.\nYou can be in or outside Australia when we decide on your application.\nProcessing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application can take longer to process if:\nyou do not fill it in correctly\nyou do not include all the documents we need or we need more information from you\nit takes us time to verify your information\nWe can't process your application if you do not pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\nYour obligations\nYou and your family members must obey all Australian laws.\nWe expect that you will work for your nominating employer in regional Australia for at least 2 years. If you don't, we might cancel your visa.\nYou must begin your employment within 6 months of:\nentry to Australia if you were granted the visa outside Australia\nthe visa grant date if you were granted the visa in Australia\nTravel\nFrom the date we grant this visa, you can travel to and from Australia for up to 5 years.\nAfter that period, you will need a Resident Return (RRV) visa to re-enter Australia as a permanent resident.\nIf you leave Australia after the expiry date of your travel facility, without being granted another permanent visa with a valid travel facility, for example a Resident Return (RRV), you might not be able to return to Australia as a permanent resident. \nTo see when your travel condition ends, use VEVO.\nVisa label\nAustralian visas are digital. You will not get a label in your passport.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}