{
    "visaID": "visa6.9",
    "visaType": "visa6",
    "visaName": "Resident Return visa (subclass 155 157)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resident-return-visa-155-157",
    "content": "Subclasses 155 and 157\nResident Return visa\nIf you leave Australia after your travel validity expires, or it expires when you are outside Australia, you will not be able to return to Australia as a permanent resident. This visa allows you to return as a permanent resident.\n\n\n\n\n\n\n\n\nWith this visa you can\ntravel to and from Australia as a permanent resident until the travel facility of your visa expires \nIf you leave Australia after your permanent visa travel facility has expired, you will not be able to return to Australia as a permanent resident. If you wish to return to Australia as a permanent resident, you must apply for and be granted this visa before your arrival in Australia.\nIf you are already in Australia as a permanent resident, you do not need to apply for this visa if you do not wish to travel.\nThere are no limits on the number of Resident Return visas (RRV) you can apply for.\nFor more information, see Overseas travel as a permanent resident.\nCheck the travel facility expiry date of your permanent visa before you apply for an RRV to see if it covers your intended travel period. You can check this on VEVO.\nCost\nAUD475.00 for each applicant if you apply online (you must apply online unless we authorise you to apply on paper).\nAUD555 for each applicant if we authorise you to apply on paper. If you are exempt from paying the Non-internet application charge a repayment will automatically be processed and the payment returned to you.\nYou might also have to pay for other costs including health checks, police certificates and biometrics. We will advise you if this is required.\nTo work out what your visa will cost, use the Visa Pricing Estimator. The estimator does not take into account the other costs.\nRRV Refunds\nGenerally, you will not be given a refund just because:\nyour RRV application was refused\nyou lost the travel facility remaining on your previous visa when your RRV was granted\nyou did not use the travel facility attached to your RRV (regardless of the reason).\nIf you think we made a mistake that caused you to lodge your RRV application in error, let us know. Provide documentary evidence with your request to support your claim.\nHow long the travel facility lasts\nIf you are granted an RRV, the travel facility will vary depending on your circumstances.\nIf you : \nwere present in Australia for a total of at least 2 years in the last 5 years as a permanent visa holder or Australian citizen, then you meet what is known as the ‘residence requirement’ and will be given a 5-year travel facility on your RRV.\nhave not met the ‘residence requirement’ but have demonstrated you have substantial ties with Australia that benefit Australia, then you can only be given a maximum of 12 months travel facility on your RRV. See ‘eligibility’ for the requirements.\nhave applied as a member of the family unit of a person who already holds an RRV, or who has lodged a separate application for an RRV and meets the time of application criteria for grant, then you can only be given a maximum of 12 months travel facility on your RRV.\nhave not met any of the above requirements, but have compelling and compassionate reasons for departure, then you can only be given 3 months travel facility on your RRV (subclass 157) if you have not been absent from Australia in the 5 years prior to making an application.\nIt is not possible to carry over the remaining travel facility from any previous visa to the subsequently granted RRV. You will not be able to get a refund for any lost travel facility.\nYou will not be able to request extension of travel facility, regardless of the circumstances (within or outside of your control).\nIt is not possible to postpone the grant of an RRV once all visa requirements are met.\nIf you have already applied for an RRV and find that the travel facility attached to your current permanent visa will cover your intended travel period, you should consider withdrawing your pending RRV application. You should do this in writing as soon as possible. See You want to withdraw a visa application.\nIf you hold an RRV, you should always be aware of the expiry date of the travel facility before any travel arrangements are made. You can check this on VEVO.\nWe will send you a reminder about the expiry of the travel facility of your RRV (Subclass 155) visa. We will not send you a reminder if you have a pending RRV application. If you need to travel, you should apply for a new RRV before your existing travel facility expires. This will help you avoid delays. For more information about the Travel Facility Expiry Reminder (TFER) and which permanent visa holders receive them, see Overseas travel as a permanent resident.\nIf you return to Australia without a permanent visa and a valid travel facility (for example, when holding a visitor visa), this might impact your:\nentitlements as a permanent resident\nability to satisfy the permanent residence requirements when applying for Australian citizenship or another RRV.\nYou do not need to apply for an RRV if:\nyou are in Australia,\nyour travel facility has expired, and\nyou do not wish to travel.\nInclude family\nYou can't include family members in your application.\nIf other family members are also applying for this visa separately at the same time, then you can have all your applications processed together, if you declare them in your application.\nWhile you can’t include family members as secondary visa applicants in your application, you should provide information about any immediate family members who are Australian citizens or permanent residents in your application. This is important, if you are trying to show that you have substantial ties of benefit to Australia.\nApply from\nYou can be in or outside Australia when you apply for the visa but not in immigration clearance. If we authorise you to apply using a paper form, you must follow the instructions given to you otherwise your application may be invalid. If your application is invalid, it cannot be considered. You cannot apply in person.\nIf you have applied for your visa but have not been granted it and you need to travel urgently see contact us.\nProcessing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nGenerally, applications that:\nmeet the residence requirements will be processed within 5 working days from lodgement\ndo not meet the residence requirement will take longer to process. For example, this can be 12 weeks from lodgement or more.\nYour application can also take longer to process if:\nyou do not fill it in correctly\nyou do not include all the documents we need\nwe need more information from you\nit takes us time to verify your information\nYour application will not be processed if you do not pay the correct application charge. If necessary, you will be notified and any charges repaid.\nYour obligations\nYou must obey all Australian laws.\nTravel\nYou can travel for a specified period from the date your visa is granted.\nAfter that period, you will need another RRV visa to re-enter Australia as a permanent resident. Alternatively, you may wish to consider your eligibility for Australian Citizenship so you can travel on an Australian passport.\nSee when your existing travel facility ends in VEVO.\nVisa label\nWe will digitally link your visa to your valid travel document. You will not get a label in your passport.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}