{
    "visaID": "visa7.5.1",
    "visaType": "visa7.5",
    "visaName": "Significant Business History stream",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/business-talent-permanent-132/significant-business-history-stream#About",
    "content": "Business Talent (Permanent) visa (subclass 132)\nSignificant Business History stream\nThis visa is for experienced business owners, to operate a new or existing business in Australia.\n\n\n\n\n\n\n\n\nWith this visa, you can\nstay in Australia permanently\nwork and study in Australia\nenrol in Australia's public health care scheme, Medicare\nsponsor certain relatives to come to Australia\ntravel to and from Australia for 5 years\nif eligible apply for Australian citizenship\nNewly arrived residents may have to wait before they can access certain Australian Government payments and benefits. \nHow long you can stay\nThis is a permanent visa. It lets you stay in Australia indefinitely.\nYou become a permanent resident on the day we grant the visa.\nFor citizenship purposes, your permanent residency starts on the day:\nwe grant the visa if you are in Australia, or\nyou enter Australia on this visa if you are outside Australia\nInclude family\nYou can include members of the family unit in your application when you apply and at any time before we decide on your application.\nFamily members who apply for the visa must meet our health and character requirements.\nFamily members who are not coming to Australia might also have to meet our health and character requirements.\nCost\nThe visa costs AUD7,855.00 for the main applicant.\nThere is also a charge for each family member who applies for the visa with you.\nadditional applicant over 18 years old: AUD3,930.00\nadditional applicant under 18 years old: AUD1,960.00\nYou might have to pay an extra charge for any applicant 18 years old or older who has less than functional English. This charge is called the second instalment. Pay it only when we ask you to. We will ask for the fee only if we are going to grant the visa. The second instalment charges are:\nmain applicant: AUD9,795\nfamily members: AUD4,890\nYou might also have to pay other costs for health checks, police certificates and biometrics.\nUse the Visa pricing estimator  to work out what your visa will cost. The estimator does not take into account the other costs.\nApply from\nYou can be in or outside Australia when you apply for the visa and when we decide on your application, but not in immigration clearance.\nProcessing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nWe assess applications on a case-by-case basis, and actual processing times can vary due to individual circumstances including:\nwhether you have lodged a complete application, including all necessary supporting documents\nhow quickly you respond to any requests for additional information\nhow long it takes to perform required checks on the supporting information provided\nhow long it takes to receive additional information from external agencies, particularly in relation to health, character, and national security requirements\nhow many places are available in the migration program\nWe can't process your application if you do not pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\nYour obligations\nYou and your family members must obey all Australian laws.\nYou must fulfil your business obligations.\nTravel\nFrom the date we grant this visa, you can travel to and from Australia for up to 5 years.\nAfter that period, you will need a Resident Return visa (RRV) visa to re-enter Australia as a permanent resident.\nIf you leave Australia after the expiry date of your travel facility, without being granted another permanent visa with a valid travel facility, for example a Resident Return visa (RRV), you will not be able to return to Australia until you have been granted another visa.\nTo see when your travel condition ends, use VEVO.\nVisa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}