{
    "visaID": "visa4.11.2",
    "visaType": "visa4.11",
    "visaName": "New Zealand stream",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/skilled-independent-189/new-zealand",
    "content": "Skilled Independent visa (subclass 189)\nNew Zealand stream\nThis visa lets eligible New Zealand citizens who have demonstrated commitment and contribution to Australia, live and work in Australia permanently.\n\n\n\nWith this visa you can\nstay in Australia indefinitely\nwork and study in Australia\nenrol in Australia's public health care scheme, Medicare\nsponsor your relatives to come to Australia\ntravel to and from Australia for 5 years\nif eligible, become an Australian citizen\nNewly arrived residents may have to wait before they can access certain Australian Government payments and benefits. \nHow long you can stay\nThis is a permanent visa. It lets you stay in Australia indefinitely. The visa has a travel component that expires 5 years after the date we grant you the visa.\nFor information about citizenship see Become an Australian citizen (by conferral) Permanent residents or eligible New Zealand citizens.\nInclude family\nYou can include members of the family unit in your application. You can:\ninclude them when you lodge your visa application\nadd them after you lodge your application but before we decide on your visa. \nFamily members who apply for the visa must meet our health and character requirements.\nIf your partner or dependent children are not included in this application, tell us the reason why (for example, they already hold Australian citizenship or are a permanent resident).\nCost\nThe visa costs AUD4,240 for the main applicant.\nThere is also a charge for each family member who applies for the visa with you.\nThe visa application charges are paid in two instalments. The first instalment is 20% of the total visa application charge payable at time of lodgement. The second instalment is the remaining 80% of the visa application charge. The second charge must be paid before we grant you your visa.\nTo work out what your visa will cost use the Visa Pricing Estimator. \nYou might also have to pay other costs for health checks, police certificates and biometrics.\nApply from\nYou must be in Australia and holding a Subclass 444 visa when you apply for the visa.\nAny family members included in your application can be in or outside of Australia when you apply. However, if they are in Australia, they must hold a substantive visa or bridging A, B or C visa.\nProcessing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nWe assess applications on a case-by-case basis, and actual processing times can vary due to individual circumstances including:\nwhether you have lodged a complete application, including all necessary supporting documents\nhow quickly you respond to any requests for additional information\nhow long it takes to perform required checks on the supporting information provided\nhow long it takes to receive additional information from external agencies, particularly in relation to health, character, and national security requirements\nfor permanent migration visa applications, how many places are available in the migration program\nYour obligations\nYou and your family members must obey all Australian laws.\nTravel\nYou can travel in and out of Australia as many times as you want for 5 years from the date we grant the visa. After 5 years you will need a Resident Return (RRV) visa (subclass 155 or 157) to re-enter Australia as a permanent resident.\nVisa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}