{
    "visaID": "visa4.22.4",
    "visaType": "visa4.22",
    "visaName": "Subsequent entrant",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-skill-shortage-482/subsequent-entrant",
    "content": "Temporary Skill Shortage visa (subclass 482)\nSubsequent entrant\nThis visa is for family members of subclass 457 and TSS visa holders who are applying separately for their TSS visa and wish to join the primary subclass 457 or TSS visa holder in Australia.\n\n\n\n\n\n\n\n\nAbout this visa\nUsually you apply for your visa at the same time and combined with the visa application of the main applicant. In some instances, this may not be possible. This may occur where the composition of the family changes after:\nthe main applicant has already submitted their application for a TSS visa and it is still pending a decision\na subclass 457 or TSS visa has already been granted to the primary TSS visa applicant\nWhen this occurs and you want to join the primary applicant on their visa, you must apply separately by submitting a visa application in you own right. This is known as subsequent entrant.\nWhen you submit your visa application for a subsequent entrant, you are required to attach a written letter from the sponsor extending their sponsorship obligation to include you as a family member in the nomination.\nThis requirement is intended to ensure the primary applicant’s employer is aware of all the family members to whom their sponsorship obligations will extend.\nDiscuss this matter with the sponsor in the first instance before lodging your subsequent entrant visa application.\nWith this visa, you can\nlive and work in Australia\nstudy (you won’t receive government assistance)\ntravel to and from Australia as many times as you want while the visa is valid\nif eligible, apply for permanent residence\nYour visa will come with conditions attached to it. To see your conditions refer to your visa grant letter or use VEVO.\nCost\nPrimary visa holder holds a TSS visa\nThe visa application charge for a subsequent entrant application will be calculated based on the stream in which the primary visa was granted (that is, a short-term, medium-term or labour agreement stream).\nPrimary visa holder holds a subclass 457 visa\nIn cases where a primary visa holder holds a subclass 457 visa, and not a TSS visa, the visa application charge for subsequent entrant applications is calculated as per regulation 1240(2)(a)(ii) – \"for any other applicant\", with the charges being as follows:\nbase application charge - AUD3,115.00\nadditional applicant charge for applicants 18 and over - AUD3,115.00\nadditional applicant charge for applicants under 18 - AUD780.00\nNote: if the sole applicant on a subsequent entrant application is under 18 years of age, they will be charged the base application charge and not the additional applicant charge.\nYou might also have to pay other costs for health checks, police certificates and biometrics.\nTo work out what your visa will cost use the Visa pricing estimator The estimator does not take into account the other costs.\nHow long you can stay\nThis is a temporary visa. You can stay in Australia for as long as your visa is valid.\nStay longer\nIf your visa is expiring and the primary visa holder wants stay in Australia to work for their existing employer:\nthe employer will need to submit a new nomination\nyou must apply for a new visa\nThe primary applicant’s employer could also sponsor the main applicant for permanent residence through the:\nEmployer Nomination Scheme (subclass 186)\nRegional Sponsored Migration Scheme (subclass 187)\nThe primary applicant might be eligible for other skilled work visas. Use our visa finder to find out options for work. \nInclude other family members\nFamily members who can apply for this visa are those who are members of the family unit of the primary subclass 457 or TSS visa holder.\nFamily members who apply for the visa must meet our health and character requirements.\nPrimary visa must have been submitted or decided\nFamily members cannot be added to a primary visa applicant’s TSS visa application after it has been submitted.\nA subsequent entrant application should be submitted if the primary visa applicant has already submitted their visa application and you were not included as a family member in their application and:\ntheir subclass 457 or TSS visa application is undecided as it is still being processed, or \nthe primary visa applicant has been granted a subclass 457 or a TSS visa and you wish to join them in Australia \nApply from\nYou can be in or outside Australia when you apply for the visa and when we decide on your application but not in immigration clearance.\nIf you are applying in Australia, you must hold:\na substantive visa, or\na Bridging visa A, Bridging visa B or Bridging visa C\nYou might be able to apply even if your substantive visa has a no further stay condition attached to it.\nProcessing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nWe assess applications on a case-by-case basis, and actual processing times can vary due to individual circumstances including:\nwhether you have lodged a complete application, including all necessary supporting documents\nhow quickly you respond to any requests for additional information\nhow long it takes to perform required checks on the supporting information provided\nhow long it takes to receive additional information from external agencies, particularly in relation to health, character, and national security requirements\nWe might ask for more information. We are not obligated to request further information or documents and can make a decision on the information provided. It is your responsibility to ensure all relevant supporting/evidentiary documentation is attached to your application\nYour obligations\nYou and your family must meet all visa conditions and follow Australian laws.\nSee which visa conditions might be attached to this visa.\nTravel\nYou can travel outside Australia and return as many times as you want while the visa is valid.\nThe time you spend outside Australia does not extend the visa.\nVisa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nIf we grant you a visa, we will send you a grant notification letter containing the visa grant number. You can use this number to check your visa details and conditions through VEVO.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}