{
    "visaID": "visa4.2.7",
    "visaType": "visa4.2",
    "visaName": "Entrepreneur stream",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/business-innovation-and-investment-188/entrepreneur-stream",
    "content": "Business Innovation and Investment (Provisional) visa (subclass 188)\nEntrepreneur stream\nFor startup and early stage entrepreneurs who have been endorsed to develop their concepts and been nominated by a State or Territory government agency.\n\n\n\n\n\n\n\n\nWith this visa, you can\ncarry out entrepreneurial activity in Australia\nstay in Australia for up to 5 years\nbring eligible members of your family with you\napply for a permanent Business Innovation and Investment (Permanent) visa (subclass 888) Entrepreneur stream if certain requirements are met\nHow long you can stay\nThis is a provisional visa. You can stay in Australia for up to 5 years. \nThe visa is granted with multiple entries. You can leave and re-enter Australia as many times as you want while the visa is valid.\nThe visa is valid from the date it is granted.\nStay longer\nThis is a provisional visa. You must apply for a new visa if you want to stay longer. Explore your visa options.\nOnce you have this visa, you can apply for permanent residence through the Business Innovation and Investment (Permanent) visa (subclass 888) Entrepreneur stream if certain requirements are met.\nInclude family\nYou can add your dependent child or children to your application at any time before we decide on your application. They will need to meet our health and character (if applicable) requirements.\nThe spouse or de facto partner of the main applicant who did not make a combined application at the initial lodgement of the subclass 188 visa, can make a subsequent entrant application. A subclass 188 visa can only be granted to a subsequent entrant after the main applicant’s subclass 188 visa is granted.\nComplete the online 'Application for a Business Innovation and Investment (Subsequent Entrant) Visa' application form in ImmiAccount. An application charge is applicable.\nIn order for the primary applicant to be granted the visa, family members who are not coming to Australia must meet our character requirements and might have to meet our health requirements.\nCost\nThis visa costs AUD6,570.00 for the primary applicant.\nThere is also a charge for each family member who applies for the visa with you.\nadditional applicant over 18 years old: AUD3,285.00\nadditional applicant under 18 years old: AUD1,640.00\nAny applicant 18 years old or older who has less than functional English must pay an extra charge. This charge is the second instalment. Pay it only when we ask you to. We will refund the charge if we do not grant you the visa.\nThe second instalment charges are:\nprimary applicant: AUD9,795\nfamily members: AUD4,890\nTo work out what your visa will cost use the Visa pricing estimator. The estimator does not take into account the second instalment or other costs. You might also have to pay other costs for health checks, police certificates and biometrics.\nApply from\nYou can be in or outside Australia when you apply for the visa and when we decide on your application, but not in immigration clearance.\nProcessing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nThere are no standard processing times available for this stream.\nBut your application might take longer to process if:\nyou do not fill it in correctly\nyou do not include all the documents we need or we need more information from you\nit takes us time to verify your information\nYour obligations\nYou and your family members who are part of your application must comply with all visa conditions and Australian laws.\nLearn more about conditions for this visa.\nYou must meet certain obligations related to your entrepreneurial activities. You must also obey Australian workplace laws.\nMeet your entrepreneur obligations\nIf you were invited to apply on or after 1 July 2021\nYou must be undertaking or propose to undertake a complying entrepreneur activity in Australia and have a genuine intention to undertake, and continue to undertake, the complying entrepreneur activity. You must also have been nominated by a State or Territory government agency to develop your concepts.\nIf you were invited to apply before 1 July 2021\nYou must be undertaking or propose to undertake a complying entrepreneur activity in Australia and have a genuine intention to undertake, and continue to undertake, the complying entrepreneur activity. You must also have a legally enforceable funding agreement with a third party of at least AUD200,000. There are other eligibility requirements for this visa.\nThe funding party must pay your entrepreneurial entity at least 10% of the total funding. They must do this within 12 months of the day you start the entrepreneurial activity in Australia. You must use this funding in accordance with your funding agreement.\nFollow Australian workplace laws\nAll workers in Australia (including visa holders) have rights and protections at work. Pay rates and workplace conditions are set by Australian law.\nIf you operate a business in Australia, you must comply with workplace laws. The  Pay and Conditions Tool (PACT)  can help you with:\npay rates\nshift calculations\nleave arrangements and notice\nredundancy entitlements\nAdequate health insurance\nWe recommend you take out health insurance to cover any unforeseen medical treatment you might need in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability.\nSee what we consider adequate health insurance.\nLearn more about health insurance for overseas visitors.\nReciprocal healthcare agreements\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements.\nTravel\nYou can travel outside Australia and return as many times as you want while the visa is valid.\nThe time you spend outside Australia does not extend the visa.\nVisa label\nAustralian visas are digital.\nWe do not put a visa label in your passport. Instead, we link your digital visa record to your passport.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}