{
    "visaID": "visa4.20.5",
    "visaType": "visa4.20",
    "visaName": "Pacific Australia Labour Mobility stream",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-work-403/pacific-australia-labour-mobility-stream",
    "content": "Temporary Work (International Relations) visa (subclass 403)\nPacific Australia Labour Mobility stream\nThis visa stream lets you come to Australia to participate in the Pacific Australia Labour Mobility (PALM) scheme.\nFor Applicants\nFor Sponsors\n\n\n\n\n\n\n\n\nWith this visa, you can\nwork in Australia for a temporary activities sponsor, that is approved by the Department of Employment and Workplace Relations (DEWR) as a Pacific Australia Labour Mobility (PALM) scheme employer\nwork under the PALM scheme for up to:\n9 months if you are employed under a short-term work contract\n4 years if you are employed under a long-term work contract\ntravel to and from Australia as many times as you need while holding a work contract under the PALM scheme and a valid visa.\nHow long you can stay\nThis is a temporary visa.\nThe visa starts:\non the day you first enter Australia, if you are outside Australia when we grant the visa or\non the date we grant the visa, if you are in Australia when we grant the visa.\nYour visa grant letter will tell you how long you can stay and any conditions of your stay.\nThe visa will be valid until a specified date. This may be up to 4 years. You must return home when your work contract ends, regardless of the length of your visa.\nThe visa has multiple entry.\nYou can travel outside Australia and return as many times as you need. You must be holding a work contract under the PALM scheme and your visa must be valid.\nShort-term PALM scheme workers\nYou cannot spend more than 9 months in Australia if you have a short-term work contract under the PALM scheme.\nWhile we may grant your visa for 9 months, you must return home when your work contract ends. This is regardless of the length of the visa. You then must spend at least 3 months outside Australia before you can return under another PALM scheme work contract.\nShort-term workers who are granted a multi-year visa (up to 4 years) will have a condition on their visa which means they must return home after each short-term work contract.\nLong-term PALM scheme workers\nYou cannot spend more than 4 years in Australia if you have a long-term work contract.\nYour visa stay period will generally be the same as the length of your work contract with your PALM scheme employer.\nAfter each long-term work contract you must spend at least 6 months outside Australia before you can return under another PALM scheme work contract.\nFor more information see the PALM scheme.\nStay longer\nUnder the PALM scheme Approved Employer Guidelines, you may be able to stay longer to keep working in the PALM scheme if you are a:\nshort-term PALM scheme worker and have been offered a long-term PALM scheme work contract or\nlong-term PALM scheme worker and have been offered a contract extension and your total time in Australia will be less than 4 years.\nYou can’t stay longer by extending your visa. You must apply for a new PALM stream visa.\nTo be eligible to apply for a PALM stream visa in Australia you must:\nhold a Subclass 403 visa in the PALM, Seasonal Worker Program (SWP), or Pacific Labour Scheme (PLS) streams or\nhave held a Subclass 403 visa in the PALM, SWP, or PLS streams in the last 28 days and\nbe sponsored by a temporary activities sponsor, that is approved by DEWR as a PALM scheme employer\nhave a PALM scheme recruitment approval letter from your sponsor that includes the PALM endorsement number\napply online.\nEmployment transfers\nAfter the grant of a PALM stream visa, you may only change employment if DEWR approves the change.\nInclude family\nThe PALM scheme family accompaniment pilot allows selected PALM scheme workers on long-term contracts of between one and four years to bring their family to Australia.\nLearn more about the pilot, see Family accompaniment pilot - for workers | PALM scheme\nFamilies selected to participate in the pilot must apply as subsequent entrants to the PALM scheme worker’s Temporary Work (International Relations) (subclass 403) PALM stream visa.\nFamily members applying for this visa must:\ngive your family accompaniment selection notification letter\ngive evidence that you are a member of the family unit of the primary subclass 403 PALM stream or PLS stream visa holder\nmeet our health and character requirements\npay the visa application charge\nSelected PALM scheme workers will get more information with their family accompaniment selection notification letter about how their family can apply for the Temporary Work (International Relations) (subclass 403) visa.\nShort-term PALM scheme workers cannot bring their family to Australia on this visa.\nCost\nThe visa costs:\nAUD345.00 for the main applicant\nAUD335.00 for each additional applicant over 18 years\nAUD80.00 for each additional applicant under 18 years.\nYou may also have to pay other costs for health checks and police certificates.\nTo work out what your visa will cost use the Visa Pricing Estimator. The estimator does not take into account the other costs.\nApply from\nYou must be outside Australia when you apply and when we decide your visa application, unless you:\nhold a Subclass 403 visa in the PALM, SWP, or PLS streams or\nlast held a Subclass 403 visa in the PALM, SWP, or PLS streams in the last 28 days.\nIf you are in Australia, you can only apply for this visa if you are a:\nSWP or PALM stream visa holder with a short-term work contract and you have been offered a long-term work contract under the PALM scheme\nPLS or PALM stream visa holder with a long-term work contractand you have been offered a contract extension, and your total time in Australia will be less than 4 years.\nProcessing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application can take longer to process if:\nyou do not fill it in correctly\nyou do not include all the documents we need\nwe need more information from you\nit takes us time to verify your information.\nWe cannot process your application if you do not pay the visa application charge. We will notify you if this is the case.\nYour obligations\nWhile you hold a PALM stream visa you must:\ncontinue to be employed by your temporary activities sponsor or another employer supported under an arrangement with DEWR\nonly work in the position and industry you were granted the visa for\nnot work for yourself, or change employers, unless supported under an arrangement with DEWR\ncomply with all visa conditions and Australian laws.\nLearn more about conditions for this visa.\nTo view your visa details download the My VEVO app.\nTravel\nYou can travel outside Australia and return as many times as you need. You must be holding a work contract under the PALM scheme and your visa must be valid.\nThe time you spend outside Australia does not extend the visa.\nVisa label\nWe will electronically link your visa to your passport. You will not get a label in your passport.\nIf you get a new passport while you hold this visa you must tell the Department using your ImmiAccount.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}