{
    "visaID": "visa4.7.1",
    "visaType": "visa4.7",
    "visaName": "Regional provisional stream",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/skilled-regional-191/regional-provisional",
    "content": "Permanent Residence (Skilled Regional) visa (subclass 191)\nRegional Provisional stream\nThis visa allows people who have lived and worked in designated regional areas of Australia on an eligible visa, live and work in Australia permanently. Applicants must have complied with the conditions of their eligible visa.\n\n\n\n\n\n\n\n\nWith this visa you can\nstay in Australia permanently\nwork and study in Australia\nenrol in Australia's public health care scheme, Medicare\nsponsor your relatives to come to Australia\ntravel to and from Australia for 5 years\nif eligible, apply for Australian citizenship.\nNewly arrived residents may have to wait before they can access certain Australian Government payments and benefits.\nHow long you can stay\nThis is a permanent visa. It lets you stay in Australia indefinitely.\nThe visa has a travel component that expires 5 years after the date of visa grant. If you wish to travel after this date, you must apply for a Resident Return visa.\nFor citizenship purposes, your permanent residence starts on the day we grant the visa if you are in Australia.\nInclude family\nYou can include members of the family unit in your application. You can:\ninclude them when you lodge your visa application.\nadd them after you lodge your application but before we decide on your visa. \nGenerally, family members included in your application do not need an eligible visa. Family members must hold an eligible visa if:\nthey no longer meet the standard definition of member of the family unit, and\nyou include them in your application.\nTheir eligible visa must have been granted on the basis that they were a member of your family unit. This provision applies, for example, if you want to include a child in your application who has turned 23 years of age since getting an eligible visa.\nFamily members included in your application must meet health and character requirements. Family members not coming to Australia may also need to meet health and character requirements.\nNewborn children\nIf you have a child who was born in Australia since you were granted your current visa you must tell us about your child before you lodge this application. Find out what to do if your child is born after we granted your current visa. If we have not linked your child’s current visa to their passport you will be unable to lodge their application online.\nCost\nThe visa costs AUD490.00 for the main applicant.\nThe visa costs AUD245.00 for each additional applicant who is at least 18.\nThe visa costs AUD125.00 for each additional applicant who is less than 18.\nYou might also have to pay other costs for health checks, police certificates and biometrics.\nApply from\nYou can be in or outside Australia when you apply for the visa and when we decide on your application. You cannot be in immigration clearance.\nProcessing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nWe assess applications on a case-by-case basis. Actual processing times can vary due to individual circumstances including:\nwhether you have submitted a complete application, including all supporting documents\nthe time taken for you to respond to requests for more information\nthe time it takes to perform required checks on supporting information provided\nthe time it takes to receive more information from external agencies, particularly about health, character, and national security requirements\nhow many places are available in the migration program\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}