{
    "visaID": "visa4.22.2",
    "visaType": "visa4.22",
    "visaName": "Medium-term stream",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-skill-shortage-482/medium-term-stream",
    "content": "Temporary Skill Shortage visa (subclass 482)\nMedium-term stream\nThis visa enables employers to address labour shortages by bringing in skilled workers where employers can't source an appropriately skilled Australian worker.\nFor Applicants\nFor Sponsors\n\n\n\n\n\n\n\n\n\nWith this visa, you can\nwork in Australia for your sponsor for up to 4 years, or up to 5 years if you are a Hong Kong passport holder\nstudy (you won't receive government assistance)\ntravel to and from Australia as many times as you want while the visa is valid\nif eligible, apply for permanent residence\nFor this stream of the visa, you must be sponsored to work in an occupation listed on the Medium and Long-term Strategic Skills List (MLTSSL). \nYour visa will come with conditions attached to it. To see your conditions conditions refer to your visa grant letter or use VEVO.\nCurrent temporary skilled visa holders from Hong Kong will be eligible for an extension of 5 years (from 9 July 2020) in addition to the time they’ve already been in Australia.\nCurrent and future temporary skilled visa holders from Hong Kong will also have a pathway to permanent residency after 5 years.\nCost\nThe visa costs AUD3,115.00 for the main applicant and for each dependant 18 years and over.\nIt costs AUD780.00 for each dependant under 18 years old.\nYou will have to pay other costs for English language tests, health checks, police certificates and biometrics.\nTo work out what your visa will cost use the Visa pricing estimator.\nThe estimator does not take into account the other costs.\nHow long you can stay\nThis is a temporary visa. You can stay in Australia for the period of time your employer nominates you for up to a maximum period of 4 year or up to 5 years if you are a Hong Kong passport holder.\nFor further information on recent changes regarding Hong Kong or British National (Overseas) (BN(O)) passport holders read Visa options for Hong Kong - update.\nStay longer\nIf your visa is expiring and you want to stay in Australia to work for your existing employer:\nyour employer will need to submit a new nomination\nyou must apply for a new visa.\nYour employer may be able to sponsor you for permanent residence through the:\nEmployer Nomination Scheme (subclass 186)\nRegional Sponsored Migration Scheme (subclass 187)\nYou might be eligible for other skilled work visas. Use our visa finder to find out options for work. \nCurrent temporary skilled visa holders from Hong Kong will be eligible for an extension of 5 years (from 9 July 2020) in addition to the time they’ve already been in Australia.\nCurrent and future temporary skilled visa holders from Hong Kong will also have a pathway to permanent residency after 5 years.\nInclude family\nYou can include other family members (called 'secondary applicants') in your visa application. The family members you can add will depend on whether you currently hold a subclass 457 or TSS visa.\nYou have not previously held a subclass 457 or TSS visa\nIf you have not previously held a subclass 457 or TSS visa, the secondary applicants you can include in your visa application are those who are members of the family unit.\nYou currently hold a subclass 457 or TSS visa\nIf you currently hold a subclass 457 or TSS visa and you are applying for a subsequent subclass TSS visa, the secondary applicants who can be included in your application are:\none of the members of the family unit, or\na person who currently holds a subclass 457 or TSS visa that was granted on the basis that they were a member of the family unit at the time, and is currently one of the following:\nyour spouse or de facto partner\nyour or your spouse's or de facto partner's child or step-child who is not engaged, married or in a de facto relationship, and is:\nyounger than 23\naged 23 or older and fully or mostly reliant on you or your partner because they cannot work, due to a partial or total physical or mental disability\nis a dependent child of your or your spouse or de facto partner's child or step-child \nTo be granted the visa, secondary applicants must be included in the main applicant's nomination, or provide written evidence that the sponsor who nominated the main applicant agrees that the secondary applicant can be a secondary sponsored person.\nSecondary applicants who apply for the visa must meet our health and character requirements.\nYou can’t add family members to your visa application after it has been submitted. \nIf you have submitted your visa application and it is being processed by the Department, family members that were not included in your visa application can lodge a subsequent entrant application.\nAlternatively, if we have granted you a visa, family members may apply to join you in Australia later as a subsequent entrant.\nApply from\nYou can be in or outside Australia when you apply for the visa and when we decide on your application, but not in immigration clearance.\nIf you are applying in Australia, you must hold:\na substantive visa, or\na Bridging visa A, Bridging visa B or Bridging visa C\nProcessing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nWe assess applications on a case-by-case basis, and actual processing times can vary due to individual circumstances including:\nwhether you have lodged a complete application, including all necessary supporting documents\nhow quickly you respond to any requests for additional information\nhow long it takes to perform required checks on the supporting information provided\nhow long it takes to receive additional information from external agencies, particularly in relation to health, character, and national security requirements\nWe might ask for more information. We are not obligated to request further information or documents and can make a decision on the information provided. It is your responsibility to ensure all relevant supporting/evidentiary documentation is attached to your application.\nYour obligations\nYou and your family must meet all visa conditions and obey Australian laws.\nYou must begin your employment within 90 days of:\nentering Australia, if you are outside Australia when grant the visa\nthe visa grant date, if you are in Australia when we grant the visa\nSee which visa conditions might be attached to this visa.\nTravel\nYou can travel outside Australia and return as many times as you want while the visa is valid.\nThe time you spend outside Australia does not extend the visa.\nVisa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nIf we grant you a visa, we will send you a grant notification letter containing the visa grant number. You can use this number to check your visa details and conditions through VEVO.\nWork\nConditions attached to this visa include that you work in Australia only in the occupation you were nominated for and only for your nominating business or in some circumstances, an associated entity of the business.\nYour family can also live, study and work in Australia.\nLearn more about conditions on this visa.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}