{
    "visaID": "visa3.18.2",
    "visaType": "visa3.18",
    "visaName": "Partner (Migrant) visa",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/partner-offshore/migrant-100",
    "content": "Subclass 100\nPartner (Migrant) visa\nThe visa lets the de facto partner or spouse of an Australian citizen, Australian permanent resident or eligible New Zealand citizen, live in Australia permanently. It is usually granted to people who hold a temporary Partner visa (subclass 309).\nFor Applicants\nFor Sponsors\n\n\n\n\n\n\n\n\nWith this visa you can\nlive, work and study in Australia indefinitely\naccess Australia's public healthcare scheme, Medicare\nsponsor eligible family members to come to Australia\ntravel to and from Australia for 5 years\nif eligible, attend free English language classes provided by the Adult Migrant English Program\nif eligible, apply for Australian citizenship.\nHow long you can stay\nThis is a permanent visa.\nYou become a permanent resident on the day we grant the visa.\nYour obligations\nYou and your family members must meet all visa conditions and obey Australian laws.\nFor more information see Check visa details and conditions.\nTravel on this visa\nIf you are outside Australia at the time of visa grant, you must enter Australia before the first entry arrival date (initial arrival date) specified in your grant letter.\nYou can travel to and from Australia as many times as you want for 5 years from the date we grant this visa. This is as long as the travel facility on this visa remains valid.\nIf you want to travel after the initial 5-year travel facility you will need to apply for and be granted a Resident Return (RRV). This will allow you to travel to Australia as a permanent resident.\nTo see when your travel facility ends, use VEVO.\nInclude family members\nYou can include members of the family unit in your application when you apply for the temporary Partner visa (subclass 309). Members of the family unit who apply with you must also be outside Australia\nTo include a dependent child in your permanent Partner visa (subclass 100) application after we have granted you a subclass 309 visa, your child must first apply for a Dependent child visa (subclass 445).  We can grant your child the subclass 100 visa if they are members of the family unit and meet all other criteria.\nYou cannot add any family members after we grant the permanent Partner visa (subclass 100).\nDependent Child visa (subclass 445) holders\nIf you have a dependent child who does not hold a subclass 309 visa, you can add them to your permanent Partner visa (subclass 100) application before we make a decision on your permanent visa application.\nYour child must hold a Dependent Child visa (subclass 445) and can be in or outside Australia.\nOnce your child holds a subclass 445 visa, complete and attach to your ImmiAccount, Form 1002 - Application by a subclass 445 dependent child for a permanent partner visa (279KB PDF). \nAfter you have attached the form to ImmiAccount, let us know by using the Partner Processing Enquiry Form.\nNewborn children\nIf you have a baby after you have applied for this visa, you will need to let us know. For more information, see You had a baby.\nCost\nYou paid for this visa when you applied for the combined temporary and permanent partner visas.\nYou might have to pay other costs for health or police checks.\nProcessing times\nThe processing time for a permanent Partner visa starts from the date of eligibility. This is 2 years after you applied for the combined temporary and permanent partner visas.\nWe update processing times regularly. We assess all applications on a case by case basis. Complex cases may take longer to process. You should use published processing times as a guideline only.\nYour application can take longer to process if:\nyou do not fill it in correctly\nyou don't include all required documents\nwe need more information from you\nit takes time to verify your information.\nVisa label\nYou will not get a label in your passport. We will digitally link your visa to your passport and create a digital visa record for you.\nFrequently asked questions\nYou can find the answers to common questions about this visa at Partner Program Frequently Asked Questions (FAQs). \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}