{
    "visaID": "visa4.1.1",
    "visaType": "visa4.1",
    "visaName": "Business Innovation stream",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/business-innovation-and-investment-888/business-innovation-stream",
    "content": "Business Innovation and Investment (Permanent) visa (subclass 888)\nBusiness Innovation stream\nThis visa lets holders of a Business Innovation and Investment (Provisional) visa (subclass 188) in the Business Innovation stream or the Business Innovation Extension stream, or holders of a subclass 444 (Special Category) visa, or certain holders of a subclass 457 (Business (Long Stay) visa, stay permanently in Australia.\n\n\n\n\n\n\n\n\nWith this visa, you can\nstay in Australia permanently\nwork and study in Australia\nenrol in Australia's public health care scheme, Medicare\nsponsor your relatives to come to Australia\ntravel to and from Australia for 5 years\nif eligible apply for Australian citizenship\nNewly arrived residents may have to wait before they can access certain Australian Government payments and benefits. \nHow long you can stay\nThis is a permanent visa. It lets you stay in Australia permanently.\nFor citizenship purposes, your permanent residency starts on the day:\nwe grant the visa if you are in Australia\nyou enter Australia on this visa if you are outside Australia when we grant this visa\nInclude family\nYou can include members of the family unit in your application when you apply. You can also add members of the family unit to your application at any time before we decide on your application.\nFamily members who apply for the visa must meet our health and character requirements.\nFamily members who are not coming to Australia might also have to meet our health and character requirements.\nCost\nThe visa costs AUD3,400.00 for the main applicant.\nThere is also a charge for each family member who applies for the visa with you.\nAny applicant 18 years old or older who has less than functional English must also pay an extra charge. This charge is the second instalment charge. Pay it only when we ask you to. We will refund the charge if we do not grant you the visa.\nThe second instalment charge is AUD4,890.\nYou only need to pay it for family members who did not pay the second instalment charge for their Business Innovation and Investment (Provisional) visa.\nYou might also have to pay other costs for health checks, police certificates and biometrics.\nTo work out what your visa will cost use the Visa Pricing Estimator. The estimator does not take into account the second instalment or other costs.\nApply from\nYou can be in or outside Australia when you apply for the visa and when we decide on your application but not in immigration clearance.\nProcessing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application may take longer to process if:\nyou do not complete the application form correctly \nyou do not include all the documents we need or we need more information from you\nit takes us time to verify your information\nWe cannot process your application if you do not pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\nYour obligations\nYou and your family members must obey all Australian laws.\nIf you are outside Australia when we grant the visa:\nyou and your family members must enter Australia by a certain date (we will tell you when this is)\nany family members included in your application might not be able to marry or enter into a de facto relationship before they enter Australia (we will tell you if this is the case)\nTravel\nTravel to and from Australia for 5 years\nYou can travel to and from Australia as many times as you want for 5 years from the date we grant this visa. This is as long as the travel facility on this visa remains valid.\nIf you want to travel after the initial 5-year travel facility:\nyou will need to apply for and be granted a Resident Return (RRV) so that you can re-enter Australia as a permanent resident\nyou might also want to consider Australian citizenship. If you become an Australian citizen, you don't require a visa to enter Australia. You will need to apply for an Australian passport and use it to leave and re-enter Australia. See more about eligibility requirements and current processing times for Australian citizenship\nIf you leave Australia after the expiry date of your travel facility, without being granted another permanent visa with a valid travel facility, for example a Resident Return (RRV), you will not be able to return to Australia as a permanent resident.\nTo see when your travel facility ends, use VEVO.\nVisa label\nAustralian visas are digital.\nWe do not put a visa label in your passport. Instead, we link your digital visa record to your passport.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}