{
    "visaID": "visa6.2",
    "visaType": "visa6",
    "visaName": "Bridging visa B – BVB – (subclass 020)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-b-020",
    "content": "Subclass 020\nBridging visa B (BVB)\nYou can leave and return to Australia during a specified travel period while your application for a substantive visa is being processed.\n\n\n\n\n\n\n\n\nAbout this visa\nThis is a temporary visa.  The BVB travel facility may be granted with single or multiple travel and will be valid for use until a specified date. If the travel facility has ended or does not have sufficient validity remaining to cover your proposed journey, then you will need to apply for and be granted a new BVB prior to leaving Australia. Check if you already hold a Bridging visa B (BVB) with VEVO.\nA separate application for a BVB may be necessary where you have applied for judicial review.  It is not possible to apply to change conditions on your BVB.  If you want to change visa conditions, then you will need to consider applying for a Bridging visa A (BVA).\nYou can’t use a bridging visa while you wait for a citizenship application to be decided.\nIn effect\nA BVB comes into effect when:\nit is granted (if your substantive visa has ceased since applying for the BVB or where the BVB is more beneficial than your current bridging visa)\nyour current substantive visa ceases.\nVisa holders must adhere to the conditions imposed on their visa. Where you are granted a BVB, you will be notified about the conditions that apply.\nIf you hold a substantive visa when your BVB is granted, you must continue to comply with the conditions of the substantive visa.  When your substantive visa ceases, the conditions of your BVB will apply.\nWorking in Australia\nYou might be allowed to work if the substantive visa you had or the visa you applied for lets you work. Your grant letter will tell you about the conditions that apply to your BVB.\n\nIf the visa you had, and the visa you applied for have work restrictions you will not be able to work with a BVB. See if you have work restrictions in VEVO.\nIf you are the holder of a BVB that does not permit work, and you are seeking to change conditions, you will need to consider applying for a BVA. As part of this process you will need to demonstrate that you are in financial hardship.\nRemaining lawful during judicial review\nIf a merits review tribunal upholds our decision to refuse your substantive visa application and you apply for judicial review, you will need to apply for a bridging visa to maintain your lawful status during the judicial review proceedings. If you have applied for judicial review you can only apply for a bridging visa by webform.\nWith this visa you can\nStay lawfully in Australia until your substantive visa application is finally determined, or if granted in association with judicial proceedings, until those proceedings are complete.\nLeave and return to Australia within the defined travel period while your application for a substantive visa is being processed.\nHow long you can stay\nOne of the following outcomes will determine when your BVB ceases:\nyour substantive visa application is refused\nyour merits or judicial review is decided\nyou withdraw your application for the substantive visa, merits review or judicial review\na merits review tribunal tells you that it has no jurisdiction to consider your application for review\nwe grant you the substantive visa that the BVB is associated with\nwe cancel your BVB or the substantive visa that you held when you were granted a BVB.\nOnce you have been notified of an outcome you can see exactly how long you can stay in Australia in VEVO.\n  BVB granted on or after 19 November 2016\nYour BVB will end 35 calendar days after:\nour refusal decision or a decision by the Administrative Appeals Tribunal (AAT) in relation to your associated substantive visa application\na determination that your substantive visa application or an application for review by the AAT is invalid\nyou withdraw your substantive visa application or application for review by the AAT.\nYou BVB will end 28 calendar days after:\na judicial review body upholds the decision to refuse your substantive visa application\nyou withdraw a related judicial review application.\nBVB granted before 19 November 2016\nYour BVB will end 28 days after the date that one of the following happens:\nwe notify you that your substantive visa application is not valid\nwe notify you that your substantive visa application has been refused\nyou withdraw your substantive visa application\na merits review tribunal notifies you that it has upheld our decision to refuse your substantive visa application\na merit review tribunal notifies you that it has no jurisdiction to consider your application for review\nyou withdraw your application for merits or judicial review from a merits review tribunal or a judicial review body \na judicial review body upholds the decision to refuse your substantive visa application.\nStay longer\nYou can’t stay in Australia longer by extending this visa. You must apply for a new visa if you wish to stay longer. Explore your visa options.\nInclude family\nIf you and your family have applied together for a substantive visa in Australia, you can include them in your BVB application providing they are members of the family unit. This means you and your family have to complete only one application form and pay one visa application charge. But, each member of the family will have to meet the requirements for a BVB in their own right.\nOnly those family members who have substantial reasons for needing to travel outside Australia should be included in your BVB application. If some of your family members do not need to travel outside Australia, they can stay in Australia on their current bridging visas.\nCost\nAUD185.00\nApply from\nYou and anyone included in your BVB application must be in Australia to make a valid application and to be granted the visa.\nYour obligations\nYou and anyone included in your application must:\ncomply with all Australian laws\ncomply with the conditions of the current visa \ncomply with the conditions of the your BVB when it comes in to effect\nYou can find your visa conditions in your grant letter or VEVO.\nWorking\nWe will let you know which conditions apply to your BVB if we grant the visa.\nTravel\nWhen we grant your BVB, we will tell you when the specified travel period will end.\nIf you hold a BVB where the specified travel period has ended but you need to travel outside Australia again, you will have to apply for another BVB and be granted this visa before leaving Australia.\nIf you are outside Australia when the specified travel period on your BVB ends, the visa will cease. You can't return to Australia with a ceased BVB.\nVisa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}