{
    "visaID": "visa1.5.3",
    "visaType": "visa1.5",
    "visaName": "Third Work and Holiday visa",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/work-holiday-462/third-work-and-holiday-462",
    "content": "Work and Holiday visa (subclass 462)\nThird Work and Holiday visa\nThis visa lets people 18 to 30 years old (inclusive) who currently hold, or who have held, a second Work and Holiday (subclass 462) visa, have a third working holiday in Australia.\n\n\n\n\n\n\n\n\nWith this visa, you can\ndo short- term work in Australia to help pay for your holiday\nstudy for up to 4 months\ntravel to and from Australia as many times as you want\nWork\nYou can do any kind of work on this visa.\nUsually, you can only work for the same employer for 6 months. \nNote: The 6-month work limitation resets when you are granted a third subclass 462 visa. This means you can work another 6 months for someone you worked for on your first and/or second visa.\nIf the main purpose of your stay is to work, consider a work visa.\nStudy\nYou can study for up to 4 months (17 weeks).\nIf the main purpose of your stay is to study, consider a Student visa.\nHow long you can stay\nThis depends on your circumstances when we grant the visa. Your grant notification will tell you how long you can stay in Australia and you can also use VEVO to check your visa details and conditions.\nYou are in Australia on your second subclass 462 visa or a bridging visa\nThe bridging visa must be the one you were granted after your second subclass 462 visa expired.\nYou can stay in Australia for up to 12 months from the date your second Work and Holiday (subclass 462) visa expired or would have expired.\nYou are in Australia on a different visa\nYou can stay in Australia for 12 months from the date we grant the visa.\nTime spent outside Australia after the visa starts does not extend the visa.\nYou are outside Australia\nYou can stay in Australia for 12 months from the date you enter Australia.\nYou must enter Australia within 12 months of the date we grant the visa. We will not extend or defer this timeframe.\nYour Work and Holiday visa starts on the date you enter or transit through Australia even if you hold any other temporary visa including:\na Special Purpose visa (SPV)\nan Electronic Travel Authority (ETA)\na Crew Travel Authority (CTA)\na Maritime Crew visa (MCV)\nIt is important that you only apply for a Work and Holiday visa once you are ready to enter Australia on that visa. Once we grant your Work and Holiday visa and you travel to Australia and are immigration cleared at the border, the 12-month visa period of stay will automatically start upon entry, regardless of the purpose of your visit.\nStay longer\nYou can't:\nstay in Australia longer by extending this visa\nget a fourth Work and Holiday (subclass 462) visa if you have already held three Work and Holiday (subclass 462) visas in Australia\nTo stay longer in Australia, explore your visa options.\nStay longer on a visitor visa\nGenerally, we don't grant a Visitor visa after you have been in Australia on a Work and Holiday (subclass 462) visa.\nIf you want to apply for a Visitor visa to stay longer in Australia and the Visitor visa would result in you staying longer than 12 consecutive months in Australia, you must show there are exceptional circumstances.\nFor this visa, exceptional circumstances might be that a close family member in Australia has died or is seriously ill and you are required to stay in Australia to provide assistance or support.\nInclude family\nYou can't include family members in your application.\nYou can't be accompanied by dependent children while you are in Australia on this visa.\nCost\nAUD650.00\nYou might also have to pay for health checks, police certificates and biometrics. \nApply from\nYou can be in or outside Australia when you apply for the visa. You must select your current location at the time you apply. \nIf you apply when you are in Australia, you must be in Australia when we grant your visa.\nIf you apply when you are outside Australia, you must be outside Australia when we grant your visa.\nYou must correctly select your current location when applying. If you select the wrong location you will need to amend the information. This may delay processing of your application. \nProcessing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application might take longer to process if:\nyou do not fill it in correctly\nyou do not include all the documents we need or we need more information from you\nit takes us time to verify your information\nYour obligations\nYou must meet all visa conditions and obey Australian laws.\nSee the conditions for this visa. \nTax\nWhen you work in Australia on this visa you must pay taxes.\nSuperannuation\nAustralia has compulsory superannuation - a retirement savings scheme. Your employer must pay superannuation into your superannuation fund if you earn over a certain amount.\nWhen you leave Australia, you can access your superannuation. \nLearn more about compulsory superannuation.\nHealth insurance\nWe strongly recommend you take out health insurance to cover any unforeseen medical treatment you might need in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability.\nSee what we consider adequate health insurance.\nLearn more about health insurance for overseas visitors.\nReciprocal healthcare agreements\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements.\nTravel\nYou can travel outside Australia and return as many times as you want while the visa is in effect.\nThe time you spend outside Australia after your visa commences does not extend the visa period of stay in Australia.\nVisa record\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}