{
    "visaID": "visa4.18.7",
    "visaType": "visa4.18",
    "visaName": "Entertainment Activities",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-activity-408/entertainment-activities",
    "content": "Temporary Activity visa (subclass 408)\nEntertainment Activities stream\nThis temporary visa lets you come to Australia to work in the entertainment industry on film, television or live productions as a performer, production or support staff. You can include family members in your visa application.\nFor Applicants\nFor Sponsors\n\n\n\n\n\n\n\n\nWith this visa, you can\nwork in the entertainment industry in Australia as a performer, production or support staff\ntravel to and from Australia as many times as you want while your visa is valid\ninclude members of the family unit in your application\nEntertainment activity categories\nYou apply for this visa under one of these categories:\nperforming in a film or television production subsidised by government\nperforming in a film or television production not subsidised by government\nperforming other than in film or television\nworking in a production role other than as a performer\nworking as support staff for an entertainer or group of entertainers\nworking as a performer or support staff for a non-profit engagement\nworking on a documentary or commercial for an overseas market\nExamples of eligible work\nEligible work could include:\nacting in a television or film production\nmaking a celebrity cameo appearance\na contestant or worker on a reality tv program who receives a salary\nstand-up comedian\ninternational musician or support staff\nlive theatre performer or support staff\nsinger \nclassical musician\ninternet video performer\ncultural performer\ndocumentary presenter\ncelebrity appearance in a commercial\nnon-performing production or technical crew\njournalist or other media personnel covering an event\nchoreographer giving a dance workshop that includes a ticketed public closing performance\nOther visas that might suit you\nConsider a different Temporary Activity stream or a different visa if you are planning to work as:\nan entertainer attending a promotional event only, without performing – see the Invited Participant stream of this visa\nan artist creating visual art or holding exhibitions of their work - see the Invited Participant stream of this visa\nan author at a writer's festival presenting work in front of an audience - see the Invited Participant stream of this visa\na dance choreographer conducting a dance workshop that includes a closing non-ticketed performance - see the Invited Participant stream of this visa\na journalist or other media personnel covering events for a non-Australian audience – see Temporary Work (Short Stay Specialist) visa (subclass 400)\na competitor in a non-sporting competition for dance, music or online gaming - see the Invited Participant stream of this visa\na contestant of a reality show not receiving a salary - see the Invited Participant stream of this visa or Visitor visas\nHow long you can stay\nThis is a temporary visa. We grant the length of stay based on the activity we approve you to do on the visa.\nThe maximum stay for this visa stream is 2 years.\nThe visa is granted with multiple entry. You can leave and re-enter Australia as many times as you want while the visa is valid.\nThe visa starts on the date we grant it.\nIf we grant the visa, we will let you know how long you can stay.\nStay longer\nYou can't stay in Australia longer by extending this visa. Explore your visa options.\nInclude family\nYou can:\ninclude members of the family unit in your application when you apply, or\nadd family members to your application at any time before we make a decision\nFamily members who apply for the visa with you must also meet our health and character requirements.\nIf you apply for this visa from outside Australia, family members who are not coming to Australia might also have to meet our health requirements.\nSubsequent entrants\nIf we grant you the visa, your family members might be able to apply to join you in Australia later as a subsequent entrant.\nCost\nThe visa costs AUD415.00 for the main applicant.\nThere is also a charge for each family member who applies for the visa with you.\nYou might also have to pay other costs for health checks, police certificates and biometrics.\nTo work out what your visa will cost use the Visa Pricing Estimator. The estimator does not take into account the other costs.\nVisa Application Charge concession\nIf your sponsor/supporter organisation is included by the Minister in a legislative instrument, you may be eligible for a Visa Application Charge concession. The organisation must be:\nany registered charity with the Australian Charities and Not-for-profits Commission\nany foreign government agency, embassy or consulate\nany state, territory or Commonwealth government agency; or\nanother organisation that has been listed by name in the instrument as they are managing an event that receives significant government funding.\nYou will not receive a concession if you are also contracted to other organisations that are not listed in the instrument for other events during your stay.\nCheck with your sponsor if you might be eligible for a visa application charge concession. If you are, ask them for evidence of this to submit with your application.\nWe might not process your application if you ask for a concession but don't provide evidence you are eligible for one. \nApply from\nYou can be in or outside Australia when you apply for the visa and when we decide on your application.\nProcessing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application might take longer to process if:\nyou don't fill it in correctly\nyou don't include all the documents we need, or we need more information from you\nit takes us time to verify your information\nWe can't process your application if you don't pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\nYour obligations\nYou and your family must meet all visa conditions and follow Australian laws.\nLearn more about conditions for this visa.\nYour activities must not harm the work, training or job conditions of Australian citizens or permanent residents.\nYou must not change the times and places of engagements specified in the application. If you need to do so, you must ask the Secretary of the Department of Home Affairs for permission before you make any changes.\nYou must ask permission from the Temporary Specialist Entry Centre to make any changes to your itinerary. This includes new events, changes in times or new venues. Send an email to entertainment.visas@homeaffairs.gov.au or let us know in ImmiAccount.\nIf your sponsor, supporting organisation or individual stops your activity or employment, you must do one of the following:\nif eligible, apply for a new visa; or\nleave Australia within 28 days of stopping work for your sponsor/supporter, or earlier if your visa is expiring\n \nTravel\nYou can travel outside Australia and return as many times as you want while the visa is valid.\nThe time you spend outside Australia does not extend the visa.\nVisa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nIf we grant you a visa, we will send you a grant notification letter containing the visa grant number. You can use this number to access your digital visa record.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}