{
    "visaID": "visa5.3",
    "visaType": "visa5",
    "visaName": "Refugee visas (subclass 200, 201, 203 and 204)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/refugee-200",
    "content": "Subclass 200, 201, 203 and 204\nRefugee category visas\nWith these visas you can move to Australia if you are subject to persecution in your home country. These visas allow you and your family to live, work and study indefinitely in Australia.\n\n\n\n\n\n\n\n\nWith this visa, you can\nstay in Australia permanently\nwork and study in Australia\nenrol in Australia's public healthcare scheme, Medicare\npropose family members for permanent residence\ntravel to and from Australia for 5 years\nif eligible become an Australian citizen\nattend free English language classes through the Adult Migrant English Program\nHow long you can stay\nThis is a permanent visa. It lets you stay in Australia permanently.\nYou become a permanent resident when you enter Australia.\nFor citizenship purposes, your permanent residence starts on the day you enter Australia on this visa.\nInclude family\nYou can also add certain family members to your application at any time before we decide on your application.\nFor this visa, your family are:\nyour partner\nyour dependent children\nyour partner’s dependent children\nother relative who is a dependant.\nIf your child is not dependent on you, they must apply for their own visa.\nFamily members who apply for the visa must meet our health and character requirements.\nFamily members who are not coming to Australia might also have to meet our health requirement.\nIt is important to declare all of your family members, even if they will not be applying with you.\nIf you do not declare a family member in your application, you may not be able to propose them for a Humanitarian visa after you arrive in Australia.\nCost\nThere is no visa application charge for this visa\nApply from\nYou must be outside Australia when you apply. You must also be outside Australia when your visa is granted.\nProcessing times\nWe generally acknowledge Humanitarian visa applications in writing. Processing times can vary according to the applicant’s:\nparticular circumstances\nlocation\nability to travel\nability to provide documents\naccess to Australian government officials.\nThe decision process takes many months, even years. The number of applications we receive for resettlement each year is far greater than available visas.\nYour application can take longer to process if:\nyour application form is not filled in correctly\nyou do not include all the documents we need, or we need more information from you\nit takes us time to verify your information.\nProcessing times also vary according to individual and family circumstances, such as health conditions that might require testing or treatment.\nWe will contact you at key stages of processing and when a decision is made.\nPriority processing\nThe Australian Government has established policy to guide decisions on which applications ought generally to be given priority. This policy includes those who are outside their home country and are one of following:\nassessed as a refugee by the United Nations High Commissioner for Refugees (UNHCR) and referred to Australia for resettlement\nproposed by immediate family member (for example, spouse, child under 18) who holds a Class XB visa (subclass 200, 201, 202, 203 or 204) or close family member (for example, sibling, adult child, parent) who holds a refugee category visa (subclass 200, 201, 203 or 204)\nmembers of an identified minority groups (such as women and girls, ethnic minorities, LGBTQI+) and are referred by UNHCR or proposed by a family member in Australia.\nBecause of the limited number of resettlement places available each year and the high demand for them, we accept applicants in the most compelling circumstances only.\nAssisted Passage\nThe Assisted Passage program supports the delivery of Australia’s Offshore Humanitarian Program and provides health screening, travel and medical related services to refugee category visa applicants and visa holders.\nThe Assisted Passage services are currently transitioning from the International Organization for Migration (IOM) to Toll Transport Pty Ltd (Toll). Transition timeframes will vary between countries. During the transition you may be contacted by either Toll or IOM, depending on your location. Toll or IOM will help you attend health appointments and, if you are granted a visa, assist you to travel to Australia.\nYour obligations\nYou must enter Australia before the first entry arrival date (initial arrival date) specified in your grant letter.\nIf you signed a health undertaking, you must comply with it.\nYou and your family members must obey all Australian laws.\nTravel\nYour travel to Australia will be arranged by the Department at no cost to you. If the first entry arrival date (initial arrival date) specified in your grant letter has passed, we may issue you with a travel facilitation letter. We may first ask you to undergo a fresh medical examination. \nYou can travel to and from Australia for 5 years from the date we grant the visa. After 5 years you will need a Resident Return (RRV) visa (subclass 155) or (subclass 157) to re-enter Australia as a permanent resident.\nAdditional information\nThe number of applications we receive for resettlement each year is far greater than available visas. \nThere are four visa subclasses included in the Refugee category of the Humanitarian Program. They are:\nRefugee (subclass 200)\nIn-country Special Humanitarian (subclass 201)\nEmergency Rescue (subclass 203)\nWoman at Risk (subclass 204).\nWe will consider your application against each subclass.\nYou can find more information at Refugee visas (offshore) (homeaffairs.gov.au).\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}