{
    "visaID": "visa6.8",
    "visaType": "visa6",
    "visaName": "Medical Treatment visa (subclass 602)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/medical-treatment-602",
    "content": "Subclass 602\nMedical Treatment visa\nThis temporary visa is for people to travel to or remain longer in Australia for medical treatment or to support someone needing medical treatment who holds this visa. It is also for people who are donating an organ.\n\n\n\n\n\n\n\n\nWith this visa you can\nhave medical treatment or consultation\ndonate an organ\nsupport someone who holds this visa, if they are an organ donor or having medical treatment\nbe granted single entry or multiple entries to Australia depending on your situation\nstudy for up to 3 months (or longer if you meet the exemption criteria).\nYou can't work except under limited circumstances.\nHow long you can stay\nThis is a temporary visa.\nWe determine the length of your stay on a case-by-case basis.\nThings we consider when determining your stay period include your treatment plan.\nStay longer\nYou can't extend this visa to stay longer in Australia. If you need more time for your medical treatment or for another reason, you will need to apply for another visa.\nExplore your visa options to stay longer in Australia.\nSupport persons\nIf you are applying to have medical treatment or donate an organ, a support person may apply for this visa.\nA support person can be a member of your family or another person such as a friend.\nEach support person must make a separate application unless they are included in your passport.\nWe can process your applications together.\nWe must grant your visa first before granting a support person a visa.\nCost\nThe visa is free if you apply outside Australia.\nThe visa costs AUD370.00 if you apply in Australia. If you represent a foreign government, the visa is free.\nYou might have to pay for health checks, police certificates and biometrics. \nTo work out what your visa will cost, use the Visa Pricing Estimator. The estimator does not take into account the other costs.\nApply from\nYou can be in or outside Australia when you apply for the visa.\nIf we grant you the visa, at the time of grant you must be:\nin Australia, if you applied in Australia;\noutside Australia, if you applied outside Australia.\nProcessing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application can take longer to process if:\nyou do not fill it in correctly\nyou do not include all the documents we need\nwe need more information from you\nit takes us time to verify your information.\nWe can't process your application if you do not pay the correct visa application charge. We will notify you if this is the case.\nYour obligations\nYou must meet all visa conditions and obey Australian laws.\nLearn more about conditions for this visa.\nHealth insurance\nWe recommend you obtain health insurance to cover any unforeseen medical treatment you might need in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability.\nSee what we consider adequate health insurance.\nLearn more about health insurance for overseas visitors.\nReciprocal healthcare agreements\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements.\nTravel\nThe visa is granted with single or multiple entry.\nYou must arrive in Australia on or before the expiry date on your visa.\nMultiple entry:\nYou can leave and re-enter Australia as many times as you want.\nSingle entry:\nif we grant you this visa while you are outside Australia, you can enter Australia once. If you leave Australia, you can’t return.\nif we grant you this visa while you are in Australia, you can leave and return once. If you leave again, you can’t return.\nIf you need to travel to Australia again, you must apply for another visa.\nCheck if you have multiple or single entry in Visa Entitlement Verification Online (VEVO) or your visa grant letter.\nVisa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}