{
    "visaID": "visa2.2",
    "visaType": "visa2",
    "visaName": "Student Guardian visa (subclass 590)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/student-590",
    "content": "Subclass 590\nStudent Guardian visa\nVisit to support a child who holds a student visa.\n\n\n\n\n\n\n\n\nWith this visa you can\ncome to Australia to provide care and support for a student visa holder who is under 18 years of age (or over 18 in exceptional circumstances)\ncare for more than one student\nstudy an English Language Intensive Course for Overseas Students (ELICOS) for less than 20 hours per week, or any other study or training for no more than 3 months\nYou cannot work.\nHow long you can stay\nYou can stay in Australia until a date specified on your visa grant letter. In deciding this date, we usually consider the length of the student visa holder’s stay or when that student turns 18.\nStay longer\nYou can stay in Australia by applying for a further Student Guardian visa.\nInclude family\nIf any member of your family unit has not turned 6 years old, you cannot be granted the visa unless:\nthere are compelling and compassionate reasons or\ngranting the visa would significantly benefit the relationship between the Australian Government and the government of another country\nThe child must meet the same health requirements as you and have health insurance for the duration of their stay in Australia.\nYou can't include children under 6 years old after you have submitted your application.\nChildren 6 years old or older can come with you but they must apply for their own student visa.\nCost\nThe visa costs from AUD1,600.00 for the main applicant.\nThere is also a charge for each family member who applies for the visa with you.\nEligible Pacific Island and Timor-Leste citizens can apply for a partial refund of the cost, see Getting a refund.\nYou might also have to pay other costs for health checks, police certificates and biometrics.\nTo work out what your visa will cost use the Visa Pricing Estimator. The estimator does not take into account the other costs.\nApply from\nYou can be in or outside Australia when you apply for the visa and when we decide on your application. If you are in Australia you must hold an eligible substantive visa. For more information see 'Have this visa if applying while in Australia' under Eligibility.\nProcessing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application may take longer to process if:\nyou do not fill it in correctly\nyou do not include all the documents we need or we need more information from you\nit takes us time to verify your information\nWe cannot process your application if you do not pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\nYour obligations\nYou and your family members must meet all visa conditions and obey Australian laws.\nSee which conditions will and might be attached to this visa.\nTravel\nYou can travel outside Australia and return as many times as you want while the visa is valid. But you can't leave Australia without the student visa holder unless you have made alternative welfare arrangements.\nThe time you spend outside Australia does not extend the visa.\nFinancial support\nYou will need to be able to financially support yourself while in Australia. You will need to be able to financially support accompanying family members\nVisa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}