{
    "visaID": "visa6.11",
    "visaType": "visa6",
    "visaName": "Special Purpose visa",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-purpose-visa",
    "content": "Special Purpose visa\nThis is a temporary visa that lets you enter and stay in Australia while you hold your prescribed status. You do not apply for this visa. It is granted automatically to people who have a 'prescribed status'.\n\n\n\n\n\n\n\n\nWith this visa you can, depending on your prescribed status\nenter and stay in Australia temporarily, while you hold the prescribed status\nundertake your regular work while in Australia as part of your military duties\narrive as an airline crew member, or join a flight as a member of crew. See Crew Travel Authority for the work conditions\nHow long you can stay\nYou can stay in Australia on a temporary basis for as long as you have a 'prescribed status'. Your visa will cease if:\nyour prescribed status ends, or\nwe cease your visa\nStay longer\nYour visa will cease if your 'prescribed status' ends. If you want to stay longer in Australia you must apply for a different visa.\nExplore your visa options.\nInclude family\nIn some limited circumstances, your partner or dependent relative may be eligible for a Special Purpose visa. Find out about eligibility. \nCost\nThere is no application charge for this visa.\nYour obligations\nThe Special Purpose visa is only valid as long as you have a 'prescribed status'. If your prescribed status ends, the visa will cease.\nYou must obey all Australian laws.\nYou must comply with all legal obligations attached to your prescribed status.\nHealth insurance\nWe recommend you take out health insurance to cover any unforeseen medical treatment you might need in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability.\nSee what we consider adequate health insurance.\nLearn more about health insurance for overseas visitors.\nReciprocal healthcare agreements\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements.\nTravel\nYou can enter and depart Australia as many times as you want as long as you hold the prescribed status.\nVisa label\nAs this temporary visa is based on your prescribed status it may not be linked to your passport. You will not get a label in your passport.\n\n\n\n\n\n\n\n\n"
}