{
    "visaID": "visa6.10",
    "visaType": "visa6",
    "visaName": "Special Category visa (subclass 444)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-category-visa-subclass-444",
    "content": "Subclass 444\nSpecial Category visa (SCV)\nThis temporary visa allows you to visit, study, stay, and work in Australia, if you are a New Zealand citizen and meet the eligibility criteria. It is usually applied for each time you enter Australia.\n\n\n\n\n\n\n\n\nWith this visa you can\nenter and stay in Australia for as long as you are and continue to remain a New Zealand citizen\nvisit, work and study in Australia\napply for a permanent visa if eligible\nHow long you can stay\nThe visa starts on the date we grant you the visa.\nThe visa ceases on the date you leave Australia, unless it ceases because of other reasons. These may include if we grant you a permanent visa, you become an Australian citizen, or we cancel the visa. When you leave Australia your visa will cease. You must apply for a new SCV if you want to enter Australia again.\nInclude family\nEach family member needs to make their own SCV application. They can do this by showing a valid New Zealand passport and completed incoming passenger card to an officer. They can also answer the health and character questions on SmartGate. \nIf family members are not New Zealand citizens, they need to apply for another visa.\nCost\nThere is no application charge for this visa.\nApply\nYou usually apply for this visa when you enter Australia.\nIn some cases, you may be able to apply for this visa after you have entered Australia. This might be the case if you:\nbecame a New Zealand citizen and passport holder after you entered Australia\nentered on a passport that is not a New Zealand passport\nentered on another temporary visa, or\nhad a New Zealand citizen baby born in Australia.\nIn these cases you can apply by completing our online form. If we grant you the SCV after you have entered Australia the grant date will be the date of the decision. We can't backdate it to your original entry date.\nIf you had a child born in Australia to an SCV holding parent on or before 30 June 2022, ensure that the child has been registered as a New Zealand Citizen and has received a New Zealand citizenship certificate and/or a New Zealand passport. For further information see New Zealand citizenship.\nOnce you receive the New Zealand citizenship certificate and/or passport you can submit an onshore SCV application via the Onshore visa application form.\nIf you had a child born to an SCV holding parent on or after 1 July 2022 your child may have acquired Australian citizenship automatically by operation of law at the time of their birth. Children who meet these circumstances can apply for their proof of citizenship.\nFor further information see You had a baby.\nCheck if you already hold a visa\nBefore submitting an application check if you already hold a visa or get a copy of it by using VEVO. To access VEVO you will need a reference number.\nYour obligations\nYou must remain a New Zealand citizen while you hold this visa. If your citizenship status changes, and you are no longer a New Zealand citizen, your SCV will cease. To remain lawful you must apply for and we must grant you a different visa.\nYou must obey Australian laws while you remain in Australia.\nAll visa holders must continue to meet the character requirements. If you don't, we may cancel your visa.\nHealth insurance\nWe recommend you take out health insurance to cover any unforeseen medical treatment you might need in Australia. You may be liable for your own healthcare costs while you are in Australia. Insurance can help limit your financial liability.\nSee what we consider adequate health insurance.\nLearn more about health insurance for overseas visitors.\nLearn more about Medicare for New Zealand citizens.\nReciprocal healthcare agreements\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements.\nTravel\nYou can't travel outside Australia and return on this visa. If you leave Australia the visa will cease. If you return to Australia you must apply for a new SCV when you return.\nTravelling as a permanent visa holder\nWe may manually process your entry into Australia. If you hold a permanent visa (with a valid travel facility), you need to tell us that you do not want an SCV. If you do not tell us, we may grant you the SCV. This may later affect your eligibility for a Resident Return visa.\nMore information is in overseas travel as a permanent resident.\nEligible New Zealand citizen (or Protected SCV holder)\nSee Eligible New Zealand citizen (or Protected SCV holder) under Entitlements\nMore information is in overseas travel as a permanent resident.\nVisa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}