{
    "visaID": "visa3.11",
    "visaType": "visa3",
    "visaName": "Contributory Parent (Temporary) visa (subclass 173)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/contributory-parent-temporary-173",
    "content": "Subclass 173\nContributory Parent (Temporary) visa\nThis temporary visa lets a parent of a settled Australian citizen, Australian permanent resident or eligible New Zealand citizen stay temporarily in Australia.\nFor Applicants\nFor Sponsors\n\n\n\n\n\n\n\n\n\nWith this visa you can\nlive in Australia for up to 2 years\nwork and study in Australia (you will not receive government support)\nenrol in Australia's public health care scheme, Medicare\napply for a permanent Contributory Parent visa (subclass 143)\nApply for a Contributory Parent (subclass 143) visa\nYou can spread the cost of the permanent visa over a number of years by applying in 2 steps:\nfirst, apply for the temporary Contributory Parent (Temporary) (subclass 173) visa, then\napply for the permanent Contributory Parent (subclass 143) visa\nHow long you can stay\nThis is a temporary visa. You can stay in Australia for 2 years.\nThe visa period starts on the date you enter Australia after you are granted the visa.\nThe visa is granted with multiple entry. You can travel outside Australia and return as many times as you want within two years.\nStay longer\nYou can't stay in Australia longer by extending or reapplying for this visa. You can apply for a different visa.\nExplore your visa options.\nInclude family\nYou can include members of the family unit in your application when you apply.  \nYou will be required to include details of all your family members, whether they are migrating or not, when you fill out the application form.\nIf you have a partner, include their details in your application even if they are not applying for the visa with you.\nFamily members who apply for the visa must meet our health and character requirements. Family members who are not coming to Australia might also have to meet our health and character requirements.\nNewborn child\nFind out what to do if your child is born after you apply.\nCost\nThis visa costs AUD32,430. There is an additional charge for each family member who applies with you.\nYou pay for this visa in 2 parts called instalments.\nPay the first instalment when you apply. Pay the second instalment when we ask you to. See more about visa fees and charges.\nYou might also have to pay other costs for health checks, police certificates and biometrics. \nTo work out what your visa will cost use the Visa Pricing Estimator. The estimator does not take into account the other costs.\nApply from\nYou can be in or outside Australia when you apply for the visa.\nIf you apply in Australia, any family members who apply with you must also be in Australia, but not in immigration clearance, when you apply. If you apply outside Australia, any family members who apply with you must also be outside Australia when you apply.\nIf you apply for this visa in Australia while on a temporary visa with a no further stay condition, your application will be invalid, unless you apply for a waiver of this condition.\nProcessing times\nThe demand for these visas is greater than the number of places available each year. As a result, processing times for these applications can be lengthy.\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application might take longer to process if:\nyou do not fill it in correctly\nyou do not include all of the documents we need or we need more information from you and/or\nyour information takes a long time to verify.\nWe cannot process your application if you do not pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\nThe Reports on Migration Programs have further information on Migration Program outcomes against planning for each migration program year.\nApplications for this visa are subject to capping and queueing.\nLearn more about the Parent visa queue and processing priorities.\nAssessment\nWe assess applications for this visa in 2 stages:\nCheck eligibility and either add the application to the queue or refuse it.\nContinue assessing the application when a place becomes available and make a decision.\nDo not arrange to stay permanently in Australia until your visa is granted. We will let you know in writing if we grant you the visa.\nLearn more about the Parent visa queue and processing priorities.\nConsider another visa\nOther Parent visas available are:\nContributory Parent visa (subclass 143). This is a permanent visa and costs more\nContributory Parent (Temporary) visa (subclass 173), then a permanent Contributory Parent visa (subclass 143). This is a 2-step visa process and costs more than the subclass 103 visa. It also costs more than applying directly for the Contributory Parent visa (subclass 143), but the cost is spread across the 2 visas over a longer period and\nSponsored Parent (Temporary) visa (subclass 870). This is a temporary visa allowing parents to visit their children in Australia for up to three or five years at a time and a cumulative maximum 10 year period.\nYou can view all visa options on our Visa list page.\nAssessment\nWe assess applications for this visa in 2 stages.\nCheck eligibility and either add the application to the queue or refuse it.\nContinue assessing the application when a place becomes available and make a decision.\nDon't arrange to move to Australia until we grant the visa. We will let you know in writing if we grant you the visa.\nLearn more about the Parent visa queue and processing priorities.\nYour obligations\nYou must enter Australia before the date specified in your grant letter. The first entry date is generally set at 12 months from the date of visa grant.\nYou and your family members must meet all visa conditions and obey Australian laws.\nSee what conditions might be attached to this visa on our visa conditions page.\nVisa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}