{
    "visaID": "visa4.20.3",
    "visaType": "visa4.20",
    "visaName": "Domestic Worker (Diplomatic or Consular) stream",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-work-403/domestic-worker",
    "content": "Temporary Work (International Relations) visa (subclass 403)\nDomestic Worker (Diplomatic or Consular)\nThis visa stream lets a person aged 18 years or older do temporary full-time domestic work in Australia in the household of someone who holds a Diplomatic (Temporary) visa (subclass 995).\n\n\n\n\n\n\n\n\nWith this visa, you can\ndo full-time domestic work in the household of someone who holds a Diplomatic (Temporary) visa (subclass 995)\ntravel to and from Australia as many times as you want while your visa is valid.\nHow long can you stay\nThis is a temporary visa. If this is the first time you are applying for this visa, you can usually only stay for 12 months.\nYou can apply for a further Domestic Worker stream visa in Australia before your current visa expires. You must not be in immigration clearance. You can stay for the length of time in your support letter from the Department of Foreign Affairs and Trade (DFAT).\nThe visa is granted with multiple entry. You can leave and re-enter Australia as many times as you want while the visa is valid.\nThe visa starts:\non the day you first enter Australia, if you are outside Australia when we grant the visa or\non the date we grant the visa if you are in Australia\nYour visa grant letter will tell you how long you can stay.\nStay longer\nYou can't stay in Australia longer by extending this visa.\nYou can apply for a further Domestic Worker stream visa in Australia if you:\nhold a current Temporary Work (International Relations) visa (subclass 403) in the Domestic Worker Stream\nwish to keep working for your current employer in Australia who holds a Diplomatic visa (subclass 995), or another employer in Australia who holds a subclass 995 visa\nhave an employment contract that meets Australia's workplace relations laws\nhave the support of the Department of Foreign Affairs and Trade DFAT.\nIf you want to stay longer for other reasons, you must apply for a new visa that suits your circumstances. See Explore your visa options.\nInclude family\nYou can't include family members in your visa application.\nCost\nThe visa costs AUD365.00 for the applicant.\nYou may also have to pay other costs for police certificates, biometrics and health checks.\nTo work out how much this visa costs, use the Visa Pricing Estimator. The estimator does not take into account the other costs.\nApply from\nYou must be outside Australia when you apply and when we decide on your first application.\nIf you apply for a further Domestic Worker visa, you can be in or outside Australia, but not in immigration clearance.\nProcessing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application might take longer to process if:\nyou do not fill it in correctly\nyou do not include all the documents we need\nwe need more information from you\nit takes us time to verify your information.\nWe cannot process your application if you do not pay the correct visa application charge. We will tell you if this is the case and invalidate your application.\nYour obligations\nIf we grant you a visa you must comply with all visa conditions and Australian laws.\nLearn more about conditions for this visa.\nTravel\nYou can travel outside Australia and return as many times as you want while the visa is valid.\nThe time you spend outside Australia does not extend the visa.\nVisa Label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}