{
    "visaID": "visa5.4",
    "visaType": "visa5",
    "visaName": "Temporary Protection visa (subclass 785)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-protection-785",
    "content": "Subclass 785\nTemporary Protection visa\nThis visa is for people who arrived in Australia without a visa, and want to seek asylum. It lets you stay in Australia temporarily if you engage Australia's protection obligations and meet all other requirements for the grant of the visa.\n\n\n\n\n\n\n\n\nWith this visa, you can\nlive, work and study in Australia temporarily for 3 years\naccess government services such as jobactive, Medicare and Centrelink services\naccess short-term counselling for torture and trauma when required\nattend English language classes for free if you are eligible\ntravel overseas to countries other than your home country if you obtain our written approval to travel due to compassionate or compelling circumstances\nHow long you can stay\nThis is a temporary visa. It lets you stay in Australia for 3 years.\nStay longer\nIf we grant you this visa and you arrived in Australia on or after 14 February 2023, you may apply for a subsequent Temporary Protection visa (TPV) or a Safe Haven Enterprise visa (SHEV) before your current TPV expires. A subsequent TPV or SHEV will only be available to you if you still need Australia's protection and are not subject to any application bars.\nCertain TPV holders may be eligible to apply for a permanent Resolution of Status (RoS) visa (subclass 851).\nApply from\nYou, and any members of your same family unit included in your application, must be in Australia when you apply for this visa.\nIncluding family members\nMembers of the same family unit may apply together on the same application. They must:\nbe in Australia at the time of application\nbe eligible to apply for this visa\nMembers of the same family unit are:\nspouse or de facto partner of the family head\ndependent child or step-child of the family head\ndependent child or step-child of the family head’s partner\nother dependent relatives of the family head\nThe family head can be you. It can also be someone else in your family who has not applied for this visa.\nA dependent child is a child or step-child who is under 18 years old. A dependent child can be 18 years old or older if they are:\nincapacitated for work due to loss of their bodily or mental functions; or\nwholly or substantially reliant on their parent or step-parent for financial, psychological or physical support\nA child or step-child of any age is not considered to be a dependent child if they are currently married, engaged to be married or in a de facto relationship.\nChildren who are not dependent children must apply for their own visa.\nOther dependent relatives may include relatives such as the family head’s:\nparent\nbrother/sister\ngrandparent/grandchild\naunt/uncle\ncousin\nniece/nephew\nor step equivalent to any of the above\nA relative will be considered a dependent relative of the family head if they:\ndo not have a spouse or de facto partner\nusually lives with the family head; and\nare wholly or substantially reliant on the family head for financial, psychological or physical support\nMembers of the same family unit applying for this visa must meet our health, character and security requirements.\nNewborn child\nIf a child is born after you submit your application and before we make a decision on your application, the child will be taken to be included in that application. You must tell us as soon as possible by:\ncompleting Form 1022 Notification of change of circumstances (172KB PDF)\nproviding a clear colour copy of their original birth certificate\nattaching them in ImmiAccount or sending them by post to the address where you sent your application (you will need to send a certified copy of the child’s birth certificate if you send it by post)\nIf your child is born in Australia, they are automatically granted the same visas their parents hold at the time of the child’s birth.\nIf either parent is an Australian citizen or Australian permanent resident at the time of the child’s birth, the child may be an Australian citizen by birth. See the requirements for evidence of Australian citizenship.\nProcessing times\nWe aim to finalise TPV applications as quickly as possible. This is a very complex process and will take some time. You can assist us in finalising your application by responding to any requests from us in the specified timeframes.\nYour application can take longer to process if:\nyou do not fill in your application in correctly\nyou do not include all the documents we need\nwe need more information from you\nyou do not respond to requests for information quickly\nit takes us time to verify your information\nFast Track Assessment process\nWe will assess your TPV or SHEV application under the Fast Track Assessment process if you:\nare an unauthorised maritime arrival\nentered Australia on or after 13 August 2012 and before 1 January 2014\nhave never been taken to a regional processing country\nWe will also assess all subsequent TPV and SHEV applications made on or after 2 April 2019 under the Fast Track Assessment process.\nThe Minister may also decide to assess other applicants under the Fast Track Assessment process.\nThe Fast Track Process\nThe Fast Track Assessment process makes the visa application process for those seeking protection in Australia more efficient and effective.\nIf we have questions or concerns about your protection claims or other information from you, we will give you an opportunity to respond in writing or at interview. You will have limited time to give us new information or to respond to adverse information before we make a decision on your application. It is important that you respond and provide any new information within the timeframes we give you.\nReview rights\nUnder the Fast Track Assessment process, you will not have access to merits review by the Administrative Appeals Tribunal (AAT), unless we refuse your TPV on character grounds.\nIf you do not engage Australia's protection obligations, you could get a limited form of merits review by the Immigration Assessment Authority (IAA). The Department will automatically refer your case to the IAA, unless you are an excluded fast track review applicant. You will not be eligible to seek merits review of your refusal decision if you are an excluded fast track review applicant.\nThe IAA will only consider information that was available to us when we made the decision to refuse your application. This includes the information you gave to us in your TPV application. You may be able to give new information to the IAA only in exceptional circumstances.\nIf we refuse your TPV application, your refusal letter will inform you of any merits review rights you may have.\nYour refusal letter will tell you:\nif we have referred your case to the IAA directly, or\nhow long you have to apply for review at the AAT, or\nthat you are ineligible for merits review because you are an excluded fast track review applicant.\nExcluded fast track review applicants\nYou will be an excluded fast track review applicant if you:\nhave access to a safe third country where you can seek protection, or are a national of two or more countries\nentered Australia before and, while in Australia, applied for a protection visa and that application was either refused or withdrawn\nwere refused protection in another country, including with the United Nations High Commissioner for Refugees (UNHCR)\nmade 'manifestly unfounded' claims for protection (that is, your claims have no substance)\ngave us a bogus document as part of your protection visa application and do not have a reasonable explanation for doing so\nWe will tell you if you may fit one of these categories. We will give you an opportunity to comment and give us more information before we reach a decision that you are an excluded fast track review applicant.\nIf we decide that you are an excluded fast track review applicant and refuse your TPV application, you can't seek merits review of that decision. \nYour obligations\nYou and members of the same family unit included in your application must meet all visa conditions and obey Australian laws.\nSee which conditions apply to this visa\nTravel\nWaiting for your TPV application to be decided\nIf you leave Australia before we decide your TPV application, your bridging visa will expire and you will not be allowed to re-enter Australia, unless you hold another valid visa.\nIf you hold a Temporary Protection visa\nIf we have granted you a Temporary Protection visa, visa condition 8570 (Restricted travel) applies to your visa.\nVisa condition 8570 \nVisa condition 8570 (Restricted travel) restricts your right to travel. You can't travel to your home country under any circumstances and you can only enter any other country if you have compassionate or compelling reasons for travel and we have given you written approval to travel before you leave Australia.\nIf you travel overseas without the Department’s written approval, you will breach visa condition 8570, and we may cancel your visa (and the visas of members of your family unit) while you are offshore. \nFor more information, see Leaving Australia.\nVisa label\nWe will digitally link your visa to your travel document or ImmiCard. You will not get a label in your travel document.\nWithdraw your application\nIf you hold a bridging visa and withdraw your Temporary Protection visa application before we make a decision, you may be prevented from applying for a TPV or a Safe Haven Enterprise visa, and your bridging visa will expire 35 days after you withdraw your application.\nYou may withdraw your Temporary Protection visa application in writing at any time before we make our decision.\nYour request must include:\nyour full name\ndate of birth\ndetails of the application you are withdrawing\nAny additional applicants who are 18 years of age or older must sign the letter of withdrawal or send a separate email or letter withdrawing their application.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}