{
    "visaID": "visa4.18.5",
    "visaType": "visa4.18",
    "visaName": "Invited for other social and cultural activity (Invited Participant)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-activity-408/invited-for-other-social-and-cultural-activity",
    "content": "Temporary Activity visa (subclass 408)\nOther Social and Cultural Activity (Invited Participant) stream\nThis visa lets you come to Australia if you are invited to participate in a community-based event, including sporting events. You and your family who travel on the visa with you can stay here for up to 3 months.\nFor Applicants\nFor Sponsors\n\n\n\n\n\n\n\n\nWith this visa, you can\ntake part in a community-based event for a cultural or social activity such as a sporting, religious, artistic or academic event, or a conference\ntravel to and from Australia as many times as you want while your visa is valid\ninclude members of the family unit in your visa application\nExamples of cultural or social events\nYou might be:\nan individual sportsperson or member of a sports team, or team support staff such as a manager, medic, coach, referee or official. But you are not eligible for this stream if you have been contracted to play for or coach an Australian team\na minister conducting religious services or taking part in other religious activities as the guest of an Australian religious institution \nworking at a religious event \nan academic invited by a tertiary academic institution to lecture, hold workshops or take part in research \na public speaker or lecturer\nspeaking, presenting or lecturing at a trade fair, expo, exhibition, conference, workshop or seminar \nan entertainer attending specific promotional events, but not performing \nan artist making visual art or exhibiting your work \nan author, presenting your work to an audience at a writers festival \na choreographer conducting a dance workshop that includes an unticketed closing performance\nIf you are a competitor in a non-sporting competition such as a dance competition, music competition, online gaming competition or student competition, you might also consider a Visitor visa. \nOther visa options\nDepending on your reasons for travel, another stream of this visa or a different visa might be more suitable.\nThe Entertainment stream must be used if you are:\nan entertainer or performer working in the Australian Entertainment industry \nproduction crew for a competition being filmed in Australia \na journalist or other media personnel covering an event for an Australian audience \nThe Sports stream might be more suitable if you are:\na sportsperson contracted to play for or coach an Australian sporting team \na sports trainee taking part in a high-level structured sports training program of more than 3 months \nThe Religious Work stream might be better for you if you are doing full-time religious work. \n\nThe Research stream might be better for you if you are invited by a tertiary academic institution to take part in research for more than 3 months.\nThe Temporary Work (Short Stay Specialist) (subclass 400) visa might be more suitable if you are:\na journalist or other media covering an event, where coverage is not intended for an Australian audience\nsomeone else working at the event,such as a project manager or specialised construction worker\nA Visitor visa might be more suitable if you are:\nattending or taking part in a trade fair, expo, exhibition, religious or cultural event, conference, workshop or seminar, but you are not entertaining or being paid to contribute\nan amateur sportsperson training or taking part in a recreational match\nan unpaid volunteer supporting an amateur sportsperson or team\nHow long you can stay\nThis is a temporary visa. We grant the length of stay based on the activity we approve you to do on the visa.\nThe maximum stay for this visa stream is 3 months.\nThe visa is granted with multiple entry. You can leave and re-enter Australia as many times as you want while the visa is valid.\nIf you are overseas when the visa is granted, the visa stay period starts on the day that you enter Australia. If you are in Australia, the visa starts on the day that it is granted.\nYour visa grant letter will tell you how long you can stay.\nStay longer\nYou can't stay in Australia longer by extending this visa. Explore your visa options.\nInclude family\nYou can:\ninclude members of the family unit in your application when you apply, or\nadd family members to your application at any time before we make a decision\nFamily members who apply for the visa with you must also meet our health and character requirements. \nSubsequent entrants\nIf we grant you the visa, your family members might be able to apply to join you in Australia later as a subsequent entrant.\nCost\nThe visa costs AUD415.00 for the main applicant.\nThere is also a charge for each family member who applies for the visa with you.\nYou might also have to pay other costs for health checks, police certificates and biometrics.\nTo work out what your visa will cost use the Visa Pricing Estimator. The estimator does not take into account the other costs.\nApply from\nYou can be in or outside Australia when you apply for the visa and when we decide on your application.\nProcessing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application might take longer to process if:\nyou don't fill it in correctly\nyou don't include all the documents we need, or we need more information from you\nit takes us time to verify your information\nWe can't process your application if you don't pay the correct visa application charge. We will let you know if this is the case.\nYour obligations\nYou and your family must meet all visa conditions and follow Australian laws.\nLearn more about conditions for this visa.\nYour activities must not harm the work, training or job conditions of Australian citizens or permanent residents.\nIf your sponsor, supporting organisation or individual stops your activity or employment, you must either:\napply for a new visa if eligible, or\nleave Australia within 28 days of stopping work for your sponsor or supporter, or before your visa expires if that happens sooner\nTravel\nYou can travel outside Australia and return as many times as you want while the visa is valid.\nThe time you spend outside Australia does not extend the visa.\nVisa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nIf we grant you a visa, we will send you a grant notification letter containing the visa grant number. You can use this number to access your digital visa record.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}