{
    "visaID": "visa6.6",
    "visaType": "visa6",
    "visaName": "Former Resident visa (subclass 151)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/former-resident-151",
    "content": "(Subclass 151)\nFormer Resident visa\nThis permanent visa allows former permanent residents and certain people who served in the Australian Defence Force to live in Australia.\n\n\n\n\n\n\n\n\nWith this visa you can\nstay in Australia permanently\nwork and study in Australia\nenrol in Australia's public health care scheme, Medicare\nsponsor your relatives to come to Australia\ntravel to and from Australia for up to 5 years from date of grant as long as the travel facility remains valid\napply for Australian citizenship, if eligible\nHow long you can stay\nThis permanent visa allows you to stay in Australia indefinitely.\nYou become a permanent resident on the day you get the visa.\nFor citizenship purposes, your permanent residency starts on the day:\nwe grant the visa if you are in Australia\nyou enter Australia on this visa if you are outside Australia when we granted it\nInclude family\nYou can include members of the family unit in your application when you apply. You can also add members of the family unit to your application at any time before we decide on your application.\nFamily members who apply for the visa must meet our health and character requirements.\nIf you apply for this visa from outside Australia, family members who are not coming to Australia might also have to meet our health and character requirements.\nNewborn child\nFind out what to do if your child is born after you apply.\nCost\nThe visa costs AUD4,665.00 for the main applicant.\nThere is also a fee for each family member who applies for the visa with you.\nYou might also have to pay other costs for health checks, police certificates and biometrics.\nUse the Visa Pricing Estimator to work out what your visa will cost. The estimator does not take into account the other costs\nApply from\nYou can be in or outside Australia when you apply for the visa but not in immigration clearance.\nIf you apply in Australia, we can't grant you the visa if you are outside Australia when we make our decision.\nIf you apply outside Australia, we can't grant you the visa if you are in Australia when we make our decision.\nProcessing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application might take longer to process if:\nyou do not fill it in correctly\nyou do not include all the documents we need, or we need more information from you\nit takes us time to verify your information\nWe cannot process your application if you do not pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\nYour obligations\nYou and your family members must obey all Australian laws.\nTravel\nTravel to and from Australia for 5 years\nYou can travel to and from Australia as many times as you want for 5 years from the date we grant this visa. \nIf you want to travel after the initial 5-year travel validity expires:\nyou will need to apply for and be granted a Resident Return (RRV) so that you can re-enter Australia as a permanent resident\nyou might also want to consider Australian citizenship. If you become an Australian citizen, you don't require a visa to enter Australia. You will need to apply for an Australian passport and use it to leave and re-enter Australia. See more about eligibility requirements for Australian citizenship.\nNote:\nif you leave Australia after your travel validity expires or your travel validity expires when you are outside Australia, you will not be able to return to Australia as a permanent resident. If you then wish to return to Australia as a permanent resident, you must apply for and be granted an RRV before your arrival in Australia. \nthe maximum travel period that can be granted to someone who does not meet the RRV residence requirement is 12 months.  This period is set by law it can't be extended\nif you are already in Australia as a permanent resident, you do not need to apply for an RRV if you do not wish to travel\nFor more information on RRV, see: Resident Return visa (RRV). To see when your travel period ends, use VEVO.\nVisa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}