{
    "visaID": "visa4.19.1",
    "visaType": "visa4.19",
    "visaName": "Post-Vocational Education Work stream",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-graduate-485/post-vocational-education-work",
    "content": "Temporary Graduate visa (subclass 485)\nPost-Vocational Education Work stream\nThis visa is for international students who have recently graduated with qualifications that are relevant to specific occupations Australia needs. It lets you live, study and work in Australia temporarily.\n\n\n\n\n\n\n\n\nWith this visa, you can\nstay in Australia for 18 months\ntravel, work or study in Australia during your stay.\nYou must find your own employment if we grant this visa.\nHow long you can stay\nThis is a temporary visa. You can stay in Australia for 18 months.\nHong Kong and British National Overseas passport holders may stay up to 5 years.\nYou can travel in and out of Australia while your visa is valid.\nThe visa starts on the date we grant your visa.\nStay longer\nWe cannot extend this visa.\nYou may be eligible for other skilled work visas. Use our visa finder to find out options for work.\nCurrent and future Temporary Graduate visa holders from Hong Kong may have a pathway to permanent residency after 5 years.\nInclude family\nYou can include members of the family unit in your application when you apply, if they are in Australia.\nFamily members who apply for this visa must meet our health and character requirements.\nYou can add your children to the application until we decide on your application. You can't add any other member of the family unit to your application during that period.\nIf a family member wants to be added to your visa after we have granted it, they can apply as a subsequent entrant from in or outside Australia (including Replacement stream visa holders). See when you have this visa.\nCost\nThe visa costs AUD1,945.00 for the primary visa applicant.\nThere is also a charge for each family member who applies for the visa with you.\nSubsequent entrants must pay the full Visa Application Charge.\nYou might also have to pay other costs for health checks, police certificates and biometrics.\nTo work out what your visa will cost use the Visa Pricing Estimator. The estimator does not take into account the other costs.\nThe Temporary Graduate visa is exempt from the Subsequent Temporary Application Charge. \nApply from\nYou can be in Australia (but not in immigration clearance) when you apply for this visa. \nSubsequent entrants can be in or outside Australia when they apply.\nAll applicants can be in or outside Australia at the time of decision.\nProcessing times\nFor an indication of processing times for your visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application can take longer to process if:\nyou do not fill it in correctly\nwe need more information from you\nit takes us time to verify your information.\nWe can't process your application if you do not pay the correct Visa Application Charge. We will notify you if this is the case and if necessary return your application.\nYour obligations\nYou and your family must meet all visa conditions and follow Australian laws.\nLearn more about conditions for this visa.\nTravel\nYou can travel outside Australia and return as many times as you want while your visa is valid.\nThe time you spend outside Australia does not extend your visa.\nVisa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}