{
    "visaID": "visa3.9",
    "visaType": "visa3",
    "visaName": "Contributory Aged Parent (Temporary) visa (subclass 884)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/contributory-aged-parent-temporary-884",
    "content": "Subclass 884\nContributory Aged Parent (Temporary) visa\nThis temporary visa lets the aged parent of a settled Australian citizen, Australian permanent resident or eligible New Zealand citizen stay temporarily in Australia.\nFor Applicants\nFor Sponsors\n\n\n\n\n\n\n\n\n\nWith this visa you can\nlive in Australia for up to 2 years\nwork and study in Australia (you will not receive government support)\napply for a permanent Contributory Aged Parent visa (subclass 864)\nApply for a Contributory Aged Parent (subclass 864) visa\nYou can apply for the permanent subclass 864 visa as a two-step process by first applying for a Contributory Aged Parent (Temporary) subclass 884 visa. Applying for the subclass 884 visa and then the subclass 864 visa allows you to spread the cost of the visas over a number of years.\nHow long you can stay\nThis is a temporary visa. You can stay in Australia for 2 years.\nThe visa period starts on the date we grant the visa.\nStay longer\nYou can't stay in Australia longer by extending or reapplying for this visa. You can apply for a different visa.\nInclude family\nYou can include members of the family unit in your application when you apply. \nYou will be required to include details of all your family members, whether they are migrating or not, in the application form.\nIf you have a partner, include their details in your application even if they are not applying for the visa with you.\nFamily members who apply for the visa must meet our health and character requirements. Family members who are not coming to Australia might also have to meet our health and character requirements.\nNewborn child\nFind out what to do if your child is born after you apply. There is also an additional charge for each family member who applies with you.\nCost\nThis visa costs AUD34,025. There is an additional charge for each family member who applies with you.\nPay the first instalment when you apply. Pay the second instalment when we ask you to.\nThere is also a charge for any family member who applies for the visa with you.\nYou might also have to pay other costs for each applicant for health checks, police certificates and biometrics.\nUse the Visa Pricing Estimator to work out what your visa will cost. The estimator does not take into account the second instalment or other costs.\nSee more about visa fees and charges.\nApply from\nYou must be in Australia, but not in immigration clearance, when you apply and when we make a decision on your application. \nAny family members who apply for the visa with you must also be in Australia, but not in immigration clearance, when you apply.\nIf you apply for this visa in Australia while on a temporary visa with a no further stay condition, your application will be invalid, unless you apply for a waiver of this condition. \nProcessing times\nThe demand for these visas is greater than the number of places available each year. As a result, processing times for these applications can be lengthy.\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application might take longer to process if:\nyou do not fill it in correctly\nyou do not include all of the documents we need or we need more information from you and/or\nyour information takes a long time to verify.\nWe cannot process your application if you do not pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\nThe Reports on Migration Programs have further information on Migration Program outcomes against planning for each migration program year.\nApplications for this visa are subject to capping and queueing.\nLearn more about the Parent visa queue and processing priorities.\nAssessment\nWe assess applications for this visa in 2 stages:\nCheck eligibility and either add the application to the queue or refuse it.\nContinue assessing the application when a place becomes available and make a decision.\nDo not arrange to stay permanently in Australia until your visa is granted. We will let you know in writing if we grant you the visa.\nLearn more about the Parent visa queue and processing priorities.\nConsider another visa\nOther Parent visas available include the:\nContributory Aged Parent visa (subclass 864) which is a permanent visa but costs more.\nContributory Aged Parent (Temporary) visa (subclass 884), then a permanent Contributory Aged Parent visa (subclass 864). This 2-step visa process costs more than the subclass 804 visa. It also costs more than applying directly for the Contributory Aged Parent visa (subclass 864), but the cost is spread across the 2 visas over a longer period.\nSponsored Parent (Temporary) visa (subclass 870) which is a temporary visa allowing parents to visit their children in Australia for up to three or five years at a time and a cumulative maximum 10 year period.\nYou can view all visa options on our Visa list page.\nYour obligations\nYou and your family members must obey all Australian laws.\nVisa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}