{
    "visaID": "visa1.4.2",
    "visaType": "visa1.4",
    "visaName": "Tourist stream (apply in Australia)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/visitor-600/tourist-stream-onshore",
    "content": "Visitor visa (subclass 600)\nTourist stream (apply in Australia)\nThis visa stream lets you visit Australia as a tourist, to visit family and friends or for purposes other than business or medical treatment.\n\n\n\n\n\n\n\n\nWith this visa you can\nvisit family or friends\nbe here as a tourist, for a cruise, or for any purpose except business or medical treatment\nYou can study or train for up to 3 months on this visa. But if your main reason for travelling to Australia is study, a student visa might be more appropriate.\nYou can't work.\nCruise\nYou will need a visa if you enter Australia during a cruise.\nIf your cruise is a round trip cruise, the time you spend on the cruise counts as time spent in Australia. We do not consider you to have left Australia. A round trip cruise will not reset your stay period on your visa.\nAsk your cruise operator or travel agent if we consider your cruise to be a round trip cruise.\nHow long you can stay\nThis is a temporary visa. \nYou can stay for the period or dates specified on the visa grant letter. We determine the length of your visa on a case by case basis. Things we might consider when determining your stay period include:\nhow long you want to stay\nwhy you want to stay in Australia\nWe might not grant you the length of stay you want.\nWe can grant this visa with multiple entry or no travel.\nIf we grant you a visa with multiple entry, you can leave and return to Australia on the visa while it is valid.\nYou may need to show there are exceptional circumstances if you want to stay in Australia:\nas the holder of one or more visitor visas\nand for more than 12 consecutive months\nIf you want to stay longer or permanently in Australia you will need to apply for a visa that allows this.\nStay longer\nYou can't stay in Australia longer by extending this visa. You must apply for another visa.\nExplore your visa options.\nInclude family\nYou can't include family members in your application. Each family member, including those listed on your passport, must submit a separate application.\nNewborn child\nFind out what to do if you give birth to a child after you apply.\nCost\nThe visa costs from AUD490.00 for each applicant.\nYou might also have to pay:\nother costs for health checks, police certificates and biometrics\na Subsequent temporary application charge\nTo work out what your visa will cost use the Visa pricing estimator. The estimator does not take into account the other costs.\nApply in Australia\nEligible applicants can apply for this visa in Australia. If you apply in Australia, you must be in Australia when we make a decision on your application.\nYou can apply for a new visa if your visa does not have a condition that prevents further stay, such as condition 8503. You might be able to request a waiver of the no further stay condition in some circumstances.\nProcessing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour obligations\nYou must comply with all visa conditions and Australian laws.\nLearn more about visa conditions.\nHealth insurance\nYou are liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability.\nTo cover any unforeseen medical treatment you might need in Australia you should take out adequate health insurance.\nLearn more about health insurance for overseas visitors.\nSome countries have a reciprocal healthcare agreement with Australia.\nIn some circumstances, we might grant your visa with Condition 8501 – Maintain adequate health insurance.\nTravel\nCheck if you have multiple entry, or single entry, in VEVO or your visa grant letter.\nIf you have multiple entry, you can travel outside Australia and return while your visa is valid.\nIf you have no travel and you leave Australia, you have to apply for another visa to return.\nVisa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}