{
    "visaID": "visa6.1",
    "visaType": "visa6",
    "visaName": "Bridging visa A – BVA - (subclass 010)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-a-010",
    "content": "Subclass 010\nBridging visa A (BVA)\nThis temporary visa generally allows you to stay in Australia after your current substantive visa ceases and while your new substantive visa application is being processed.\n\n\n\n\n\n\n\n\nAbout this visa\nThis is a temporary visa. Nearly all bridging visas are applied for automatically as part of applying for a substantive visa. We will tell you if this happens. Check if you already hold a Bridging visa A (BVA) with VEVO.\nA separate application for a BVA may be necessary where:\nyour substantive visa application did not also constitute an application for a BVA\nyou were granted a BVA or a Bridging visa B (BVB) but this has ceased and you meet the requirements for another BVA\nyou are seeking a further BVA without work restrictions \nyou have applied for judicial review.\nYou can't use a bridging visa while you wait for a citizenship application to be decided.\nIn effect\nA BVA comes 'in to effect' when:\nit is granted (if your substantive visa has ceased since applying for the BVA or the BVA is more beneficial than your current bridging visa)\nyour current substantive visa ceases\nanother bridging visa that is more beneficial than your current bridging visa ceases.\nVisa holders must adhere to the conditions imposed on their visa. Where you are granted a BVA, you will be notified about the conditions that apply.\nIf you hold a substantive visa when your BVA is granted, you must continue to comply with the conditions of the substantive visa. When your substantive visa ceases, the conditions of your BVA will apply.\nThe BVA does not support return travel to Australia.\nWorking in Australia\nYou might be allowed to work in Australia depending on the visa conditions that apply to your BVA. Your grant letter will tell you about these conditions. See if you have work restrictions in VEVO.\nIf your BVA does not let you work, or has restrictions on working, you can apply for another BVA that lets you work. To be considered for a BVA that lets you work, you will usually have to demonstrate that you are in financial hardship. \nWe will assess your circumstances in relation to your claim that you need to work. If you do not meet the requirements for work, and you are still eligible for a BVA, we will grant you a new BVA with the same work prevention or restriction condition that was on your previous BVA.\nYou cannot be granted a new BVA that lets you work if your current BVA prevents or restricts you from working in Australia and either:\nyour current BVA was granted to you because you have applied for judicial review of the decision made on your substantive visa application, or\nyou have applied for a protection visa. \nRemaining lawful during judicial review\nIf a merits review tribunal upholds our decision to refuse your substantive visa application and you apply for judicial review, you will need to apply for a bridging visa to maintain your lawful status during the judicial review proceedings. If you have applied for judicial review you can only apply for a bridging visa by webform.\nWith this visa you can\nstay lawfully in Australia until your substantive visa application is finally determined, or if granted in association with judicial proceedings, until those proceedings are complete.\nA BVA will end immediately if the following situations occur: \nyou leave Australia while your BVA is in effect\nyou are granted the substantive visa you applied for\nyou are granted another Bridging visa (such as a BVB) in relation to the same substantive visa application that this BVA is associated with\nwe cancel either your BVA or the substantive visa that you held when you were granted the BVA.\nHow long you can stay\nIn all other situations one of the following outcomes will determine when your BVA ceases:\nyour substantive visa application is refused \nyour merits or judicial review is decided\nyou withdraw your application for the substantive visa, merits review or judicial review \na merit review tribunal tells you that it has no jurisdiction to consider your application for review.\nOnce you have been notified of an outcome you can see exactly how long you can stay in Australia in VEVO.\nBVA granted on or after 19 November 2016\nYour BVA will cease 35 calendar days after:\nour refusal decision or a decision by the Administrative Appeals Tribunal (AAT) in relation to your associated substantive visa application\na determination that your substantive visa application or an application for review by the AAT is invalid\nyou withdraw your substantive visa application or application for review by the AAT.\nYou BVA will cease 28 calendar days after:\na judicial review body upholds the decision to refuse your substantive visa application\nyou withdraw a related judicial review application.\nBVA granted before 19 November 2016\nYour BVA will cease 28 days after the date that one of the following happens:\nwe notify you that your substantive visa application is not valid\nwe notify you that your substantive visa application has been refused\nyou withdraw your substantive visa application\na merits review tribunal notifies you that it has upheld our decision to refuse your substantive visa application\na merit review tribunal notifies you that it has no jurisdiction to consider your application for review\nyou withdraw your application for merits or judicial review from a merits review tribunal or a judicial review body \na judicial review body upholds the decision to refuse your substantive visa application.\nStay longer\nYou can't stay in Australia longer by extending this visa. You must apply for a new visa if you wish to stay longer.\nExplore your visa options.\nInclude family\nIf you and your family have applied together for a substantive visa in Australia, you might have also applied together for a BVA. Check if family members already hold a BVA with VEVO.\nIf you apply separately for a BVA, you can include members of the family unit in your BVA application if they are included in your substantive visa application.\nWe will assess each member of the family unit's application and decide which bridging visa they can be granted.\nCost\nFree\nApply from\nYou and anyone included in your application must be in Australia when the BVA application is submitted and granted.\nYour obligations\nYou and anyone included in your application must:\ncomply with all Australian laws\ncomply with the conditions of the current visa\ncomply with the conditions of your Bridging visa A when it comes into effect\nSee the conditions that will and might be applied to a BVA.\nTravel\nIf you leave Australia on this visa when it is in effect you will not be able to return on it. A BVA that is in-effect will cease upon departure from Australia. To see if your BVA is in effect, see VEVO. \nIf you want to travel and return to Australia whilst your substantive visa application is being processed, you will need to have been granted a BVB before you leave.\nVisa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}