{
    "visaID": "visa3.14",
    "visaType": "visa3",
    "visaName": "New Zealand Citizen Family Relationship (temporary) visa (subclass 461)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/new-zealand-citizen-family-relationship-temporary-461",
    "content": "\n1. Subclass 461\n2. New Zealand Citizen Family Relationship visa\nThis is a temporary visa. You can stay in Australia for 5 years.\nFrom AUD430.00\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nSee all conditions\nIf you are getting help with your visa, before you pay someone, read information on Who can help with your visa application.\n3. With this visa you can\n4. How long you can stay\nThis is a temporary visa. You can stay in Australia for 5 years.\nThe visa is granted with multiple entry. You can travel to and from Australia as many times as you want during the 5 year period.\nThe visa will be in effect from the date your visa is granted.\n5. Include family\nYou can combine your application with other members of the family unit when you apply.\nMembers of the family unit who apply for the visa must meet health and character requirements.\nYou can't add family members to a Subclass 461 visa application after it is lodged.\nWhile applicants can include members of their familyunit when they lodge the application, all applicants are assessed individually.\nFind out what to do if your child is born after you apply.\nNote: a child born to a New Zealand citizen parent in Australia may not be eligible for New Zealand citizenship by descent. For information about New Zealand citizenship, see the New Zealand government website.\n6. Stay longer\nYou can't stay in Australia after your visa ceases unless you are the holder of another visa.\nYou can apply for a further Subclass 461 visa if you meet the eligibility requirements.\n7. Cost\nThe below are the costs to make a valid application for a Subclass 461 visa:\nYou might also have to pay other costs such as for health examinations, police certificates and biometrics.\nTo work out what your visa application might cost, use the Visa Pricing Estimator. The estimator does not take into account the other costs.\n8. Apply from\nYou can be in or outside Australia when you apply for the visa but not in immigration clearance.\nSee the Step-by-Step section for information on how to apply.\nSee Visa outcome for information on where you must be if we grant you the visa.\n9. Processing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application can take longer to process if:\nWe cannot process your application if you do not pay the correct cost. We will notify you if this is the case and if necessary return your application without processing it.\n10. Your obligations\nYou and members of your family unit must meet all visa conditions that apply and follow all Australian laws.\nSee the conditions for this visa.\n11. Travel\nYou can travel outside Australia and return as many times as you want during the 5 years you may hold your visa.\n12. Visa label\nWe will digitally link your visa to your passport. You will not get a visa label in your passport.\nYou cannot be granted this visa if you are an Australian citizen.\nYou cannot be granted this visa if you are a New Zealand citizen.\nIf you become a New Zealand citizen during the processing of your application you can continue with the application, or instead withdraw it and apply for a Subclass 444 visa and be granted that visa if you meet the requirements.\nCertain persons may not be eligible for New Zealand citizenship by descent.\nFor information about New Zealand citizenship, see the New Zealand government website.\nYou might be able to be granted this visa if you are in any of the below three categories.\nYou are a member of the family unit of a New Zealand citizen, who is not an eligible New Zealand citizen and who either:\nNote: Your New Zealand family member must have (or be eligible for) a Subclass 444 visa.\nNew Zealand citizens are not automatically granted a Subclass 444 visa.\nTo find out if your New Zealand family member already holds a visa, use VEVO.\nYou are in Australia and you meet all of the following:\nYou are outside Australia and you meet all of the following:\nIf you are outside Australia, you must also meet one of the following:\nFor more information on family units see members of the family unit.\nIf you are outside Australia when you apply\nYou can apply for the subclass 461 visa without needing to hold another type of visa.\nIf you are in Australia when you apply\nYou need to hold a substantive temporary visa when you apply, other than a Subclass 403 Temporary Work (International Relations) visa in the Domestic Worker (Diplomatic or Consular) stream.\nIf you did not hold a substantive visa when you applied, the last substantive temporary visa held by you was not a Subclass 403 (Temporary Work (International Relations) visa in the Domestic Worker (Diplomatic or Consular) stream and you satisfy certain criteria such as having made your application within 12 months after being the holder of a substantive visa.\nYou and any members of your family unit who apply for the visa with you must meet certain health requirements.\nWe strongly encourage you to undertake any required health examinations before lodging your application. Lodging a complete application assists with quicker processing times. To complete your health examinations prior to submitting your visa application visit My Health Declarations(MHD).\n.\nYou and any members of your family unit 16 years of age or over who apply for the visa with you must meet certain character requirements.\nOther family members might also need to meet certain character requirements.\nWe recommend you take out health insurance to cover any unforeseen medical treatment you might need in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability.\nSee what is considered as adequate health insurance.\nSee more about health insurance for overseas visitors.\nReciprocal healthcare agreements\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements.\n​If you are 18 years of age or older when you make your application, you must sign the Australian Values Statement unless we decide you are not required to sign it due to any compelling circumstances that you have demonstrated.\nYou should not have any outstanding debts to the Australian Government. If you owe the Australian Government any money, you must have made appropriate arrangements to pay it back.\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused, see Limitations on applications in Australia (129KB PDF).\nIf applying for a visa from outside Australia, see Can I go to Australia.\nIf you want immigration assistance, see Who can help with your visa application.\nIf you are under 18 years of age, we might not grant this visa if it is not in your best interest.\nYou might not be able to apply for this visa if you have a No Further Stay condition.\nCheck if this affects you.\nYou might want to get help with your application.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nAll applicants should have a valid passport or other travel document before we grant this visa.\nIf you need a new passport, plan to get it before you apply for this visa.\nIf you cannot get a passport or travel document, tell us as soon as possible.\nIf you get a new passport after you apply, tell us your new passport information as soon as possible. See how to tell us your passport details have changed.\nYou must give us documents proving your identity and relationship to a New Zealand citizen, along with documents about any members of your family unit who are applying with you.\nIf your current visa is about to cease you can lodge a Subclass 461 visa application by submitting the application form and the identity documents for all applicants and the New Zealand family member.\nProvide accurate information. See what happens if you can't prove your identity or do not provide true information.\nProvide identity documents and evidence of your relationship to a New Zealand citizen.\nWe need proof of your identity. If you can't prove your identity we might:\nProvide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\nAlso provide:\nDocuments that prove a change of name include:\nProvide a death certificate, divorce or separation documents, or a statutory declaration if anyone in your application has been:\nProvide two recent passport-size photos (45mm x 35mm) for each person in your application. The photos must have:\nProvide an Australian police certificate if you have spent a total of 12 months or more in Australia in the last 10 years since you turned 16 years of age. We only accept complete disclosure National Police Certificates issued by the Australian Federal Police. We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police.\nAlso provide:\nComplete and provide the following forms:\nYou are strongly encouraged to undertake any character checks before lodging your application. Lodging a complete application assists with quicker processing times.\nIf you spent a total of 12 months or more in the last 10 years in New Zealand you must provide a New Zealand police certificate.\nThe Department of Home Affairs will initiate the request of a New Zealand criminal record check on your behalf. A case officer will contact you directly to facilitate the check.\nYou will need to complete the Consent to Exchange of Criminal Record Check Information - Jan 2024 form. You may also be required to provide additional documentation to us if there are any convictions of concern.\nCheck ImmiAccount if you need to do any health examinations. If health examinations are required, you are strongly encouraged to do them before lodging your application so that we can process your application more quickly.\nEven though you cannot lodge an application for this visa in ImmiAccount, you can do any required health examinations in ImmiAccount before you lodge your application.\nFor more information see health requirements.\nYou must be the partner of a New Zealand citizen, or the child or step-child of a New Zealand citizen or their partner.\nEvidence of your relationship to a New Zealand citizen can include:\nSee the type of documents you need to provide to us as evidence that you are either the partner or dependent child or step-child of a New Zealand citizen in the sections below.\nAlso give us evidence that the New Zealand citizen holds or is eligible for a Subclass 444 visa. This can include:\nWe need to see evidence that you are in a genuine and ongoing relationship with your spouse or de facto partner. Provide:\nIf either you or your partner have been married previously, provide evidence of divorce.\nFor every dependent under 18 years of age who is applying with you, provide:\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\nThey must complete either:\nAlternatively, you can show us:\nInclude a document with the signature and photo of the person who completed the form or declaration, such as:\nIf the child (or step-child) is not staying with a relative or legal guardian, provide  Form 1257 Undertaking declaration (211KB PDF). The person they are staying with must sign the form.\nProvide identity documents, photos and information about other relationships for dependants who are 18 years of age or older.\nFor every dependant 18 years of age or older who is applying with you, provide:\nYou need to prove that this person is dependent on you. Provide:\nYou must also prove this person has been financially dependent on you for at least 12 months before you apply. You could provide:\nUsually, your child (or step-child) must be under 23 years of age to be included in your application form and be under 23 years of age at the time of visa grant.\nHowever, a child (or step-child) over 23 years of age can be included if they are unable to earn a living to support themselves due to physical or cognitive limitations. In this case, please provide information about the physical or cognitive limitations.\nTo nominate someone to:\nSend written notification or your forms with your paper application.\nHave all non-English documents translated into English.\nProvide original copies and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters (NAATI).\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nWhen you apply on paper you must provide certified copies of your documents.\nThis includes:\nIf you are emailing us documents after you apply, the documents do not need to be certified. Use a good quality photograph or scan.\nKeep a copy of your completed application.\nSend us:\nYou can't apply for this visa online.\nSubmit a valid application before any existing visa ceases.\nPostal address\n\tNew Zealand Family Relationship visa office\n\tGPO Box 9984\n\tSYDNEY NSW 2001\n\tAustralia\nEnsure you pay the correct postage amount.\nYou can’t submit this application in person.\nIf any of the above steps are incomplete, your application may be invalid. We do not process invalid applications. We will notify you if this is the case, and if requested, return your application.\nDo not send original documents with your application, only send certified copies. Keep a copy of your completed application for your own records, including any supporting documents.\nWe will let you know when we have received your application and documents. See what you can and must do after you apply.\nIf it is within standard processing times, do not call or email. We do not provide updates on the progress of your application. You will be contacted if additional information is required.\nWe do not acknowledge receipt of documents you send after you have submitted your application.\nThis visa is a paper based application. You can't import it to, or access it through ImmiAccount.\nIf you apply in Australia, tell us if you want to travel outside Australia while we process your application.\nIf you leave Australia, make sure you hold a visa that will allow you to return.\nLearn about visa expiry.\nLearn about Bridging visas.\nWe will let you know if you need to do any other health examinations.\nWe might ask for biometrics. We will let you know if you need to provide them.\nIf you did not give us all documents when you applied, send them to the same address where you sent your visa application as soon as you can.\nWe do not acknowledge receipt of documents you send after you have submitted your application.\nIf you are in Australia, make sure you continue being a lawful non-citizen by holding a visa while we your application is being processed.\nIf you held a substantive visa when you applied for this visa, you may be eligible for an associated bridging visa A (BVA). If you are granted a BVA and your current visa ceases before your Subclass 461 visa is decided, the BVA will come into effect. You can stay lawfully in Australia on the BVA while your application is being processed.\nSee what to do if your visa has ceased or is about to cease.\nLearn more about visa expiry.\nLet us know as soon as you can. Complete  Form 1023 - Notification of incorrect answers (168KB PDF).\nLet us know if you no longer want someone to:\nSend written notification or your forms to the office your submitted your application.\nFor more information see Who can help you with your application.\nThings you need to let us know about after you have applied include:\nSee what to do if your situation changes.\nYou can be in or outside Australian when we make a decision.\nEnsure you keep your contact details with us up to date. We will let you know in writing our decision about your visa application. If your visa is granted, we will tell you:\nKeep a copy of the decision with you when in Australia.\nIf your visa is refused, we will let you know in writing. We will tell you why your visa was refused and whether you have a right to a review of the decision.\nYou must have:\nAll people arriving Australia must complete an Incoming Passenger Card.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nYou and your family members must meet all visa conditions and follow Australian laws. See your conditions in your grant letter or in VEVO.\nThings you need to let us know about include:\nSee how to tell us when your situation changes\nSee your conditions and work and study entitlements in VEVO.\nThis is a temporary visa. You can stay in Australia for 5 years.\nThe visa starts on the date it is granted.\nTo see when you must leave Australia, use VEVO\nYou can apply for another Subclass 461 visa if you meet the eligibility criteria.\nIf you no longer meet the eligibility criteria for another Subclass 461 visa, or want to apply for permanent residence, you should explore your options with the Visa finder.\nThe visa is granted with multiple entry. You can leave and re-enter Australia as many times as you want while you hold your Subclass 461 visa.\nThe time you spend outside Australia does not extend the visa.\nTo prove you have a visa and show your conditions to someone, use VEVO.\nRequest your international movement records to get proof of your travel in and out of Australia.\nThis visa lets you work and study in Australia. You are protected by Australian workplace law. See your workplace rights and entitlements.\nYou must have a valid passport or other travel document to leave Australia.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nYou are likely to have some money in a superannuation fund if you worked in Australia and you are:\nSee how to access your super.\nRequest your international movement records to get proof of your travel in and out of Australia."
}