{
    "visaID": "visa6.13",
    "visaType": "visa6",
    "visaName": "Confirmatory (Residence) visa (subclass 808)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/confirmatory-residence-subclass-808",
    "content": "\n1. Subclass 808\n2. Confirmatory (Residence)\nPermanently\nFrom AUD365.00\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nSee all conditions\nIf you are getting help with your visa, before you pay someone, read information on Who can help with your visa application.\n3. Visa arrangements for Norfolk Island residents and former entry permit holders\nThe Norfolk Island Immigration Act 1980 has been repealed and Norfolk Island has been integrated into the Australian migration zone.\nWe have made transitional visa arrangements for residents of Norfolk Island and people who held a Norfolk Island immigration permit to ensure they are not disadvantaged by this change. The transitional arrangements offer non-citizen permit holders and residents rights and benefits comparable to those they had under the repealed act.\nOn 1 July 2016, all non-citizens who were permanent residents of Norfolk Island under the Norfolk Island Immigration Act 1980 were taken to have been granted a comparable permanent Australian visa.\nYou are also considered to have been granted a comparable Australian visa if, on 30 June 2016, you held one of these permits under the Norfolk Island Immigration Act 1980:\nWe take you to have been granted the Confirmatory Residence visa (subclass 808) if, at the end of 30 June 2016\nWe consider you were granted a Provisional Resident return visa (subclass 159) if at the end of 30 June 2016 you:\nWe consider you were granted a Special Category visa (subclass 444) if at the end of 30 June 2016 you:\nIf you held a temporary visa under the Migration Act 1958, that visa would remain in effect unless it was a:\nThis means that unless you applied for and were granted another visa, the subclass 444 visa only came into effect when your current visa expired or expires.\nSee more about the Special Category visa (subclass 444).\nIf you are travelling between Norfolk Island and a country other than Australia you are subject to Australian immigration requirements in line with the Australian Migration Act 1958 and the Migration Regulations 1994. You must have an appropriate Australian visa to enter, visit or live in Norfolk Island.\nExplore your visa options.\n4. Who can apply for this visa\nYou might be able to apply for this visa if you are a former holder of a Norfolk Island immigration permit and on 30 June 2016,\nTo be granted this visa, you must have been lawfully present in Norfolk Island for at least 5 of the 7 years immediately before applying for this visa\nIf you have not been lawfully present in Norfolk Island for this period, you might still be eligible to meet this residence requirement if you are, or have been, lawfully present elsewhere in Australia for the purpose of study, and during that time all of the following apply:\nYou might need to provide evidence of your length of residence in Norfolk Island and elsewhere in Australia\nIf you are a dependent child, you might be able to be granted this visa as a secondary applicant if all of the following are met:\nAs a secondary applicant, you will not need to meet the requirement of being lawfully present in Norfolk Island for five of the seven years immediately before lodging your application with your parent.\n5. With this visa you can\nYou can travel to and from Australia as many times as you want for 5 years from the date we grant this visa.\nIf you want to travel after the initial 5-year travel facility:\nTo see when your travel facility ends, use VEVO.\n6. How long you can stay\nThis visa allows you to remain in Australia indefinitely.\nFor citizenship purposes, your permanent residence starts on the day:\n7. Cost\nFrom AUD365.00\n8. Apply from\nYou can apply for this visa from outside Australia. Do not make arrangements to travel to Australia until you are advised in writing that you have been granted a visa. Wait for a decision from us before you leave your job, sell your home or book your travel.\nYou can also apply for this visa in Australia, but not in immigration clearance. You could be eligible for a Bridging visa that allows you to stay in Australia lawfully while your application is processed. If you are granted a Bridging visa A (BVA), you can apply for a Bridging visa B (BVB) to travel outside Australia while you wait for a decision.\n9. Processing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n10. Your obligations\nYou must meet all visa conditions and follow Australian laws.\n11. Visa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nYou might be eligible to apply for this visa if, on 30 June 2016, you:\nYou might be eligible to apply for the visa as a dependent child of a former holder of a TEP, GEP or UEP if:\nYou might also be eligible to apply for this visa as a dependent child, if all of the following are met:\nYou must have been lawfully present in Norfolk Island or elsewhere in Australia for at least 5 of the 7 years immediately before you apply for this visa. We might ask you to provide evidence of how long you have lived in Norfolk Island or elsewhere in Australia\nYou might still be eligible to apply for the visa if you don't meet this requirement because you are or have been living somewhere else in Australia to study and, during that time:\nIf you are applying for this visa as a secondary applicant, you do not need to meet either of these residence requirements\nYou must meet our character requirement.\nIf you had health exams for your Subclass 159 visa to a permanent visa standard, you might not need to have them again. We will let you know if you need them.\nFor all other applicants, including children born in Australia to Subclass 159 visa holders, we will need let you know if you need them.\nLearn more about the health requirements.\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused, see Limitations on applications in Australia (129KB PDF).\nIf applying for a visa from outside Australia, see Can I go to Australia.\nIf you want immigration assistance, see Who can help with your visa application.\nYou need a valid passport, unless it is unreasonable for you to hold one\nIf you plan to get a new passport, you should do so before applying for your visa. Update your passport details with us.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nYou need to provide documents to prove the claims you make in the application. Some documents could take some time to obtain. You should have them ready when you lodge the application to reduce any delays in processing.\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nProvide Certified copies of the biographical pages of the current passports or travel documents of all people included in the application (these are the pages showing your photo, personal details, and passport issue and expiry dates).\nAlso provide:\nDocuments that prove a change of name include:\nWe will tell you if and when you need to get Police certificates.\nAs a former holder of a Norfolk Island immigration permit, your immigration record will be included in Norfolk Island immigration records. Under the Norfolk Island Continued Laws Amendment (2016 Measures No. 1) Ordinance 2016 , APS officers of the Department of Home Affairs (the Department) are authorised to access these records and use them for purposes arising, directly or indirectly, under, relevantly, the Migration Act 1958, Australian Citizenship Act 2007 and the Norfolk Island Legislation Amendment Act 2015. Therefore, the Department will be able to verify if you or your parent are a former holder of a Norfolk Island immigration permit for the purposes of making a decision on your visa application. However, it may still be necessary for the Department to request additional information from you. For more information about the above Ordinance, refer to the Explanatory Statement. .\nProvide a certified copy of your birth certificate.\nIf you are, or have been, living elsewhere in Australia while studying, provide:\nTo nominate someone to:\nSend written notification or your forms with your paper application.\nTranslate\nHave all non-English documents translated into English.\nProvide original copies and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nNote: You do not need to have any documents certified.\nComplete the following application form to apply for this visa.\nIf you are applying inside or outside of Australia, submit your Subclass 808 Confirmatory (Residence) visa application by post:\nNorfolk Island Visa Application\nDepartment of Home Affairs\nGPO Box ​9984\nSYDNEY NSW 2001\nAUSTRALIA\nIf any of the above steps are incomplete, your application may be invalid. We do not process invalid applications. We will notify you if this is the case, and if requested, return your application.\nDo not send original documents with your application, only send certified copies. Keep a copy of your completed application for your own records, including any supporting documents.\nWe will let you know when we have received your application and documents.\nIf you apply for this visa from outside Australia, do not make arrangements to travel to Australia until you are advised in writing that you have been granted a visa. Wait for a decision from us before you leave your job, sell your home or book your travel.\nIf you apply for this visa in Australia, you could be eligible for a Bridging visa that allows you to stay in Australia lawfully while your application is processed. If you are granted a Bridging visa A (BVA), you can apply for a Bridging visa B (BVB) to travel outside Australia while you wait for a decision.\nLet us know as soon as you can if you made a mistake on your application.\nComplete Form 1023 Notification of incorrect answers  (168KB PDF) and attach it in ImmiAccount, if you applied online.\nSend it to the office where you sent the application if you applied on paper.\nThings you need to let us know about after you have applied include:\nSee how to tell us if your situation changes.\nYou can withdraw your application before a decision is made on your application.\nIf you give birth to a child in Australia, you must tell us as soon as possible. To do this:\nOutside Australia: if your child is born outside Australia and either parent is an Australian citizen at the time of your child's birth, the child might be eligible for Australian citizenship by descent.\nIn Australia: if your child is born in Australia, they are automatically granted the same visa you and your partner hold at the time of the child's birth. If either parent is an Australian citizen or Australian permanent resident at the time of the child's birth, the child might be an Australian citizen by birth.\nFor more information, see:Including family members in your application.\nLet us know if you no longer want someone to:\nSend written notification or your forms to the office your submitted your application.\nFor more information see Who can help you with your application.\nIf the visa is granted, we will let you know in writing:\nIf the visa is not granted, we will let you know:\nYou must have:\nAll people arriving Australia must complete the Incoming Passenger Card. You will given this card onboard.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nTo see your specific conditions and work entitlements use VEVO.\nYou must obey all Australian laws.\nThings you need to let us know about include:\nSee how to tell us if there is a change in your situation.\nYou can travel to and from Australia as many times as you want for 5 years from the date we grant this visa.\nIf you want to travel after the initial 5-year travel facility:\nTo see when your travel facility ends, use VEVO.\nTo prove you have a visa and show your conditions to someone, use VEVO.\nRequest your international movement records to get proof of your travel in and out of Australia.\nYou are protected by Australian workplace law. See your workplace rights and entitlements .\nAs an Australian permanent resident, you might be able to sponsor eligible family members to come to Australia.\nTo find a visa for your family member, explore visa options.\nAfter a certain time, you might be eligible for Australian citizenship. Find out more about becoming a citizen.\nFor citizenship purposes, your permanent residence starts on the day:\nYou must have a valid passport or other travel document to leave Australia.\nCheck your conditions and the expiry of your Resident Return visa in VEVO.\nSee what to do if your visa has expired or is about to expire.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nRequest your international movement records to get proof of your travel in and out of Australia."
}