{
    "visaID": "visa1.3",
    "visaType": "visa1",
    "visaName": "Transit visa (subclass 771)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/transit-771",
    "content": "\n1. (Subclass 771)\n2. Transit visa\nNo longer than 72 hours\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nSee all conditions\nIf you are getting help with your visa, before you pay someone, read information on Who can help with your visa application.\nApply\n3. You might not need it\nAll non-citizens need a visa or permission to enter Australia. This includes those staying for a short time or just transiting and not leaving the airport. You may not need a Transit visa if you already hold another valid Australian temporary or permanent visa, and that visa permits you to transit Australia.\nIf you already hold a visa to Australia, applying for and being granted a Transit visa will likely end your other visa. If you want to use the other visa in the future you will need to re-apply and pay any applicable fee.\nIf you want to use your other visa to transit through Australia, be aware that different Australian visas can expire at different times. Check ImmiAccount for your Visa Grant Notice or VEVO to see what visa duration and travel limits apply to your visa.\nSome Australian visas are only valid for a set time. This time starts after you first arrive in Australia, no matter how short that first visit may be. Some visas are only valid for a single entry to Australia.\nIf these circumstances apply to you, you may wish to rethink your travel and visa arrangements.\nOther visas may allow you multiple trips to Australia and how long you can stay resets each time you arrive.\nBefore you consider your visa options for transiting through Australia, check:\nYou may not need a Transit visa if you are:\nThese visas permit the holder to Transit through Australia. They also permit a longer period of stay.\n4. With this visa, you can\n5. Cost\nFree.\n6. How long you can stay\nNo longer than 72 hours, unless you are the holder of a Maritime Crew visa.\n7. Maritime Crew visa (MCV) holder\nYou have 5 days from arrival by air to sign onto your eligible ship, otherwise your MCV will cease and you may become an unlawful non-citizen. You will need to apply for a new Transit visa on each occasion you need to enter Australia by air to join a ship.\n8. Stay longer\nYou can't stay in Australia longer by extending this visa. If you want to stay longer, you must apply for another visa.\nExplore visa options.\n9. Include family\nYou can't include family. You must make a separate application for each person travelling. This includes babies on their parent's passport.\n10. Apply from\nYou must be outside Australia when you apply and when we decide your application.\n11. Processing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n12. Your obligations\nYou must meet all visa conditions and obey Australian laws.\nLearn more about conditions for this visa.\nYou must leave Australia within 72 hours unless you also hold a Maritime Crew visa (MCV). If you hold an MCV and arrive in Australia by air on a Transit visa, you must join your ship within 5 days.\nYou must meet our health requirement.\nYou must meet our character requirement.\nYou must meet our biometrics requirement.\nYou are personally liable for all your healthcare costs while you are in Australia. Medical insurance helps limit your financial liability.\nWe might make adequate health cover for the whole of your stay a requirement for grant of this visa. Your health cover should cover you for medically necessary treatment, including transport.\nSee what we consider adequate health insurance.\nLearn more about health insurance for overseas visitors.\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements.\nIf you or any family members (including those who don't apply for the visa with you) owe the Australian Government money, you or they must have paid it back or arranged to pay it back.\nIf entering by air to join the crew of an eligible ship, you must hold a Maritime Crew visa (MCV).\nIf you are 18 years of age or older, you must acknowledge the Australian Values Statement. This confirms you will respect the Australian way of life and obey Australian laws when you apply for the visa.​\nWe might not grant this visa if it is not in the best interests of an applicant under 18.\nFind out if you need a Transit visa by checking your eligibility.\nIf you are from an eligible country you may be eligible to Transit without a Visa (TWOV) see Travellers eligible to transit without a visa (TWOV).\nYou may not need a Transit visa if you are:\nas these visas permit the holder to Transit through Australia. They also permit a longer period of stay.\nYou may not need a Transit visa if you already hold another valid Australian temporary or permanent visa, and that visa permits you to transit Australia. You can check your visa conditions on VEVO.\nEnsure you apply for the visa well ahead of your travel. Provide all the required documents to prevent delays. We may still need more information from you and time to assess that information.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter. For more information see Authorised Recipients.\nSee what happens if you can't prove your identity or don't provide accurate information.\nProvide:\nProvide:\nProvide:\nProvide documents:\nWe need a statement from the vessel's local shipping/handling agent. The statement must include:\nTo nominate someone to:\nUpload your written notification or your forms to ImmiAccount.\nHave all non-English documents translated into English.\nProvide original and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nDo not certify police certificates. You need to send us the originals.\nFor all other documents we need a certified copy. This includes:\nSend us:\nProvide accurate information. See what happens if you can't prove your identity or don't provide accurate information.\nSee what you can and must do after you apply.\nWe will let you know when we have received your application.\nWe can’t give updates on applications within the standard processing time.\nYou can check if we need more information from you in ImmiAccount.\nWe might ask for biometrics (fingerprints and photo). We will let you know if you need to provide them.\nLet us know as soon as you can if you made a mistake on your application.\nComplete Form 1023 Notification of incorrect answers (168KB PDF).\nLet us know if you no longer want someone to:\nUpload your written notification or your forms to ImmiAccount.\nFor more information see Who can help you with your application.\nTell us if things change after you lodge your application but before we have made a decision.\nThings you need to let us know about include:\nSee what to do if your situation changes.\nYou must be outside Australia when we decide your visa application.\nWe will let you know our decision in writing.\nIf we grant your visa, we will tell you:\nKeep a copy of the decision.\nIf we refuse your visa, we will tell you:\nYou must have:\nEveryone who arrives in Australia must complete an Incoming Passenger Card. You will receive this on-board your flight.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nYou can be in Australia no longer than:\nYou can go sightseeing or visit family or friends before you depart.\nYour visa will come with conditions attached to it. To see your conditions use VEVO.\nYou must meet all visa conditions and obey Australian laws. See your visa grant letter or your conditions in VEVO.\nThings you might need to let us know about include:\nSee how to tell us if there is a change in your situation.\nYou can stay for no longer than 72 hours, or 5 days if you are a Maritime Crew visa holder.\nTo see when you must leave, use VEVO.\nYou can't stay in Australia longer by extending this visa. You must apply for a new visa if you want to stay longer.\nTo prove you have a visa and show your conditions to someone, use VEVO.\nTo get proof of your travel in and out of Australia you can request your international movement records.\nYou must have a valid passport or other valid travel document to leave Australia.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nTo get proof of your travel in and out of Australia you can request your international movement records."
}