{
    "visaID": "visa7.38",
    "visaType": "visa7",
    "visaName": "Tourist visa (subclass 676)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/tourist-visa-676",
    "content": "Tourist visa (subclass 676)\nThe Tourist visa (subclass 676) is closed to new applications. You may be eligible to apply for a Visitor visa (subclass 600).\nThis visa allows you either a single or multiple entries to Australia and to stay in Australia for a period of time determined by the Department.\n1. Visa holders\nThis information is for people who have already been granted a Tourist visa (subclass 676). It explains your rights and obligations.\nYou can use Visa Entitlement Verification Online (VEVO) for free to check your visa details and entitlements.\nWhen your visa was granted, we told you how long it lets you stay in Australia.\nWe also told you how many times you can enter Australia on this visa:\nYou must comply with all visa conditions and Australian laws.\nYou must comply with the following visa conditions:\nYou might also need to maintain adequate health insurance while you are in Australia.\nIf you are in Australia and want to extend your stay for tourism purposes, you might be able to apply for a Visitor visa (subclass 600). If you are able to apply, you should do so at least two weeks before your current visa expires. If your Tourist visa (subclass 676) has a 'No further stay condition', you cannot apply for a Visitor visa(subclass 600).\nA Visitor visa (subclass 600)can be granted if you:\nIf you hold a Visitor visa or a Working Holiday visa, you can only extend your stay in Australia so that the total duration of your stay is 12 months or less, unless there are exceptional circumstances. If you hold a Visitor or Working Holiday visa that lets you stay in Australia for 12 months, contact your nearest Australian visa office before applying for another visa.\nIf you are granted another visa, it will cease any visa or ETA you currently hold and the entitlements attached to it.\nIf a decision has not been made on your application before your original visa expires, you will be able to stay in Australia until the application has been finalised.\nIf you are refused another visa, you must leave Australia before the expiry of your authorised stay period."
}