{
    "visaID": "visa3.6",
    "visaType": "visa3",
    "visaName": "Carer visa (subclass 116)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/carer-116",
    "content": "\n1. Subclass 116\n2. Carer visa\n3. For Applicants\n4. For Sponsors\nPermanently\nFrom AUD2,115.00\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nFor more information, see Other Family Visa Queue\nSee all conditions\nIf you are getting help with your visa, before you pay someone, read information on who can help with your visa application.\n5. With this visa you can\nThis visa lets you come to or stay in Australia to provide care to someone with a long-term medical condition who does not have reasonable access to care options in Australia. The person you care for must be your Australian relative who needs care, or your relative's family member who needs care and lives with them.\nYou can travel to and from Australia as many times as you want for 5 years from the date we grant this visa. This is as long as the travel facility on this visa remains valid.\nIf you want to travel after the initial 5-year travel facility:\nTo see when your travel facility ends, use VEVO.\n6. How long you can stay\nThis is a permanent visa. It lets you stay in Australia indefinitely.\nFor citizenship purposes, your permanent residence starts on the day you enter Australia on the visa.\n7. Include family\nYou can include members of the family unit in your application when you apply.\nFamily members who apply for the visa must meet our health and character requirements.\n8. Cost\nThis visa costs from AUD2,115.00 for the main applicant. There is also a charge for each family member who applies with you.\nYou pay for this visa in 2 parts called instalments.\nPay the first instalment when you apply. Pay the second instalment when we ask you to.\nYou might also have to pay other costs for each applicant for health checks, police certificates and biometrics.\nUse the Visa Pricing Estimator to work out what your visa will cost. The estimator does not take into account the second instalment or other costs.\nWe might consider reducing your second instalment to nil if you can show us that paying the second instalment is likely to cause you or the person you are caring for severe financial hardship.\nWe will not reduce the second instalment for anyone applying for the visa with you.\nSend your request to us in writing.\n9. Apply from\nYou must be outside Australia when you apply and when we decide your application.\n10. Processing times\nThe demand for Other Family visas is greater than the number of places available each year. As a result, processing times for these applications can be lengthy.\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application might take longer to process if:\nWe can't process your application if you don't pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\nApplications for this visa are subject to capping and queueing.\nLearn more about the Other Family Visa queues and processing priorities.\nThe Reports on Migration Programs have further information on Migration Program outcomes against planning for each migration program year.\n11. Your obligations\nYou must enter Australia before the date specified in your grant letter. The first entry date is generally set at 12 months from the date of visa grant.\nYou and your family members must meet all visa conditions and obey Australian laws.\nSee what conditions might be attached to this visa on our visa conditions page.\n12. Travel\nYou can travel to and from Australia for 5 years from the date we grant the visa. After 5 years you will need a Resident Return (RRV) visa (subclass 155 or subclass 157) to re-enter Australia as a permanent resident.\n13. Visa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nAmong other things, you must be willing and able to provide ongoing substantial care and support for your sponsoring relative or the family member who lives with them.\nTo show this, you should fully understand your sponsor's medical condition and what their care needs are.\nYou must be sponsored by an eligible sponsor.\nWe must approve the sponsorship.\nYou and any family members who apply for the visa with you must meet our health requirement.\nFamily members who are not coming to Australia might also have to meet our health requirement.\nYou, and family members aged 16 years and over who apply for the visa with you, must meet our character requirement.\nWe might also ask that other family members meet the requirement.\nIf you or any family members (including those who don't apply for the visa with you) owe the Australian Government money, you or they must have paid it back or arranged to pay it back. .\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused, see Limitations on applications in Australia (129KB PDF).\nIf applying for a visa from outside Australia, see Can I go to Australia.\nIf you want immigration assistance, see Who can help with your visa application.\nIf you are 18 years of age or older, you must:\nWe might not grant this visa if it is not in the best interests of an applicant under 18.\nCheck your passport. If you need help with your application, get someone to act on your behalf.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nYour relative or their family member must be assessed by and get a medical certificate from Bupa Medical Visa Services. The certificate must include a statement that the person has a medical condition and requires a certain amount of care for this.\nWe won't accept the visa application unless we have evidence this process has at least begun.\nProvide evidence to support your application.\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nWe need proof of your identity. If you cannot prove your identity:\nProvide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\nAlso provide:\nDocuments that prove a change of name include:\nProvide a medical certificate from Bupa Medical Visa Services that includes a statement that your relative or their family member has a medical condition that requires care.\nIf you have begun the assessment process but have not yet been assessed, give us a letter from Bupa Medical Visa Services confirming this. Send us the medical certificate as soon as you receive it.\nYou must also give us written evidence that your Australian relative or their family member does not have reasonable access to care options in Australia.\nDo not arrange for police certificates until we ask you to. Learn more about police certificates.\nTo nominate someone to:\nSend written notification or your forms with your paper application.\nFor every dependent under 18 years old who is applying with you, provide:\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\nThey must complete either:\nInclude an identity document that shows the signature and photo of the person who completed the form or declaration, such as a passport or drivers licence.\nAlternatively, you can show us:\ninclude your child who is over 18 in your visa application, they must be\nIf your child is likely to turn 23 while your application is being processed, you will need to provide evidence they are dependent on you due to disability.\nProvide:\nYou must also provide proof the child is dependent on you.\nProvide:\nProvide either:\nDocuments that prove your de facto relationship could include:\nProvide 4 recent passport-size photos (45mm x 35mm) of anyone included in the application.\nPhotographs must be:\nYou can wear untinted prescription glasses. If you wear a head covering for religious reasons, you can show only your face.\nHave all non-English documents translated into English.\nProvide original copies and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nDo not certify police certificates. You need to send us the originals.\nHave all other documents certified copy. This includes:\nKeep a copy of your completed application.\nSend us:\nYou must apply for the visa on paper. You must be outside Australia when you apply and when we make a decision.\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nSubmit:\nThe forms must be completed in English.\nPay the application before it is submitted using the online portal payment function in ImmiAccount. Include evidence the application is paid for with your application. For other payment options see how to pay.\nSend the application by post or courier to the Child and Other Family Processing Centre in Perth at the address on the form. Include all required documents and forms with your application.\nIf any of the above steps are incomplete, your application may be invalid. We do not process invalid applications. We will notify you if this is the case, and if requested, return your application.\nDo not send original documents with your application, only send certified copies. Keep a copy of your completed application for your own records, including any supporting documents.\nWe will let you know when we have received your application. There are other things you need to know and might have to do.\nIf you did not give us the Bupa medical certificate when you applied, you should give it to us within 3 months of applying. If we don't have the medical certificate by the time we decide on your application, we will not grant you the visa.\nWe can't provide you with updates on your application's progress within normal processing times. We will let you know if you need to provide anything further.\nDo not arrange to travel to Australia until we let you know, in writing, that we have granted you the visa.\nYou must be outside Australia when we decide on your application.\nWe will let you know if you need health examinations.\nWe might ask for biometrics. We will let you know if your adopted child needs to provide them.\nIf you did not send us all documents when you applied, send them to the Child and Other Family Processing Centre in Perth at the address on the form.\nProvide the Bupa Medical Visa Services medical certificate as soon as you receive it.\nWe might also ask you to provide more information.\nPay the second instalment when we tell you to. We will send you an invoice for the instalment after you have met all other requirements for the visa.\nYou must pay the second instalment or we won't grant the visa.\nWe might consider reducing your second instalment to nil if you can show us it is likely to cause you or the person you are caring for severe financial hardship.\nWe will not reduce the second instalment for anyone applying for the visa with you.\nSend us a request in writing.\nLet us know as soon as you can.\nComplete Form 1023 Notification of incorrect answers (168KB PDF).\nLet us know if you no longer want someone to:\nSend written notification or your forms to the office your submitted your application.\nFor more information see Who can help you with your application.\nThings you need to let us know about after you have applied include:\nSee how to tell us if your situation changes.\nYou must be outside Australia when we decide on your application. We will let you know our decision in writing.\nWe will let you know:\nKeep a copy of our decision.\nIf we refuse your visa we will let you know in writing. We will tell you:\nWe will not refund the application fee if we refuse your application.\nYou must have:\nYou must enter Australia before the date specified in your grant letter.\nIf your visa is still valid and the date specified in your visa grant letter has passed or will pass before you can travel to Australia, you must ensure that:\nWe may then send you a travel facilitation letter. This will state that we allow you to enter Australia after the first entry arrival date of your visa.\nWe will not issue a travel facilitation letter unless there is less than 3 months remaining on your first entry arrival date.\nAll people arriving into Australia must complete the Incoming Passenger Card.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport using the SmartGate.\nYou and your family members must meet all visa conditions and obey Australian laws.\nYou can check visa details and conditions in VEVO.\nSee what to do if your situation changes.\nSee your visa expiry, conditions and work and study entitlements in VEVO.\nThis is a permanent visa. It lets you stay in Australia indefinitely.\nYou become a permanent resident on the day we grant the visa.\nFor citizenship purposes, your permanent residency starts on the day you enter Australia on this visa.\nAs a newly arrived resident, you may have to wait before you are able to access certain Australian Government payments and benefits. Learn more about newly arrived residents’ waiting period from Services Australia.\nYou can travel to and from Australia as many times as you want for 5 years from the date we grant this visa. This is as long as the travel facility on this visa remains valid.\nIf you want to travel after the initial 5-year travel facility:\nTo see when your travel facility ends, use VEVO.\nIf an immigration officer processes your clearance at our border, we recommend you tell them:\nIf you do not tell them, you might be granted the subclass 444 visa. Grant of a subclass 444 visa might affect your eligibility for Australian citizenship.\nTo prove you have a visa and show your conditions to someone, use VEVO.\nRequest your international movement records to get proof of your travel in and out of Australia.\nWith this visa you become a permanent resident. This means you can work and study. You are protected by Australian workplace law. See your workplace rights and entitlements.\nAs an Australian permanent resident, you might be able to sponsor eligible family members to come to Australia.\nTo find a visa for your family member, explore visa options.\nAfter a certain time, you might be eligible for Australian citizenship. Find out more about becoming a citizen.\nFor citizenship purposes, your permanent residency starts on the day you entered Australia on this visa.\nCheck your travel documents\nYou must have:\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nTo prove you have been to Australia, request your international movement records by completing request for international movement records."
}