{
    "visaID": "visa6.10",
    "visaType": "visa6",
    "visaName": "Special Category visa (subclass 444)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-category-visa-subclass-444",
    "content": "\n1. Subclass 444\n2. Special Category visa (SCV)\nFrom the time you are granted the visa until you leave Australia, unless it ceases because of other reasons. These may include if we grant you a permanent visa, you become an Australian citizen, or we cancel the visa. When you leave Australia your visa will cease. You must apply for a new SCV if you want to enter Australia again.\nIf you apply on arrival in Australia, your application will be processed at the airport or seaport.\nIf you apply inside Australia, your application may take longer to process depending upon your individual circumstances.\nSee all conditions\n3. With this visa you can\n4. How long you can stay\nThe visa starts on the date we grant you the visa.\nThe visa ceases on the date you leave Australia, unless it ceases because of other reasons. These may include if we grant you a permanent visa, you become an Australian citizen, or we cancel the visa. When you leave Australia your visa will cease. You must apply for a new SCV if you want to enter Australia again.\n5. Include family\nEach family member needs to make their own SCV application. They can do this by showing a valid New Zealand passport and completed incoming passenger card to an officer. They can also answer the health and character questions on SmartGate.\nIf family members are not New Zealand citizens, they need to apply for another visa.\n6. Cost\nThere is no application charge for this visa.\n7. Apply\nYou usually apply for this visa when you enter Australia.\nIn some cases, you may be able to apply for this visa after you have entered Australia. This might be the case if you:\nIn these cases you can apply by completing our online form. If we grant you the SCV after you have entered Australia the grant date will be the date of the decision. We can't backdate it to your original entry date.\nIf you had a child born in Australia to an SCV holding parent on or before 30 June 2022, ensure that the child has been registered as a New Zealand Citizen and has received a New Zealand citizenship certificate and/or a New Zealand passport. For further information see New Zealand citizenship.\nOnce you receive the New Zealand citizenship certificate and/or passport you can submit an onshore SCV application via the Onshore visa application form.\nIf you had a child born to an SCV holding parent on or after 1 July 2022 your child may have acquired Australian citizenship automatically by operation of law at the time of their birth. Children who meet these circumstances can apply for their proof of citizenship.\nFor further information see You had a baby.\nBefore submitting an application check if you already hold a visa or get a copy of it by using VEVO. To access VEVO you will need a reference number.\n8. Your obligations\nYou must remain a New Zealand citizen while you hold this visa. If your citizenship status changes, and you are no longer a New Zealand citizen, your SCV will cease. To remain lawful you must apply for and we must grant you a different visa.\nYou must obey Australian laws while you remain in Australia.\nAll visa holders must continue to meet the character requirements. If you don't, we may cancel your visa.\n9. Health insurance\nWe recommend you take out health insurance to cover any unforeseen medical treatment you might need in Australia. You may be liable for your own healthcare costs while you are in Australia. Insurance can help limit your financial liability.\nSee what we consider adequate health insurance.\nLearn more about health insurance for overseas visitors.\nLearn more about Medicare for New Zealand citizens.\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements.\n10. Travel\nYou can't travel outside Australia and return on this visa. If you leave Australia the visa will cease. If you return to Australia you must apply for a new SCV when you return.\n11. Travelling as a permanent visa holder\nWe may manually process your entry into Australia. If you hold a permanent visa (with a valid travel facility), you need to tell us that you do not want an SCV. If you do not tell us, we may grant you the SCV. This may later affect your eligibility for a Resident Return visa.\nMore information is in overseas travel as a permanent resident.\n12. Eligible New Zealand citizen (or Protected SCV holder)\nSee Eligible New Zealand citizen (or Protected SCV holder) under Entitlements\nMore information is in overseas travel as a permanent resident.\n13. Visa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nIf we assess you are a behaviour concern non-citizen (BCNC), we may refuse to grant you an SCV. We may refuse your entry into Australia.\nYou could be assessed as a BCNC if you have been:\nNote: Sentenced to imprisonment includes ordered to be confined in a corrective institution.\nIf you have concerns about your eligibility for the SCV, you can check by using our online webform before you travel: Enquiry Form – New Zealand passport holders travelling with a criminal conviction.\nWe may assess you as a health concern non-citizen if you declare when you enter Australia that you have tuberculosis (TB).\nIf you declare that you have TB we will ask you to give us more information.\nYou can't apply for this visa if you currently hold a visa that has a 'no further stay' condition.\nIf you had a child born in Australia to an SCV holding parent on or after 1 July 2022 your child may have acquired Australian citizenship automatically by operation of law at the time of their birth. Children who meet these circumstances can apply for their proof of citizenship. They do not need to apply for an SCV first.\nEnsure you have a valid New Zealand passport before you travel to Australia.\nYou can't apply for this visa on your entry to Australia if you already hold another temporary visa. If you already hold a temporary visa you can apply for an SCV after you have entered Australia.\nYou can't apply for this visa if you currently hold a pemanent visa or a visa that has a 'no further stay' condition.\nBefore submitting an onshore SCV visa application check if you already hold a visa by using VEVO. To access VEVO, you will need a reference number.\nPlease see the Stay lawful section below for Bridging visa information.\nYou must have a valid New Zealand passport to be granted this visa.\nYour visa will be linked to the passport number in your application. If you plan to get a new passport, do so before you apply.\nIf you are applying for the SCV on or after your entry into Australia you will need your valid New Zealand passport with you.\nIf you were born in Australia on or before 30 June 2022 and have not departed you will need to provide a copy of your Australian Birth Certificate with your onshore SCV application.\nYou will also need to provide evidence of your New Zealand citizenship. You may need to be registered as a New Zealand citizen first. For further information see New Zealand citizenship.\nProvide accurate information.\nHave all non-English documents translated into English.\nProvide original and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nNote: You don't need to have any documents certified unless we ask you to.\nWhen you enter Australia show your completed incoming passenger card with your valid New Zealand passport to an officer. You can also answer the health and character questions on SmartGate.\nIf applying after you have entered Australia, you will need to apply online.\nProvide accurate information.\nApply online to request an SCV appointment. Once your information has been received by the Department, you will be contacted with a date and time for your appointment. The Department may also contact you about any additional documentation that you may need to submit.\nWe will usually process your visa application at the airport or seaport that you use to enter Australia.\nIf you apply after you have entered Australia, a decision may take longer.\nFor applications made after you have entered Australia, we will contact you with a date and time for your appointment.\nWe can't give updates on applications. Wait for us to contact you.\nIf you apply for this visa after you have entered Australia, make sure you stay lawful. You can do this by holding a valid visa while we process your application.\nIf your current visa will expire before we decide your application, consider applying for a Bridging visa.\nIf we cancel your current visa or it ceases, and you do not hold a Bridging visa, you:\nLearn more about visa expiry.\nThings you may need to let us know about after you have applied include:\nSee how to tell us if your situation changes.\nWe will tell you if we have granted your visa. How we tell you will depend on how and where you applied.\nIf you meet all visa and immigration requirements, you will be:\nWe will add your visa electronically to your passport.\nYou can check your visa status, conditions and expiry or get a copy of it in VEVO. To access VEVO, you will need a reference number.\nWe will let you know our decision about your visa application in writing. We will link your visa to the New Zealand passport number in your application and tell you:\nKeep a copy of the decision for your records.\nIf we refuse your visa we will let you know in writing. We will tell you:\nThings you may need to let us know about include:\nIf you had a child born in Australia to an SCV holding parent on or after 1 July 2022 your child may have acquired Australian citizenship automatically by operation of law at the time of their birth. Children who meet these circumstances can apply for their proof of citizenship.\nSee how to let us know if there is a change in your situation.\nCheck your visa status, conditions and expiry in VEVO.\nTo prove you have a visa, show your visa conditions to someone, or get a copy of it, use VEVO. To access VEVO, you will need a reference number.\nAs an SCV holder you have the right to work in Australia. To confirm your permission to work, use VEVO.\nAs you have permission to work on the SCV, you have the protection of Australia's workplace law. You must follow these laws. See your workplace rights and entitlements.\nYou must have a valid passport or other travel document to leave Australia.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nIf you worked in Australia you may have some money in a superannuation fund.\nSee how to access your super.\nTo prove you have been to Australia, ask for your international movement records."
}