{
    "visaID": "visa4.20.1",
    "visaType": "visa4.20",
    "visaName": "Government Agreement stream",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-work-403/government-agreement",
    "content": "\n1. Temporary work (International relations) visa (subclass 403)\n2. Government Agreement stream\nYou can stay until the time we specify in your visa grant notice. This may be up to 4 years.\nFrom AUD365.00\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nSee all conditions\nIf you need help with your visa read information on Who can help with your visa application.\n3. With this visa, you can\n4. How long you can stay\nThis is a temporary visa. You can stay for the time we specify in your visa grant notice. This may be up to 4 years unless the Australian signatory has asked for a shorter period.\nThe visa starts:\n5. Stay longer\nYou can't stay in Australia longer by extending this visa. You may apply for a further subclass 403 visa under the Government Agreement stream, if you meet the requirements.\n6. Include family\nYou can include members of the family unit in your application when you apply if allowed under the agreement, and specified in the letter of support from the Australian signatory.\nFamily members who apply for the visa must meet our health and character requirements.\n7. Cost\nThe visa costs AUD365.00 for the main applicant.\nThere is also a fee for each family member who applies for the visa with you.\nYou may also have to pay other costs for:\nTo work out what your visa will cost use the Visa Pricing Estimator. The estimator does not take into account the other costs.\n8. Apply from\nYou can be in or outside Australia when you apply for the visa and when we decide on your application.\n9. Processing times\nTo find out about processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application can take longer to process if:\nWe can't process your application if you do not pay the correct visa application charge. We will tell you if this is the case and invalidate your application.\n10. Your obligations\nIf granted a visa, you and your family must comply with all visa conditions and Australian laws.\nLearn more about conditions for this visa.\n11. Travel\nYou can travel outside Australia and return as many times as you want while the visa is valid.\nThe time you spend outside Australia does not extend the visa.\n12. Visa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nYou must:\nYour employment or activity in Australia must benefit Australia.\nYour stay must have the support of both the Australian signatory and the foreign signatory to the bilateral agreement you intend to work under. You don't need a sponsor.\nWhile you are in Australia, you must have the financial capacity to support yourself and any dependent family members who come with you.\nIf you are applying in Australia, you must hold, or in the last 28 days have held, a temporary substantive visa.\nThe temporary substantive visa you hold or held can't have been:\nYou and your family members, who apply for this visa with you, must meet our health requirement.\nYou and family members aged 16 years and over who apply for the visa with you must meet our character requirement.\nYou and your accompanying family are personally liable for all your healthcare costs while you are in Australia. Medical insurance helps limit your financial liability.\nYou must have adequate health insurance for the whole of your stay to be granted this visa. Your health insurance should cover you for medically necessary treatment, including transport.\nLearn more about health insurance for overseas visitors.\nSee more about health insurance for overseas visitors.\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements.\nYou must only intend to:\nIf you owe the Australian Government money, you must have paid it back or have a formal arrangement to pay it back.\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused see Limitations on applications in Australia.\nIf applying for a visa from outside Australia see Can I go to Australia.\nIf you want immigration assistance, see Who can help with your visa application.\nIf you need help with your application, get someone to act on your behalf.\nYou might need to have health examinations. You can complete them before you apply or you can wait until after you apply.\nFind out the examinations you need and how to arrange them if you want to have them before you apply.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nGather documents to prove your identity and show you have your employer's support, financial support and health insurance. You will need to prepare them to submit online.\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nProvide the pages of your current passport showing your photo, personal details and passport issue and expiry dates.\nAlso provide:\nDocuments that prove a change of name include:\nGive us a letter of support from the Australian signatory to the bilateral agreement. The letter of support must show:\nIf required under the agreement, we may ask you to give us evidence that your employment complies with Australian workplace relation laws.\nIf the foreign signatory is not the national government of the relevant foreign country, we may ask you to give us evidence that the national government of that country does not oppose your stay in Australia.\nWe also need copies of your:\nProvide:\nLearn more about police certificates.\nTo nominate someone to:\nUpload your written notification or your forms to ImmiAccount.\nIf you have listed your spouse/partner on your visa application you will need to provide the following:\nProvide either:\nDocuments that prove your de facto relationship include:\nFor every dependent under 18 years old who is applying with you, provide:\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\nThey must complete either:\nAlternatively, you can show us:\nInclude:\nFor every dependant 18 years old or older who is applying with you, and is not your partner or spouse provide:\nYou need to prove that this person is dependent on you. Provide:\nYou must also prove this person has been financially dependent on you for at least 12 months before you apply. You could provide:\nHave all non-English documents translated into English.\nProvide original and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nNote: You do not need to have any documents certified.\nScan or photograph all documents (English and non-English) in colour.\nThe scans and photos must be clear.\nIf a document is more than one page, save it all as one file.\nYou must apply for this visa online. You can be in or outside Australia, but not in immigration clearance, when you apply.\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nWe will not process your application until you pay the charge.\nEach family member must have their application charge paid and documents attached to their application.\nSee what you can and must do after you apply.\nWe will let you know when we have received your application and documents.\nWe can’t give updates on applications within the standard processing time.\nYou can check if we need more information from your ImmiAccount.\nIf you are in Australia, you don't have to tell us if you want to travel outside Australia while we process your application. This is because you can be outside Australia when we make a decision.\nBut if you leave Australia, make sure you have a valid visa to return.\nLearn about visa expiry.\nIf you didn't have health examinations before you applied, we will let you know if you need them. Check ImmiAccount.\nWe might ask for biometrics (fingerprints and photo). We will let you know if you need to provide them.\nIf you did not attach all documents when you applied, attach them as soon as possible in ImmiAccount.\nWe might also ask you to provide more information.\nIf you are in Australia, make sure you stay lawful by holding a valid visa while we process your application.\nIf you applied for this visa in Australia and your application was assessed as valid, you were granted a bridging visa. If your current visa expires before we decide on your application, the bridging visa will start. You can stay in Australia on the bridging visa while we process your new visa application.\nLearn more about visa expiry.\nYou can include members of the family unit in your application at any time before we decide on your application.\nIf you do not include them in your visa application, your family members must apply separately.\nTo apply separately your family members will need to complete an application for a Temporary Activity, International Relations or Training Visa (Subsequent entrant) (403,407,408) form in ImmiAccount.\nLet us know as soon as you can if you made a mistake on your application.\nComplete Form 1023 Notification of incorrect answers (168KB PDF) and attach it in ImmiAccount.\nLet us know if you no longer want someone to:\nUpload your written notification or your forms to ImmiAccount.\nFor more information see Who can help you with your application.\nThings you need to let us know about after you have applied include:\nSee how to tell us if your situation changes.\nWe will let you know our decision in writing.\nIf we grant your visa, we will tell you:\nKeep a copy of the decision with you when in Australia.\nIf we refuse your visa, we will tell you:\nWe will not refund the application charge if we refuse your application.\nYou must have:\nAll people arriving Australia must complete the Incoming Passenger Card. You will be given this card onboard.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nTo see your specific conditions and work entitlements use VEVO.\nYou and your family members must meet all visa conditions and obey Australian laws.\nSee your conditions in VEVO.\nLearn more about visa conditions and how they work.\nThings you need to let us know about include:\nSee how to tell us if there is a change in your situation.\nTo see when you must leave, use VEVO.\nYou can't stay in Australia longer by extending this visa. You must apply for a new visa if you want to stay longer.\nYou can travel outside Australia and return as many times as you want while the visa is valid.\nTime spent outside Australia does not extend the visa.\nSee your conditions in VEVO.\nTo prove you have a visa and show your conditions to someone, use VEVO.\nTo see your conditions for work, use VEVO.\nIf you have permission to work, you are protected by Australian workplace law. See your workplace rights and entitlements.\nYou can apply for a subsequent entrant visa for your family member.\nYour family member might be able to apply for a Temporary Activity, International Relations or Training Visa (Subsequent entrant) (403,407,408) in ImmiAccount.\nYou must have a valid passport or other travel document to leave Australia.\nEnsure your visa is still valid.\nSee what to do if your visa has expired or is about to expire.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nYou are likely to have some money in a superannuation fund if you worked in Australia and you are:\nSee how to access your super.\nTo get proof of your travel in and out of Australia request your international movement records."
}