{
    "visaID": "visa4.7.1",
    "visaType": "visa4.7",
    "visaName": "Regional provisional stream",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/skilled-regional-191/regional-provisional",
    "content": "\n1. Permanent Residence (Skilled Regional) visa (subclass 191)\n2. Regional Provisional stream\nPermanently\nFrom AUD490.00\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nWe assess applications on a case-by-case basis. Actual processing times can vary due to individual circumstances. These include:\nSee all conditions\nApply\n3. With this visa you can\nNewly arrived residents may have to wait before they can access certain Australian Government payments and benefits.\n4. How long you can stay\nThis is a permanent visa. It lets you stay in Australia indefinitely.\nThe visa has a travel component that expires 5 years after the date of visa grant. If you wish to travel after this date, you must apply for a Resident Return visa.\nFor citizenship purposes, your permanent residence starts on the day we grant the visa if you are in Australia.\n5. Include family\nYou can include members of the family unit in your application. You can:\nGenerally, family members included in your application do not need an eligible visa. Family members must hold an eligible visa if:\nTheir eligible visa must have been granted on the basis that they were a member of your family unit. This provision applies, for example, if you want to include a child in your application who has turned 23 years of age since getting an eligible visa.\nFamily members included in your application must meet health and character requirements. Family members not coming to Australia may also need to meet health and character requirements.\nIf you have a child who was born in Australia since you were granted your current visa you must tell us about your child before you lodge this application. Find out what to do if your child is born after we granted your current visa. If we have not linked your child’s current visa to their passport you will be unable to lodge their application online.\n6. Cost\nThe visa costs AUD490.00 for the main applicant.\nThe visa costs AUD245.00 for each additional applicant who is at least 18.\nThe visa costs AUD125.00 for each additional applicant who is less than 18.\nYou might also have to pay other costs for health checks, police certificates and biometrics.\n7. Apply from\nYou can be in or outside Australia when you apply for the visa and when we decide on your application. You cannot be in immigration clearance.\n8. Processing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nWe assess applications on a case-by-case basis. Actual processing times can vary due to individual circumstances including:\nYou must hold an eligible visa when you apply. You must have held that visa for at least 3 years before you apply.\nAn eligible visa is a subclass 491 or subclass 494 visa.\nThere is no minimum income requirement.\nYou must provide notices of assessment issued by the Australian Taxation Office (ATO) for three income years out of the five years of your eligible visa.\nYou must have complied with the conditions of your eligible visa when in Australia. This requirement applies for the whole period you hold the visa(s).\nYou must meet our health requirement. This also applies for any family members who apply for the visa with you. Family members not coming to Australia may also need to meet the health requirement.\nYou must meet our character requirement. This also applies for family members aged 16 years and over who apply for the visa with you.\nOther family members not coming to Australia also need to meet the character requirement.\nIf you are 16 years of age or older, you must:\nsign an Australian Values Statement. This confirms you will respect the Australian way of life and obey Australian laws.\nIf you or any family members owe the Australian Government money, you or they must pay it back. They can also make an arrangement to pay it back. This includes those who do not apply for the visa with you.\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused see Limitations on applications in Australia (129KB PDF).\nIf applying for a visa from outside Australia see Can I go to Australia.\nIf you want immigration assistance, see Who can help with your visa application.\nBefore applying you must gather and prepare your documents.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nYou and your all family members must have valid passports or travel documents to be able to submit an application for this visa.\nYou will need to provide identity, character and other documents that show you have complied with your visa conditions in Australia. You will also need to provide documents for your partner and any dependent children.\nProvide accurate information. See what happens if you can't prove your identity or do not provide true information.\nYou must provide proof that, as the holder of your eligible visa, you lived, worked and studied in a designated area of Australia.\nProof of residence can include but is not limited to:\nProof of work can include but is not limited to:\nProof of study can include but is not limited to:\nThere is no minimum income requirement.\nYou must provide notices of assessment issued by the Australian Taxation Office (ATO) for three income years out of the five years of your eligible visa.\nProvide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\nAlso provide:\nDocuments that prove a change of name include:\nIf you are or have been married, widowed, divorced or permanently separated, provide proof such as marriage certificates, divorce documents, death certificates, separation documents or statutory declarations.\nIf your partner or dependent children are not included in this application, tell us the reason why (for example, they already hold Australian citizenship or are a permanent resident).\nProvide an Australian police certificate if you have spent a total of 12 months or more in Australia in the last 10 years since you turned 16.\nWe only accept complete disclosure National Police Certificates issued by the Australian Federal Police. We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police.\nFor immigration purposes, Australian police certificates are valid for 12 months from the date of issue.\nAlso provide:\nComplete and provide the following forms:\nWe need to see evidence of your partner's identity and relationship with you.\nProvide:\nFor de facto relationships, provide either:\nFor both married and de facto applicants you must provide evidence that you are in a genuine and continuing relationship. Evidence can include but is not limited to:\nFor every dependant 18 years old or younger who is applying with you, provide:\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\nThey must complete either:\nAlternatively, you can show us:\nInclude:\nTo include your child who is over 18 in your visa application, they must hold an eligible visa that was granted on the basis that they were a member of your family unit.\nProvide:\nTo nominate someone to:\nUpload your written notification or your forms to ImmiAccount.\nHave all non-English documents translated into English.\nProvide original and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited but on each translation, they must include their:\nThese details must be in English.\nScan or photograph all documents (English and non-English) in colour.\nThe scans and photos must be clear.\nNote: You do not need to have any documents certified\nIf a document is more than 1 page, save it all as 1 file.\nYou can apply for this visa online. You can be inside or outside Australia when you apply.\nProvide accurate information. See what happens if you can't prove your identity or do not provide true information.\nApply for this visa online in ImmiAccount\nWe will let you know when we have received your application.\nIf you are granted a bridging visa you will receive notification of your visa grant.\nWe do not give updates on applications under assessment.\nYou can check if we need more information from you in ImmiAccount.\nYou don't have to tell us if you want to travel outside Australia while we process your application.\nIf you leave Australia, make sure you have a valid visa to return. To see if you can return on your current visa, check VEVO.\nLearn about visa expiry.\nWe will let you know if you need health examinations.\nWe might ask for biometrics (fingerprints and photo). We will let you know if you need to provide them.\nIf you did not attach all documents when you applied, attach them as soon as you can in ImmiAccount.\nWe might also ask you to provide more information; however we are not obliged to do so and we may make a decision on your application without asking for more documents.\nYou can apply for this visa in or out of Australia.\nIf you apply for the visa in Australia, make sure you stay lawful by holding a valid visa while we process your application.\nIf you apply for the visa in Australia, you may be granted a bridging visa (BV). If your current visa expires before we decide on your application, the BV will come into effect. You can stay in Australia on the BV while we process your new visa application.\nDo not ask to have the visa you currently hold cancelled. If your visa is cancelled:\nLearn more about visa expiry.\nYou can add members of the family unit to your application after you apply but before we decide on your visa.\nComplete Form 1436 - Adding an additional applicant after lodgement (481KB PDF), pay using ImmiAccount, attach the form and supporting documents to your ImmiAccount.\nFamily members who apply for the visa must meet our health and character requirements.\nFamily members who are not coming to Australia do have to meet our character requirement and might have to meet our health requirement.\nIf your child is born after you submit your application but before we decide on your visa, you must tell us as soon as possible.\nFind out what to do if your child is born after you apply.\nYou must tell us as soon as possible if you made a mistake on your application.\nComplete Form 1023 Notification of incorrect answers (168KB PDF) and attach it in ImmiAccount.\nLet us know if you no longer want someone to:\nUpload your written notification or your forms to ImmiAccount.\nFor more information see Who can help you with your application.\nThings you need to let us know about after you have applied include:\nSee how to tell us if your situation changes.\nYou can be inside or outside Australia when we decide your visa application. We will let you know our decision in writing.\nIf we grant your visa, we will tell you:\nKeep a copy of the decision.\nIf we refuse your visa, we will tell you:\nWe will not refund the application charge if we refuse your application.\nWhen you have this visa you can:\nYou and your family members must obey Australian laws.\nThis is a permanent visa. It lets you stay in Australia indefinitely.\nYou can travel to and from Australia for 5 years from the date we grant the visa. After the initial 5 years, to re-enter Australia as a permanent resident you will need a Resident Return (RRV) visa (subclass 155 or 157).\nTo see when the 5 years ends, use check your visa details with VEVO.\nIf an immigration officer processes your clearance at our border, we recommend you tell them:\nIf you don't tell them, you might be granted a subclass 444 visa. Grant of a subclass 444 visa will cease your permanent visa, which will then affect your eligibility for Australian citizenship.\nTo prove you have a visa and show your conditions to someone, use VEVO.\nYou are protected by Australian workplace law. See your workplace rights and entitlements.\nAs an Australian permanent resident, you might be able to sponsor eligible family to come to Australia.\nTo find a visa for your family member, explore visa options.\nAfter a certain amount of time, you might be eligible for Australian citizenship. Find out more about becoming a citizen.\nFor citizenship purposes, your permanent residence starts on the day we granted the visa.\nYou must have a valid passport or other travel document to leave Australia and return.\nCheck the travel component of your visa in VEVO.\nSee what to do if your visa has expired or is about to expire.\nWe have an automated process that uses facial recognition technology and your ePassport. You could leave the airport faster if you use SmartGate.\nTo get proof of your travel in and out of Australia, you can request a copy of your international movement records."
}