{
    "visaID": "visa4.2.3",
    "visaType": "visa4.2",
    "visaName": "Significant Investor stream",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/business-innovation-and-investment-188/significant-investor-stream",
    "content": "\n1. Business Innovation and Investment (Provisional) visa (subclass 188)\n2. Significant Investor stream\nUp to 5 years\nFrom AUD14,240.00\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nSee all conditions\nIf you are getting help with your visa, before you pay someone, read information on Who can help with your visa application.\n3. With this visa, you can\n4. How long you can stay\nThis is a provisional visa. You can stay in Australia for up to 5 years if you were invited to apply on or after 1 July 2021.\nIf you applied after 1 July 2015, and were invited to apply for this visa before 1 July 2021, you can stay in Australia for up to 4 years and 3 months.\nIf you applied for this visa  before 1 July 2015, you can stay in Australia for 4 years.\nThe visa is granted with multiple entries. You can leave and re-enter Australia as many times as you want while the visa is valid.\nThe visa starts on the date it is granted.\n5. Stay longer\nThis is a provisional visa. You must apply for a new visa if you want to stay longer.\nOnce you have this visa, you can apply for permanent residence through the Business Innovation and Investment (Permanent) visa (subclass 888) in the Significant Investor stream, if you meet certain requirements. Explore your visa options.\nIf you need more time to apply for permanent residence, you can apply for a new Business Innovation and Investment (Provisional) visa (subclass 188) in the Significant Investor Extension stream.\nIf granted, you will be able to travel to, enter and remain in Australia for up to 7 years after the date of the grant of the original  Business Innovation and Investment (Provisional) visa (subclass 188) in the Significant Investor Extension stream.\nYou can also apply for a second Significant Investor Extension stream visa. If granted, you will be able to travel to, enter and remain in Australia for up to 9 years after the date of the grant of the original Business Innovation and Investment(Provisional) visa (subclass 188) in the Significant Investor Extention stream.\n6. Include family\nYou can add your dependent child or children to your application at any time before we decide on your application. They will need to meet our health and character (if applicable) requirements.\nThe spouse or de facto partner of the main applicant who did not make a combined application at the initial lodgement of the subclass 188 visa, can make a subsequent entrant application. A subclass 188 visa can only be granted to a subsequent entrant after the main applicant’s subclass 188 visa is granted.\nComplete the online 'Application for a Business Innovation and Investment (Subsequent Entrant) Visa' application form in ImmiAccount. An application charge is applicable.\nIn order for the main applicant to be granted the visa, family members who are not coming to Australia must meet our character requirements, and might have to meet our health requirements.\n7. Cost\nThis visa costs AUD14,240.00 for the main applicant.\nThere is also a charge for each family member who applies for the visa with you.\nAny applicant who was at least 18 years old at the time of application, and is assessed as not having functional English , and has not paid a second instalment of the visa application charge in relation to their application for a Business Innovation and Investment (Provisional) (subclass 188) visa will have to pay this extra charge. Pay it only when we ask you to. We will refund the charge if we do not grant the visa to that applicant.\nThe second instalment charges are:\nUse the Visa pricing estimator to work out what your visa will cost. The estimator does not take into account the second instalment or other costs. You might also have to pay other costs for health checks, police certificates and biometrics.\n8. Apply from\nYou can be in or outside Australia when you apply for the visa and when we decide on your application, but not in immigration clearance.\n9. Processing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application might take longer to process if:\nWe can't process your application if you do not pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\n10. Your obligations\nYou and your family members who are part of your application must comply with all visa conditions and Australian laws.\nLearn more about conditions for this visa\nWhile the holder of this visa, you must have a genuine and realistic commitment to:\nYou must also maintain your investment for the whole of the visa period and comply with Australian workplace laws.\nTo be eligible for the grant of a Business Innovation and Investment (Permanent) visa (subclass 888) in the Significant Investor stream, you must also live in Australia for at least 40 days per year for the duration of your provisional visa. Or your spouse or de facto partner must live in Australia for at least 180 days per year for the duration of your provisional visa. These days do not need to be consecutive.\nYou must make a complying significant investment of at least AUD5 million. You must hold complying significant investments continuously for the life of your provisional visa.\nYou can switch between complying significant investments if:\nIf you reinvest funds into a complying significant investment within 30 days, we count that as holding them continuously.\nIf you withdraw funds from venture capital or emerging company investments, you must reinvest the funds into venture capital or emerging companies.\nIf you withdraw funds from the 'balancing investment' category of investments, you can reinvest them into another balancing investment, venture capital or emerging companies.\nIf you withdraw funds from venture capital because the venture capital investment has been realised, you must reinvest those funds. You can reinvest them in any eligible complying significant investment.\nIncome that you earn from your complying significant investment in Australia may be subject to tax under Australian taxation law.\nNote that the investment rules that were in force at the time that you applied for your Business Innovation and Investment (Provisional) visa (subclass 188) in the Significant Investor stream will continue to apply for the duration of your visa. This includes any Business Innovation and Investment (Provisional) visa (subclass 188) in the Significant Investor Extension stream visas you apply for that relate to your visa.\nYou might want to seek independent legal advice to ensure that an investment is a ‘complying significant investment’. It is your responsibility to ensure your investment options comply with this visa's requirements.\nFor more information about complying significant investments, see the Complying Investment Framework information sheet, and for the 1 July 2021 changes see Business Innovation and Investment Program: Getting a better deal for Australia.\nAll workers in Australia (including visa holders) have rights and protections at work. Pay rates and workplace conditions are set by Australian law.\nIf you operate a business in Australia, you must comply with workplace laws. The Pay and Conditions Tool (PACT) can help you with:\n11. Adequate health insurance\nWe recommend you take out health insurance to cover any unforeseen medical treatment you might need in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability.\nSee what we consider adequate health insurance.\nLearn more about health insurance for overseas visitors.\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements.\n12. Travel\nYou can travel outside Australia and return as many times as you want while the visa is valid.\nThe time you spend outside Australia does not extend the visa.\n13. Visa label\nAustralian visas are digital.\nWe do not put a visa label in your passport. Instead, we link your digital visa record to your passport.\nFirst, you must submit an Expression of Interest (EOI). If an Australian State or Territory government agency accepts your EOI and nominates you, we will invite you to apply for this visa.\nYou must be nominated by an Australian State or Territory government agency or Austrade before being invited to apply for this visa.\nThe State or Territory government agency or Austrade that nominates you must not withdraw their nomination after you apply, or we will be unable to grant you a visa.\nIf you were invited to apply on or after 1 July 2021, you must make (on or after the time of application for this visa), a complying significant investment of at least AUD5 million when we invite you to, and have a genuine intention to hold that investment for the life of your provisional visa. It must be invested in the following proportions:\nThe managed funds can invest in a range of assets, including companies listed on the Australian stock exchange, Australian corporate bonds or notes, annuities and commercial real estate.\nDirect investment in residential real estate is prohibited. Indirect investment in residential property through managed funds is strictly limited.\nYou must not use investments as security or collateral for a loan.\nFor more information about complying significant investments, see the Complying Investment Framework information sheet, and for the 1 July 2021 changes see Business Innovation and Investment Program: Getting a better deal for Australia.\nTo be granted this visa, you must make (on or after the time of application for this visa), a complying significant investment of at least AUD5 million when we invite you to, and have a genuine intention to hold that investment for at least 4 years. It must be invested in the following proportions:\nThe managed funds can invest in a range of assets, including companies listed on the Australian stock exchange, Australian corporate bonds or notes, annuities and commercial real estate.\nDirect investment in residential real estate is prohibited. Indirect investment in residential property through managed funds is strictly limited.\nYou must not use investments as security or collateral for a loan.\nFor more information about complying significant investments, see the Complying Investment Framework information sheet, and for the 1 July 2021 changes see Business Innovation and Investment Program: Getting a better deal for Australia.\nYou and your partner must have had no history of involvement in business or investment activities that are of a nature that is not generally acceptable in Australia.\nAll applicants aged 18 or over at the time of application must either have at least functional English or you will be asked to pay the second instalment of the visa application charge.\nYou and any family members who apply for the visa with you must meet our health requirement.\nFamily members who are not coming to Australia might also have to meet our health requirement.\nYou and family members aged 16 years or over who apply for the visa with you must meet our character requirement.\nFamily members who have not applied for this visa must also meet the character requirement.\nIf you and your family members who have applied for this visa are 18 years of age or older at the time of application, you and your family members must:\nIf you or any family members owe the Australian Government money, you or they must have paid it back or have an approved arrangement in place to pay it back\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused see Limitations on applications in Australia (129KB PDF).\nIf applying for a visa from outside Australia see Can I go to Australia.\nIf you want immigration assistance, see Who can help with your visa application.\nYou must submit an Expression of Interest (EOI), be nominated by a State or Territory government agency, or Austrade and then be invited to apply.\nIf you need help with your EOI you can use a registered migration agent or legal practitioner. For information on how to find someone to help you see Who can help you with your application.\nYou must submit an expression of interest (EOI) to let us know you want to apply for this visa.\nYour EOI tells us about your skills, qualifications and investment experience. It lets us know which states and territories you would like to invest in. If you are eligible and a State or Territory government agency or Austrade nominates you, we might then invite you to apply for the visa.\nCheck that you meet all other eligibility criteria for the visa.\nEach nominator will assess your EOI using their own criteria. Learn more:\nIf you receive an invitation to apply for the visa after you submit your EOI, you will need to provide documents that:\nYou should have all these documents before you submit your EOI.\nSubmit your EOI via SkillSelect.\nYou can submit it from within or outside Australia.\nYour EOI is not a visa application. There is no charge for submitting an EOI.\nSelect the Business Innovation and Investment (Provisional) visa (subclass 188).\nYou will receive an email confirming your EOI has been submitted.\nIf you are nominated by an Australian State or Territory government agency or Austrade, we may invite you to apply for this visa.\nAn EOI is not a visa application. Submitting an EOI does not mean you will get a Bridging visa.\nIf your current visa will expire before you lodge your subclass 188 visa application, you must apply for another visa to remain in Australia lawfully.\nYou can change your EOI in  SkillSelect if:\nYou can't make changes to your EOI after you have received an invitation.\nYou could receive an invitation any time within 2 years of submitting your EOI. If you are invited to apply for the visa, you will receive an email from SkillSelect. Receiving an invitation does not mean you will be granted the visa.\nIf you are invited, you have 60 calendar days to apply for the visa. This time will not be extended.\nYou must demonstrate that you satisfy all eligibility criteria. If you can't meet the eligibility criteria, we will not grant you the visa.\nIf you do not apply for the visa after two invitations, your EOI will be removed from SkillSelect.\nIf you can't show that you can meet all other eligibility criteria, you should not apply for the visa at this time. If you want to update your EOI you can do that after the 60-day invitation period.\nIf this is your first invitation, you might be sent a second invitation after the 60-day invitation period.\nIf this is your second invitation, you will have to submit another EOI if you still want the visa.\nNew step summary\nYou can change your EOI in SkillSelect if:\nYou can't make changes to your EOI after you have received an invitation.\nIf you are not invited to apply within 2 years of submitting your EOI, your EOI will expire. We will send you an email when your EOI is about to expire.\nYou will need to submit a new EOI if you still want the visa.\nYou and your family members who are applying for this visa will need valid passports. If you plan to get a new passport, do this before applying.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nYou will need to prove your identity, and provide documents about your proposed investment. You also need to provide documents about family members applying with you.\nApplying from China, Macau, Hong Kong or Taiwan\nIf you are applying from the People’s Republic of China, Macau (SAR), Hong Kong (SAR) or Taiwan use the document checklist from the Australian Consulate General Hong Kong.\nYou are obliged to prove your identity and provide true information with your application. See what happens if you can't prove your identity or do not provide true information.\nYou and family members who apply for the visa with you, must provide:\nColour copies of the pages of your current passport showing photo, personal details, and passport issue and expiry dates.\nAlso provide:\nDocuments that prove a change of name include:\nProvide:\nForm 1139A Statement of Assets and Liabilities Position (SALP) (143KB PDF) for a date less than 3 months before we invited you to apply for this visa.  Indicate on the form which of these assets you intend to use to fund your AUD 5 million complying significant investment.\nEvidence to support the ownership of all assets and liabilities and their values on the dates of each SALP.  This may include:\nIf you want to include assets held by a trust, you must include a complete copy of the trust deed including all schedules.\nProvide a list of your intended complying significant investments and the amounts of each investment.  Note that you must not make your complying significant investment until after you lodge your application and we invite you to make the investment.\nYou need to provide your asset portfolio's source of funds\nYou need to provide a signed declaration listing the sources of funds for your asset portfolio, and that these funds were lawfully acquired.\nAlso give us evidence to support your source of funds declaration:\nWe will tell you when you need to make the complying investments and when we need this evidence. You must make the complying investment after you have applied for the visa.\nYou will need to show that the funds used to make the complying investments originate from the assets nominated to make the complying investments. The trail of funds must also be reasonably established with supporting evidence\nProvide proof that you have at least functional English.\nAll applicants (18 years or older at time of applying for this visa) who can't provide evidence of having at least functional English must pay a second instalment of the visa application charge.\nIf you or your dependants have less than functional English, provide a statement indicating your intention to pay the second visa application charge for each person with less than functional English.\nWe will advise you when to pay this.\nYou do not need to provide health documents. The doctor will send them to us.\nYou and family members aged 16 years and over who apply for the visa with you, provide:\nTo nominate someone to:\nUpload your written notification or your forms to ImmiAccount.\nProvide your partner's:\nProvide either:\nDocuments that prove your de facto relationship include:\nFor every dependant 18 years old or younger who is applying with you, provide:\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\nThey must complete either:\nAlternatively, you can show us:\nInclude:\nNote: If your child is likely to turn 18 while your application is being processed, you will need to provide evidence they are dependent on you. See the section 'Dependants over 18 documents' below for further information. A child who turns 18 while your application is being processed and who is not dependent on you cannot satisfy the criteria for this visa.\nTo include your child who is over 18 in your visa application, they must be:\nProvide:\nIf your child is likely to turn 23 while your application is being processed, you will need to provide evidence they are dependent on you due to disability.\nProof of dependency\nYou must demonstrate that the child is dependent on you, by providing:\nYou must also prove this person has been financially dependent on you for at least 12 months before you apply. You could provide:\nNote: If your child is likely to turn 18 while your application is being processed, you will need to provide evidence they are dependent on you. See the section 'Dependants over 18 documents' below for further information. A child who turns 18 while your application is being processed and who is not dependent on you cannot satisfy the criteria for this visa.\nHave all non-English documents translated into English.\nProvide original and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nNote: You do not need to have any documents certified.\nScan or photograph all documents (English and non-English) in colour.\nThe scans and photos must be clear.\nIf a document is more than one page, save it all as one file.\nApply for this visa online in ImmiAccount. You must be invited to apply. Your invitation letter contains instructions on how to lodge your application.\nFor all applications lodged from 13 November 2021, applicants should upload supporting documentation to ImmiAccount when lodging a subclass 188 Business Innovation and Investment visa application in all streams.\nUploading all documents to ImmiAccount will ensure efficient processing and help to reduce processing times. Please utilise naming conventions provided when uploading supporting documents. Where naming conventions are unavailable for a particular document/s, please ensure that a proper heading is provided to the attached document/s.\nYou are obliged to prove your identity and provide true information with your application. See what happens if you cannot prove your identity or do not provide true information.\nImmiAccount will tell you the charge. We will not process your application until you pay the correct charge.\nAfter you submit your application online, send us your documents and other forms.\nIf you are applying from the People’s Republic of China, Macau (SAR), Hong Kong (SAR) or Taiwan use the document checklist from the Australian Consulate General Hong Kong.\nIf you live elsewhere, send your supporting documents via email to the mailbox address specified in the Acknowledgement of Application Received letter. You will receive this letter after you lodge your application via ImmiAccount.\nFor all applications lodged from 13 November 2021, applicants should upload supporting documentation to ImmiAccount when lodging a subclass 188 Business Innovation and Investment visa application in all streams via ImmiAccount.\nWe will let you know when we have received your application.\nWe cannot provide updates on applications. You will be contacted if additional information is required. Please wait for us to contact you.\nYou do not have to tell us if you want to travel outside Australia while we process your application. This is because you can be outside Australia when we make a decision.\nBut if you leave Australia, make sure you have a valid visa if you plan to return to Australia before a decision is made on your application.\nLearn about visa expiry.\nLearn about Bridging visas\nIf you did not have health examinations before you applied, we will let you know if you need them.\nWe might ask for biometrics (fingerprints and photo). We will let you know if you need to provide them.\nIf you didn't send us all documents when you applied, send them as soon as you can.\nApplying from China, Macau, Hong Kong or Taiwan\nIf you are applying from the People’s Republic of China, Macau (SAR), Hong Kong (SAR) or Taiwan use the document checklist from the Australian Consulate General Hong Kong.\nIf you live elsewhere, send your supporting documents via email to the mailbox address specified in the Acknowledgement of Application Received letter. You will receive this letter after you lodge your application via ImmiAccount.\nYou can add your dependent child or children to your application any time before we decide on your application. They will need to meet our health and character (if applicable) requirements.\nComplete Form 1436 Adding an additional applicant after lodgement (481KB PDF) and\nThe spouse or de facto partner of the main applicant who did not make a combined application at the initial lodgement of the subclass 188 visa, can make a subsequent entrant application. A subclass 188 visa can only be granted to a subsequent entrant after the main applicant’s subclass 188 visa is granted.\nComplete the online 'Application for a Business Innovation and Investment (Subsequent Entrant) Visa' application form in ImmiAccount. An application charge is applicable.\nFind out what to do if your child is born after you apply.\nLet us know as soon as you can if you made a mistake on your application.\nComplete Form 1023 Notification of incorrect answers (168KB PDF)\nWhen we are satisfied that you meet all other criteria for this visa, we will invite you in writing to make a complying significant investment. Do not make your complying significant investment until we invite you to do so, as your visa will not be granted if you cannot satisfy all other criteria for this visa. Any investment made before lodging the application will not meet the requirements of this visa.\nIf we invite you to make a complying significant investment, your invitation letter will state the sources of funds that we have accepted for you to use for the investment.\nYou must make the investment within the timeframe stated in the letter (usually 70 days).\nWhen you have made the investment, you must provide our office with:\nIf you are in Australia, make sure you stay lawful by holding a valid visa while we process your application.\nWhen you applied for this visa, if you were in Australia, you were granted a Bridging visa A (BVA). If your current visa expires before we decide on your application, the BVA will start.\nYou can stay in Australia on the BVA while we process your new visa application. However, if you intend to leave Australia and return while holding a BVA, you will need to apply to our office for a Bridging Visa B (BVB) or make alternative visa arrangements to return, as your BVA expires when you leave Australia.”\nDo not cancel your current visa. If you do, you will:\nLearn more about visa expiry.\nLearn about Bridging visas\nLet us know if you no longer want someone to:\nUpload your written notification or your forms to ImmiAccount.\nFor more information see Who can help you with your application.\nThings you need to let us know about after you have applied include:\nSee how to tell us if your situation changes\nIf you need to pay a second instalment, we will send you an invoice after you have met all other requirements for the visa. Pay the invoice after you get it.\nYou must pay the instalment before we will grant the visa.\nWe will let you know in writing our decision about your visa application. If we grant you the visa, we will tell you:\nKeep a copy of the decision with you when in Australia.\nIf we refuse your visa, we will tell you why it was refused and whether you have a right to a review of the decision.\nWe will not refund the application fee if we refuse your application.\nYou must have:\nAll people arriving in Australia must complete the Incoming Passenger Card. You will be given this card onboard the aircraft.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nWhat you can do when you have this visa\nThis is not a permanent visa. With this visa you can:\nTo see your specific conditions, work and study entitlements use VEVO.\nTo see your specific conditions, work and study entitlements use VEVO.\nIn particular, you must maintain your investment and comply with Australian workplace laws.\nYou must hold a complying significant investment continuously for the life of your provisional visa.\nIncome that you earn from your investment in Australia is subject to Australian taxation law.\nAll workers in Australia (including visa holders) have rights and protections at work. Pay rates and workplace conditions are set by Australian law.\nIf you operate a business in Australia, you must comply with workplace laws. The Pay and Conditions Tool (PACT)  can help you with pay rates, shift calculations, leave arrangements and notice and redundancy entitlements.\nThings you need to let us know about include:\nSee how to tell us when your situation changes.\nThis is a provisional visa. You can stay in Australia for 4 years and 3 months. If you applied before 1 July 2015, you can stay for 4 years.\nThe visa starts on the date we grant it.\nTo see when you must leave, use  VEVO.\nThis is a provisional visa. You must apply for a new visa if you want to stay longer. Once you have this visa, you can apply for permanent residence if certain requirements are met. Explore your visa options.\nOnce you have the provisional visa, you can apply for the Business Innovation and Investment (Permanent) visa (subclass 888) Significant Investor stream if certain requirements are met.\nIf you applied for a Business Innovation and Investment (Provisional) visa (subclass 188) in the Significant Investor stream prior to 1 July 2015, you will be eligible to apply for a Business Innovation and Investment (Permanent) visa (subclass 888) in the Significant Investor stream after 3 years and 11 months.\nIf you need more time to apply for permanent residence, you can apply for a Business Innovation and Investment (Provisional) visa (subclass 188) Significant Investor Extension stream to extend your stay in Australia.\nA person can be granted a maximum of 2 visas in this stream.\nThis is a multiple entry visa. You can travel outside Australia and return as many times as you want while the visa is valid.\nThe time you spend outside Australia does not extend the visa.\nSee your conditions.\nTo prove you have a visa and/or show your conditions to someone, use VEVO.\nRequest your international movement records to get proof of your travel in and out of Australia.\nAfter you are granted this visa, if members of your family want to apply for the same visa, they must submit a separate online application. Any additional family members are called 'subsequent entrants'.\nNewborn and dependent child or children can be added to your 188 visa application before we decide on your application. However, your spouse or de-facto partner, who did not make a combined application with you at the initial lodgement of your application, can apply for the 188 visa under subsequent entrant. A subclass 188 visa can only be granted to a subsequent entrant after the main applicant’s subclass 188 visa is granted.\nComplete the online 'Application for a Business Innovation and Investment (Subsequent Entrant) Visa' application form in ImmiAccount. An application charge is applicable.\nYou must have a valid passport or other travel document to leave Australia.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nRequest your international movement records to get proof of your travel in and out of Australia."
}