{
    "visaID": "visa1.5.1",
    "visaType": "visa1.5",
    "visaName": "First Work and Holiday visa",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/work-holiday-462/first-work-holiday-462",
    "content": "\n1. Work and Holiday visa (subclass 462)\n2. First Work and Holiday visa\n12 months\nAUD650.00\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application may take longer to process than the times shown in the guide due to the number of Working Holiday visa applications we receive. Do not arrange travel to Australia before we tell you in writing that we have granted your visa.\nSee all conditions\nIf you hold a valid passport issued by China, India or Vietnam, you must participate in a visa pre-application process (ballot) and be randomly selected to apply for a first Work and Holiday (subclass 462) visa.\nFor more information, see New Work and Holiday visa pre-application process.\nIf you are getting help with your visa, before you pay someone, read information on Who can help with your visa application.\nApply\n3. With this visa you can\nYou can do any kind of work on this visa.\nUsually, you can only work for the same employer for 6 months.\nIf the main purpose of your stay is to work, consider a work visa. Explore visa options.\nYou can study for up to 4 months (17 weeks).\nIf the main purpose of your stay is to study, consider a Student visa.\n4. How long you can stay\nThis is a temporary visa. You must enter Australia within 12 months of the date we grant it. We will not extend or defer this timeframe.\nThe visa’s period of stay starts on the date you enter Australia. Once you have entered you can:\nNote:\nYour Work and Holiday visa starts on the date you enter or transit through Australia even if you hold any other temporary visa including:\nIt is important that you only apply for a Work and Holiday visa once you are ready to enter Australia on that visa. Once we grant your Work and Holiday visa and you travel to Australia and are immigration cleared at the border, the 12-month visa period of stay will automatically start upon entry, regardless of the purpose of your visit.\n5. Stay longer\nYou can't stay in Australia longer by extending this visa.\nExplore your visa options to stay longer in Australia.\nYou could apply for a second Work and Holiday visa if you are eligible.\nThe total time we let you stay in Australia on your first Work and Holiday visa and then a visitor visa is 12 consecutive months.\nWe might grant you longer on a Visitor visa if there are exceptional circumstances.\nFor this visa, exceptional circumstances might be that a close family member in Australia has died or is seriously ill and you are required to stay in Australia to provide assistance or support.\n6. Include family\nYou can't include family members in your application.\nYou can't be accompanied by dependent children while you are in Australia on this visa.\n7. Cost\nAUD650.00\nYou might also have to pay for health checks, police certificates and biometrics.\n8. Apply from\nYou must be outside Australia when you apply for this visa and when we decide your application.\n9. Processing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application might take longer to process if:\n10. Annual visa limit\nEvery program year we grant a limited number of first Work and Holiday visas to applicants from each eligible country except the United States of America. The program year begins on 1 July and ends on 30 June.\nOnce this annual limit or 'cap' is reached, we will not grant any more visas. You should wait until the new program year commences on the following 1 July to submit an application.\nTo find out if applications are open, suspended or closed from your country of passport see Status of country caps.\n11. Pre-application process\nChina, India and Vietnam passport holders must participate in a visa pre-application process (ballot) and be randomly selected to apply for a first Work and Holiday (subclass 462) visa.\nFor more information, see New Work and Holiday visa pre-application process.\n12. Your obligations\nYou must comply with all visa conditions and Australian laws.\nSee the conditions for this visa.\nYou must pay taxes when you work in Australia on this visa.\nAustralia has compulsory superannuation - a retirement savings scheme. Your employer must pay superannuation into your superannuation fund if you earn more than a certain amount.\nYou can access your superannuation when you leave Australia.\n13. Health insurance\nWe strongly recommend you take out health insurance to cover any unforeseen medical treatment you might need in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability.\nSee what we consider adequate health insurance.\nLearn more about health insurance for overseas visitors.\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from the Department of Human Services about reciprocal healthcare agreements.\n14. Travel\nYou can travel outside Australia and return as many times as you want while the visa is in effect.\nTime you spend outside Australia after your first entry does not extend the visa's 12-month period of stay in Australia.\n15. Visa record\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nYou must be a citizen of and hold a valid passport from one of these countries:\nNote: China, India and Vietnam passport holders must participate in a visa pre-application process (ballot) and be randomly selected to apply for a first Work and Holiday (subclass 462) visa.\nFor more information, see New Work and Holiday visa pre-application process.\nYou must be aged 18 to 30 years old (inclusive) when you apply.\nIf you apply for the visa while you are 30, but turn 31 before we have made a decision, we can still grant you the visa if you meet all other requirements.\nYou must not have previously entered Australia on a:\nYou must meet our education requirement.\nThis table presents our education requirements for this visa by country.\nCheck the visa pages of the Australian embassy in your country for more detail on our education requirement.\nThese are acceptable tertiary qualifications:\nThese are not acceptable tertiary qualifications:\nBrazil\nIndia\nThese are acceptable tertiary qualifications:\nThese are not acceptable tertiary qualifications:\nYou must:\nThese are acceptable tertiary qualifications:\nThese are not acceptable tertiary qualifications:\nYou must have a tertiary qualification from a university, college or training centre.\nThese are acceptable tertiary qualifications:\nThese are not acceptable tertiary qualifications:\nYou must have at least Functional English.\nYou have Functional English if you meet one of the following:\nYou must give us a letter of support from your government (or alternative as stated below) if you are from:\nYou must have enough money to:\nThis is usually about AUD5,000 for your initial stay, plus the fare to where you are going after leaving Australia.\nYou must meet our health requirement.\nYou must meet our character requirement.\nIf you or any family members (including those who don't apply for the visa with you) owe the Australian government money, you or they must have paid it back or arranged to pay it back.\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused see Limitations on applications in Australia.\nIf applying for a visa from outside Australia see Can I go to Australia.\nIf you want immigration assistance, see Who can help with your visa application.\nYou must acknowledge the Australian Values Statement that confirms you will respect the Australian way of life and obey Australian laws when you apply for the visa.​\nCheck if applications are still open for the country of issue of your passport.\nYou can organise health exams or appoint someone to help you with your application.\nYou might need to have health examinations. You can complete them before you apply or you can wait until we tell you to have them.\nFind out the examinations you need and how to arrange them if you want to have them before you apply.\nNote: China, India and Vietnam passport holders must participate in a visa pre-application process (ballot) and be randomly selected to apply for a first Work and Holiday (subclass 462) visa.\nFor more information, see New Work and Holiday visa pre-application process.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nProvide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\nAlso provide a copy of your birth certificate showing both your parents’ names. If you don’t have a birth certificate and you can’t get one, provide a copy of the identification pages of one of these:\nIf you have changed your name, provide proof such as:\nYou must provide photographs of yourself if you apply on paper. The photos must be:\nYou can wear untinted prescription glasses. If you wear a head covering for religious reasons, you can show only your face.\nProvide evidence of your educational qualifications.\nShow us evidence of either of the following:\nOr show us evidence that you have completed any of the following:\nOr show us evidence that, in the 12 months before you applied for the visa, you scored:\nFor more information, see Functional English.\nYou must obtain a letter of support from your government (or alternative as stated below) before lodging your visa application if you are from one of the following countries:\nYou do not need to provide a letter of support from your government if you are from:\nProvide evidence you have enough money for your stay in Australia. This is usually AUD5,000.\nYou must also show us you have enough money to buy a ticket to leave Australia at the end of your stay, or that you already have the ticket.\nIf you don’t attach evidence to your application, processing may be delayed if we need to contact you to request further information.\nWe might ask you to provide:\nWe will let you know if you need to give us these documents.\nTo nominate someone to:\nUpload your written notification or your forms to ImmiAccount.\nHave all non-English documents translated into English.\nProvide original and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nNote: You do not need to have any documents certified.\nScan or photograph all documents (English and non-English) in colour.\nThe scans and photos must be clear.\nIf a document is more than one page, save it all as one file.\nAttach a document only once, even if you are using it to show more than one thing.\nLearn more about attaching documents.\nHave all non-English documents translated into English.\nProvide original and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nDo not certify police certificates. You need to send us the originals.\nHave all other documents certified. This includes:\nKeep a copy of your completed application.\nSend us:\nApplicants must apply for this visa online. Learn how to apply for the visa.\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nApply online if you hold a passport from:\nNote: China, India and Vietnam passport holders must participate in a visa pre-application process (ballot) and be randomly selected to apply online for a first Work and Holiday (subclass 462) visa.\nFor more information, see New Work and Holiday visa pre-application process.\nApplicants with dependent children\nYou can’t apply online if you are the parent of a child under the age of 18.\nWork and Holiday visa holders cannot be accompanied by dependent children at any time during their stay in Australia. While it is possible to obtain a Work and Holiday visa if you have a child, your child cannot join you in Australia at any time while you are on your Work and Holiday visa – not even for one day.\nSee what you can and must do after you apply.\nWe will let you know when we have received your application.\nDo not arrange to travel to Australia until we let you know, in writing, that we have granted you the visa.\nWe might ask for biometrics. We will let you know if you need to provide them.\nIf you didn't have health examinations before you applied, we will let you know if you need them.\nIf you didn't attach all documents when you applied, attach them via ImmiAccount as soon as you can.\nWe might also ask you to provide more information.\nLet us know as soon as you can if you made a mistake on your application.\nComplete Form 1023 Notification of incorrect answers (168KB PDF) and attach it in ImmiAccount.\nLet us know if you no longer want someone to:\nUpload your written notification or your forms to ImmiAccount.\nFor more information, see Who can help you with your application.\nTell us if things change after you lodge your application but before we have made a decision.\nThings you need to let us know about include:\nWe will let you know our decision in writing.\nIf we grant your visa, we will tell you:\nKeep a copy of the decision notification with you when in Australia.\nIf we refuse your visa, we will tell you:\nIt is very important that you only apply for a Work and Holiday visa once you are ready to enter Australia on that visa. Once we grant your Work and Holiday visa, you can use the visa to enter Australia.\nAfter you have been granted your Work and Holiday Visa you do not need to apply for another visa, such as an eVisitor (subclass 651), a Transit (subclass 771), or an Electronic Travel Authority (ETA) (subclass 601) visa to enter Australia.\nIf you apply for and are granted another visa (such as subclass 651 or 771 visa) after the grant of your Work and Holiday visa, your Work and Holiday visa (and related work rights) will cease on the date that visa is granted.\nIf your first Work and Holiday visa ceased due to the grant of another visa, such as an eVisitor or Transit visa, and you entered Australia on that other visa, you will not be able to apply for another first Work and Holiday visa while you are in Australia.\nIf you enter Australia after the grant of your Work and Holiday visa, the 12-month period of stay on your visa will automatically start on that day.\nThe Work and Holiday visa period will start regardless of the purpose of your visit, even if you:\nor\nCheck your travel documents are up to date.\nYou must have:\nCompleting an Incoming Passenger Card\nAll people arriving in Australia must complete the  Incoming Passenger Card. You will be given this card onboard.\nLeaving the airport faster\nWe have an automated process that uses facial recognition technology and your ePassport, if you have one. You may be able to leave the airport faster if you use SmartGate.\nUsually, you can only work for the same employer for 6 months.\nTo see your conditions for work, use VEVO.\nYou must pay taxes when you work.\nWhen you work in Australia, you are protected by Australian workplace law. See your workplace rights and entitlements.\nIf you earn over a certain amount, your employer must pay superannuation into your superannuation fund. Australia has compulsory superannuation - a retirement savings scheme.\nWhen you leave Australia, you can access your superannuation.\nYou can study for up to 4 months (17 weeks).\nTo see your study entitlements use VEVO.\nYou can travel outside Australia and return as many times as you want while the visa is in effect.\nTime spent outside Australia after your first entry does not extend the visa’s 12-month period of stay in Australia.\nThis is a temporary visa. You must enter Australia within 12 months of the date we grant it.\nThe visa starts on the date you enter Australia. Once you have entered and the visa stay period starts, you can:\nYou can't stay in Australia longer by extending this visa.\nYou must apply for a new visa if you want to stay longer.\nYou could apply for a second Work and Holiday visa if you are eligible.\nSee your options.\nYou must meet all visa conditions and obey Australian laws.\nSee your conditions in your visa grant letter or VEVO.\nTo prove you have a visa and show your conditions to someone, use VEVO.\nRequest your international movement records to get proof of your travel in and out of Australia.\nThings you need to let us know about include:\nSee how to tell us if your situation changes.\nYou must have a valid passport or other travel document to leave Australia.\nWe have an automated process that uses facial recognition technology and your ePassport. You may be able to leave the airport faster if you use SmartGate.\nYou are likely to have some money in a superannuation fund if you worked in Australia and you are:\nSee how to access your super.\nProving you have been to Australia\nRequest your international movement records to get proof of your travel in and out of Australia."
}