{
    "visaID": "visa6.3",
    "visaType": "visa6",
    "visaName": "Bridging visa C – BVC – (subclass 030)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-c-030",
    "content": "\n1. Subclass 030\n2. Bridging visa C (BVC)\nTemporarily\nFree\nThere are no processing times available for this visa.\nSee all conditions\nIf you are getting help with your visa, before you pay someone, read information on Who can help with your visa application.\n3. About this visa\nThis is a temporary visa. Nearly all bridging visas are applied for automatically as part of applying for a substantive visa. We may grant you a BVC if you have made a valid application in Australia for a substantive visa but you do not already hold a substantive visa.\nA separate application for a BVC might be necessary where:\nYou can't use a bridging visa while you wait for a citizenship application to be decided.\n4. In effect\nA BVC comes ‘into effect’ when:\nVisa holders must adhere to the conditions imposed on their visa. Where you are granted a BVC, you will be notified about the conditions that apply.\nIf you hold a substantive visa when your BVC is granted, you must continue to comply with the conditions of the substantive visa. When your substantive visa ceases, the conditions of your BVC will apply.\nThe BVC does not support return travel to Australia.\nRemaining lawful during judicial review\nIf a merits review tribunal upholds our decision to refuse your substantive visa application and you apply for judicial review, you will need to apply for a bridging visa to maintain your lawful status during the judicial review proceedings. If you have applied for judicial review you can only apply for a bridging visa by webform.\n5. Working in Australia\nThe initial BVC we grant when you apply for your substantive visa will not let you work, unless the substantive visa you have applied for is one of the following SkillSelect visas:\nIf your BVC does not let you work, or has restrictions on working, you can apply for another BVC that lets you work. To be considered for a BVC that lets you work, you will usually have to demonstrate that you are experiencing financial hardship.\nWe will assess your circumstances in relation to your claim that you need to work. If you do not meet the requirements for work and you are still eligible for a BVC, we will grant you a new BVC with the same work prevention or restriction condition that was on your previous BVC.\nIf you are a Protection visa applicant and you apply for a BVC for judicial review, we can only grant you a new BVC that allows you to work if the last BVC you held allowed you to work.\nIf you are a SkillSelect visa applicant and you are granted a BVC for judicial review, this visa will not initially allow you to work. To be considered for a BVC that lets you work, you will need to make a further BVC application and demonstrate that you are experiencing financial hardship.\nIf you are not a Protection or SkillSelect visa applicant and you apply for a BVC for judicial review you will only be granted a new BVC that does not allow you to work, even if your last BVC allowed you to work.\n6. With this visa you can\nStay lawfully in Australia until your substantive visa application is finally determined, or it granted in association with judicial proceedings, until those proceedings are complete.\nA BVC will end immediately if the following situations occur:\n7. How long you can stay\nIn all other situations one of the following outcomes will determine when your BVC ceases:\nOnce you have been notified of an outcome you can see exactly how long you can stay in Australia in VEVO.\nYour BVC will cease 35 calendar days after:\nYou BVC will cease 28 calendar days after:\nYour BVC will cease 28 days after the date that one of the following happens:\n8. Stay longer\nYou can't stay in Australia longer by extending this visa. You must apply for a new visa if you wish to stay longer.\nExplore your visa options.\n9. Include family\nIf you and your family have applied together for a substantive visa in Australia, you might have also applied together for a BVC. Check if family members already hold a BVC in VEVO.\nIf you apply separately for a BVC, you can include members of the family unit in your BVC application, if they are included in your substantive visa application.\nWe will assess each member of the family unit's application and decide which bridging visa they can be granted.\n10. Cost\nFree\n11. Apply from\nYou and anyone included in your application must be in Australia when the BVC application is submitted and granted.\n12. Your obligations\nYou and anyone included in your application must:\nSee the conditions that will and might be applied to a BVC.\n13. Travel\nIf you leave Australia on this visa when it is in effect you will not be able to return on it.  A BVC that is in effect will cease upon departure from Australia. To see if your BVC is in effect, see VEVO.\nAs BVC holder, we cannot grant you a Bridging visa B (BVB) that allows you to travel and return to Australia whilst your substantive visa application is being processed.\nIf you leave Australia and you do not hold another visa that allows you to return, you will have to apply for and be granted a substantive visa before you can return to Australia. There is no guarantee that you will be granted a visa.\n14. Visa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nThese are some of the common eligibility criteria:\nYou must not hold a Bridging visa E (BVE) and you must not have held a BVE since you last held a substantive visa.\nWhen you lodged your application for a substantive visa, you must not have held a substantive visa.\nYou will need to be in Australia when you apply.\nYou must have made a valid application for a substantive visa that has not been finally determined or you have made an application for judicial review of a decision relating to your substantive visa application, within the prescribed timeframe, and the judicial review proceedings have not been completed, and you previously held a BVC in relation to the substantive visa application.\nYou must apply within the prescribed timeframe.\nYou must apply for review within the prescribed timeframe. \nIf you have applied within the prescribed timeframe, you may not need to apply for a further Bridging Visa.\nThe timeframe for applying for judicial review is 35 days from the date of the Tribunal’s decision.\nIf you have not applied for judicial review within the statutory time limits, this may affect your eligibility to apply for a further Bridging Visa.\nYou can be any age to apply for this visa.\nYou will need to meet our character requirement.\nFor all criteria see Schedule 2 in Migration Regulations 1994.\nCheck if you already hold a BVC with VEVO.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nGather the documents you need for your application.\nProvide accurate information. See what happens if you can't prove your identity or do not provide true information.\nProvide colour copies of the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\nAlso provide:\nDocuments that prove a change of name include:\nProvide proof to support your claims of hardship if you are applying to change to your visa conditions.\nTo nominate someone to:\nUpload your written notification or your forms to ImmiAccount if you applied online, or send with your paper application.\nHave all non-English documents translated into English.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited, but on each translation, they must include their:\nThese details must be in English.\nNote: You do not need to have any documents certified.\nScan or photograph all documents (English and non-English) in colour.\nThe scans and photos must be clear.\nIf a document is more than 1 page, save it all as 1 file.\nHow you apply for a BVC depends on:\nYou must apply for the BVC in the same way you applied for your substantive visa.\nIf you applied for your new substantive visa through ImmiAccount, you must apply for your BVC application through ImmiAccount.\nIf you applied for your new substantive visa by paper, you must submit your BVC application by webform.\nIf you have applied for a review of a decision about your substantive visa application, you must submit your BVC application by webform.\nYou and anyone included in your application must be in Australia when the BVC application is lodged.\nProvide accurate information. See what happens if you cannot prove your identity or do not provide accurate information.\nIf you applied for your substantive visa through ImmiAccount\nYou must apply for the BVC through ImmiAccount:\nIf you applied for your substantive visa by paper\nYou must complete and submit your BVC application Form 1005 by webform.\nIf you have applied for review of a decision on your substantive visa application\nYou must complete and submit your BVC application Form 1005 by webform\nSee what you can and must do after you apply.\nWe will tell you when we have received your application and documents.\nWe do not give updates on application processing times.\nWait for us to contact you.\nIf you leave Australia while your BVC is in effect you will not be able to return. A BVC that is in effect will cease upon departure from Australia. To see if your BVC is in effect, see VEVO.\nYou cannot apply for a Bridging visa B (BVB) to travel if you hold a BVC.\nIf you are applying through ImmiAccount and did not attach all documents when you applied, attach them as soon as possible in ImmiAccount.\nIf you are applying by webform, you must attach all documents before you submit your BVC application. You cannot attach extra documents after you have submitted your application.\nWe may also ask you for more information. You should provide that information in the way we ask you to in the request letter.\nFind out what to do if your child is born after you apply.\nMake sure you stay lawful by holding a valid visa while we process your bridging visa and your substantive visa application. It is important to submit your application early. This ensures enough time for us to process your bridging visa application.\nIf you and your family have made a combined application for a substantive visa in Australia, you may have also applied for a Bridging visa. Check if family members already hold a Bridging visa in VEVO.\nFind out what to do if your child is born after you apply.\nTell us as soon as you can if you made a mistake on your application.\nComplete Form 1023 Notification of incorrect answers (168KB PDF).\nTell us if you:\nIf you applied for your substantive visa online upload your written notification or your forms to ImmiAccount\nIf you applied for your substantive visa by paper form, send your documents to the office assessing your visa application. You can find this information on the acknowledgement letter under Contact Us.\nFor more information see Who can help you with your application.\nSome of the things you need to tell us about after you have applied include:\nSee how to tell us if your situation changes.\nWe will let you know in writing our decision about your visa application.\nYou and anyone included in your application must be in Australia when we make a decision.\nIf we grant your visa, we will tell you:\nKeep a copy of the email with you when in Australia.\nIf we refuse your visa, we will tell you:\nTo see when you must leave after you are notified of an outcome, use VEVO.\nTo see your specific conditions, use VEVO.\nIf you are granted a BVC that does not permit work, you can apply for a further Bridging Visa with no conditions if you can demonstrate financial hardship.\nWe will assess your circumstances in relation to your claim that you need to work. If you do not meet the requirements for work, and you are still eligible for a BVC, we will grant you a new BVC with the same work prevention or restriction condition that was on your previous BVC.\nIf you are a Protection visa applicant and you apply for a BVC for judicial review, we can only grant you a new BVC that allows you to work if the last BVC you held allowed you to work.\nIf you are a SkillSelect visa applicant and you are granted a BVC for judicial review, this visa will not initially allow you to work. To be considered for a BVC that lets you work, you will need to make a further BVC application and demonstrate that you are experiencing financial hardship.\nIf you are not a Protection or SkillSelect visa applicant and you apply for a BVC for judicial review you will only be granted a new BVC that does not allow you to work, even if your last BVC allowed you to work.\nIf you leave Australia on this visa when it is in effect you will not be able to return on it. To see if your BVC is in effect, see VEVO. A BVC that is in-effect will cease upon departure from Australia\nSome of the things you need to let us know about after you have applied include:\nSee how to tell us if your situation changes.\nTo prove you have a visa and show your conditions to someone, use VEVO.\nIf you leave Australia on this visa when it is in effect you will not be able to return on it. To see if your BVC is in effect, see VEVO.  A BVC that is in-effect will cease upon departure from Australia\nAt the Border\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nProving you have been to Australia\nRequest your international movement records to get proof of your travel in and out of Australia."
}