{
    "visaID": "visa3.21",
    "visaType": "visa3",
    "visaName": "Remaining Relative visa (subclass 115)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/remaining-relative-115",
    "content": "\n1. Subclass 115\n2. Remaining Relative visa\n3. For Applicants\n4. For Sponsors\nPermanently\nFrom AUD5,125.00\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nFor more information, see Other Family Visa Queue\nSee all conditions\nIf you are getting help with your visa, before you pay someone, read information on who can help with your visa application.\n5. With this visa you can\nNewly arrived residents may have to wait before they can access certain Australian Government payments and benefits.\nYou can travel to and from Australia as many times as you want for 5 years from the date we grant this visa until the travel validity expires.\nIf you want to travel after the initial 5-year travel validity:\nTo see when your travel validity ends, use VEVO.\n6. How long you can stay\nThis is a permanent visa. It lets you stay in Australia indefinitely.\nFor citizenship purposes, you become a permanent resident at the time:\n7. Include family\nYou can include members of the family unit in your application when you apply. You an also add them to your application at any time before we make a decision.\nYou should include details of all your family members, whether they are migrating or not, in the application form.\nFamily members who apply for the visa with you must meet our health and character requirements.\nFamily members who are not coming to Australia might also have to meet our health and character requirements.\nFind out what to do if your child is born after you apply.\n8. Cost\nThis visa costs from AUD5,125.00\nThere is an additional charge for each family member who applies with you.\nYou pay for this visa in 2 parts, called instalments.\nPay the first instalment when you apply and the second instalment when we ask you to.\nYou might also have to pay other costs for health checks, police certificates and biometrics.\nTo work out what your visa will cost use the Visa Pricing Estimator. The estimator does not take into account the second instalment or other costs.\nSee more about visa fees and charges.\n9. Apply from\nYou must be outside Australia when you apply and when we decide your application.\n10. Processing times\nThe demand for Other Family visas is greater than the number of places available each year. As a result, processing times for these applications can be lengthy.\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application might take longer to process if:\nWe can't process your application if you don't pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\nApplications for this visa are subject to capping and queueing.\nLearn more about the Other Family Visa queues and processing priorities.\nThe Reports on Migration Programs have further information on Migration Program outcomes against planning for each migration program year.\n11. Your obligations\nYou must enter Australia before the date specified in your grant letter. The first entry date is generally set at 12 months from the date of visa grant.\nYou and your family members must meet all visa conditions and obey Australian laws.\nSee what conditions might be attached to this visa on our visa conditions page.\n12. Visa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nYou must be sponsored by an eligible parent or step-parent, sibling or step-sibling, or an eligible partner of your relative.\nWe must approve the sponsorship.\nWe will not grant you this visa if:\nYou must be able to obtain an assurance of support.\nAn assurance of support assures us that you will not have to rely on government assistance after you enter Australia on this visa. The assurance is for you and any family members who come to Australia with you on this visa.\nWe will let you know when you need to provide the assurance of support.\nLearn more about assurances of support.\nYou and any family members who apply for the visa with you must meet our health requirement.\nWe might also ask that other family members also meet the requirement.\nYou and family members who apply for the visa with you must meet our character requirement.\nWe might ask that other non-migrating family members meet the requirement.\nIf you or any family members owe the Australian Government money, you or they must have paid it back or have an approved arrangement to pay it back.\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused, see Limitations on applications in Australia.\nIf applying for a visa from outside Australia, see Can I go to Australia.\nIf you want immigration assistance, see Who can help with your visa application.\nIf you are 18 years of age or older, you must:\nWe will not grant this visa if it is not in the best interests of an applicant under 18.\nCheck your passport. If you need help with your application, get someone to act on your behalf.\nYou don't have to have a valid passport to apply but you must provide details of your most recent passport.\nHowever, we will only grant the visa if you have a valid passport.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nProvide documents to support your application. You will also need your sponsor documents.\nProvide accurate information. See what happens if you cannot prove your identity or do not provide true information.\nWe need proof of your identity. If you cannot prove your identity:\nProvide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\nAlso provide:\nDocuments that prove a change of name include:\nYour migration must be sponsored by your eligible relative or relative's eligible partner.\nThe sponsor must be:\nYour sponsor must complete Form 40 Sponsorship for migration to Australia.\nTo prove your relationship with your sponsor, you will need to give us:\nTo prove that your sponsor is an eligible citizen or permanent resident, give us:\nWe might ask you for character documents, including police certificates. Do not arrange for police certificates until we ask you to. Learn more about police certificates.\nTo nominate someone to:\nSend written notification or your forms with your paper application.\nFor every dependant under 18 years old who is applying with you, provide:\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\nThey must complete either:\nAlternatively, you can show us:\nInclude:\nIf the child is not staying with a relative or legal guardian, provide Form 1257 Undertaking declaration. The person they are staying with must sign the form.\nTo be included in your visa application as a dependent child, your child must be:\nFor every dependant 18 years old or older who is applying with you, provide:\nYou need to prove that this person is dependent on you. Provide:\nYou must also prove this person has been financially dependent on you for at least 12 months before you apply. You could provide:\nUsually, your child or stepchild must be under 23 years old to be included in your application.\nHowever, a dependant older than 23 years can be included if they are unable to earn a living to support themselves due to physical or cognitive limitations. In this case, provide information about the physical or cognitive limitation.\nProvide:\nProvide either:\nDocuments that prove your de facto relationship include:\nHave all non-English documents translated into English.\nProvide original copies and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nDo not certify police certificates. You need to send us the originals.\nHave all other documents certified copy. This includes:\nKeep a copy of your completed application.\nSend us:\nYou must apply for the visa on paper. You must be outside Australia when you apply.\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nComplete Form 47OF Application for migration to Australia.\nYour sponsor must complete:\nComplete the form  in English.\nYou can’t pay for this visa in person.\nYou must pay the first instalment when you apply. Pay for the application before it is submitted using the online portal payment function in ImmiAccount. Include evidence the application is paid for with your application.\nFor other payment options see how to pay.\nYou can't submit this application in person. Send the application by post or courier to the Parent, Child and Other Family Processing Centre in Perth at the address on the form. Include all required documents and forms with your application.\nIf any of the above steps are incomplete, your application may be invalid. We do not process invalid applications. We will notify you if this is the case, and if requested, return your application.\nDo not send original documents with your application, only send certified copies. Keep a copy of your completed application for your own records, including any supporting documents.\nWe will let you know when we have received your application and documents. See what you can and must do after you apply.\nWe can't provide you with updates on your application's progress within normal processing times. There may be other things you need to know and might have to do.\nDo not arrange to travel to Australia until we let you know, in writing, that we have granted you the visa.\nWe will let you know if you need health examinations.\nWe might ask for biometrics (fingerprints and photo). We will let you know if you need to provide them.\nIf you did not send us all documents when you applied, send them to the Parent, Child and Other Family Processing Centre in Perth at the address on the form. We might also ask you to provide more information.\nIf you travel to Australia on a different visa and that visa ends, you can't get a bridging visa to stay in Australia. You must be outside Australia when we make a decision on your application.\nPay the second instalment when we tell you to. We will send you an invoice for the instalment after you have met all other requirements for the visa.\nYou must pay the instalment or we can't grant the visa.\nLet us know as soon as you can if you made a mistake on your application.\nComplete Form 1023 Notification of incorrect answers.\nLet us know if you no longer want someone to:\nSend written notification or your forms to the office your submitted your application.\nFor more information see Who can help you with your application.\nThings you need to let us know about after you have applied include:\nSee how to tell us if your situation changes.\nYou need to provide an assurance of support when we ask you to.\nLearn more about assurances of support.\nYou must be outside Australia when we decide on your application. We will let you know our decision in writing.\nWe will let you know:\nKeep a copy of our decision.\nIf we refuse your visa we will let you know in writing. We will tell you:\nWe will not refund the application fee if we refuse your application.\nYou must have:\nYou must enter Australia before the date specified in your grant letter.\nIf your visa is still valid and the date specified in your visa grant letter has passed or will pass before you can travel to Australia, you must ensure that:\nWe may then send you a travel facilitation letter. This will state that we allow you to enter Australia after the first entry arrival date of your visa.\nWe will not issue a travel facilitation letter unless there is less than 3 months remaining on your first entry arrival date.\nAll people arriving into Australia must complete the Incoming Passenger Card.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport using the SmartGate.\nYou and your family members must meet all visa conditions and obey Australian laws.\nYou can check visa details and conditions in VEVO.\nSee what to do if your situation changes.\nCheck your visa conditions and expiry.\nCheck your Resident Return visa expiry, visa conditions, work and study entitlements in VEVO.\nThis is a permanent visa. It lets you stay in Australia indefinitely.\nFor citizenship purposes, you become a permanent resident at the time:\nTo see your specific conditions, work and study entitlements use VEVO.\nAs a newly arrived resident, you may have to wait before you are able to access certain Australian Government payments and benefits. Learn more about newly arrived residents’ waiting period from Services Australia.\nYou can travel to and from Australia as many times as you want for 5 years from the date we grant this visa until the travel validity expires.\nIf you want to travel after the initial 5-year travel validity:\nTo see when your travel validity ends, use VEVO.\nTo prove you have a visa and show your conditions to someone, use VEVO.\nYou can request your international movement records by completing Form 1359 Request for international movement records.\nWith this visa you become a permanent resident. You are protected by Australian workplace law. See your workplace rights and entitlements.\nAfter a certain time, you might be eligible for Australian citizenship. Find out more about becoming a citizen.\nFor citizenship purposes, you become a permanent resident at particular time:\nYou must have a valid passport or other travel document to leave Australia.\nSee what to do if your visa has expired or is about to expire.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nTo prove you have been to Australia, request your international movement records by completing Form 1359 Request for international movement records."
}