{
    "visaID": "visa6.9",
    "visaType": "visa6",
    "visaName": "Resident Return visa (subclass 155 157)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resident-return-visa-155-157",
    "content": "\n1. Subclasses 155 and 157\n2. Resident Return visa\nPermanently\nAUD475.00 to apply online\nAUD555 to apply on paper\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nSee all conditions\nIf you are already in Australia as a permanent visa holder, you do not need to apply for this visa unless you wish to leave and re-enter Australia as a permanent resident.\nIf you are getting help with your visa, before you pay someone, read information on Who can help with your visa application.\nApply\n3. With this visa you can\nIf you leave Australia after your permanent visa travel facility has expired, you will not be able to return to Australia as a permanent resident. If you wish to return to Australia as a permanent resident, you must apply for and be granted this visa before your arrival in Australia.\nIf you are already in Australia as a permanent resident, you do not need to apply for this visa if you do not wish to travel.\nThere are no limits on the number of Resident Return visas (RRV) you can apply for.\nFor more information, see Overseas travel as a permanent resident.\nCheck the travel facility expiry date of your permanent visa before you apply for an RRV to see if it covers your intended travel period. You can check this on VEVO.\n4. Cost\nAUD475.00 for each applicant if you apply online (you must apply online unless we authorise you to apply on paper).\nAUD555 for each applicant if we authorise you to apply on paper. If you are exempt from paying the Non-internet application charge a repayment will automatically be processed and the payment returned to you.\nYou might also have to pay for other costs including health checks, police certificates and biometrics. We will advise you if this is required.\nTo work out what your visa will cost, use the Visa Pricing Estimator. The estimator does not take into account the other costs.\n5. RRV Refunds\nGenerally, you will not be given a refund just because:\nIf you think we made a mistake that caused you to lodge your RRV application in error, let us know. Provide documentary evidence with your request to support your claim.\n6. How long the travel facility lasts\nIf you are granted an RRV, the travel facility will vary depending on your circumstances.\nIf you :\nIt is not possible to carry over the remaining travel facility from any previous visa to the subsequently granted RRV. You will not be able to get a refund for any lost travel facility.\nYou will not be able to request extension of travel facility, regardless of the circumstances (within or outside of your control).\nIt is not possible to postpone the grant of an RRV once all visa requirements are met.\nIf you have already applied for an RRV and find that the travel facility attached to your current permanent visa will cover your intended travel period, you should consider withdrawing your pending RRV application. You should do this in writing as soon as possible. See You want to withdraw a visa application.\nIf you hold an RRV, you should always be aware of the expiry date of the travel facility before any travel arrangements are made. You can check this on VEVO.\nWe will send you a reminder about the expiry of the travel facility of your RRV (Subclass 155) visa. We will not send you a reminder if you have a pending RRV application. If you need to travel, you should apply for a new RRV before your existing travel facility expires. This will help you avoid delays. For more information about the Travel Facility Expiry Reminder (TFER) and which permanent visa holders receive them, see Overseas travel as a permanent resident.\nIf you return to Australia without a permanent visa and a valid travel facility (for example, when holding a visitor visa), this might impact your:\nYou do not need to apply for an RRV if:\n7. Include family\nYou can't include family members in your application.\nIf other family members are also applying for this visa separately at the same time, then you can have all your applications processed together, if you declare them in your application.\nWhile you can’t include family members as secondary visa applicants in your application, you should provide information about any immediate family members who are Australian citizens or permanent residents in your application. This is important, if you are trying to show that you have substantial ties of benefit to Australia.\n8. Apply from\nYou can be in or outside Australia when you apply for the visa but not in immigration clearance. If we authorise you to apply using a paper form, you must follow the instructions given to you otherwise your application may be invalid. If your application is invalid, it cannot be considered. You cannot apply in person.\nIf you have applied for your visa but have not been granted it and you need to travel urgently see contact us.\n9. Processing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nGenerally, applications that:\nYour application can also take longer to process if:\nYour application will not be processed if you do not pay the correct application charge. If necessary, you will be notified and any charges repaid.\n10. Your obligations\nYou must obey all Australian laws.\n11. Travel\nYou can travel for a specified period from the date your visa is granted.\nAfter that period, you will need another RRV visa to re-enter Australia as a permanent resident. Alternatively, you may wish to consider your eligibility for Australian Citizenship so you can travel on an Australian passport.\nSee when your existing travel facility ends in VEVO.\n12. Visa label\nWe will digitally link your visa to your valid travel document. You will not get a label in your passport.\nAustralian citizens are not eligible to apply for an RRV.\nWhen an RRV application is lodged, applicants are assessed against the criteria for both subclass 155 and 157 visas. If the requirements for subclass 155 RRV are not met, and the applicant is eligible for a subclass 157 RRV, the maximum travel facility that can be granted with a subclass 157 RRV is 3 months.\nEven if you hold a temporary visa, you may still be eligible for an RRV if you had been a permanent visa holder or an Australian citizen.\nIf you were an Australian permanent visa holder who returned to Australia on a temporary visa (such as an Electronic Travel Authority), you should consider applying for an RRV as soon as possible if you intend to remain permanently in Australia – see permanent resident and how to stay lawful under After you apply.\nThere are no age requirements for RRV applicants.\nYou must either:\nOR\nin which case you can only be given a maximum 12 months travel facility\nOR\nin which case you can only be given a maximum 12 months travel facility\nOR\nin which case you can only be given a maximum 12 months travel facility\nOR\nIn calculating the residence requirement relating to the first dot-point above, the:\nYour ties must be both substantial and of benefit to Australia. Your ties can be:\nYou can see examples of how to demonstrate these ties in Step by step under Gather your documents.\nYou are not eligible for an RRV if you hold a Transitional (permanent) visa because you were issued either an:\nIf you hold one of these, see Overseas travel as a permanent resident.\nYou must meet our character requirement.\nYou might not be eligible for this visa if you have cancellation action on business grounds for your business skills visa. See the following visas:\nYou might not be eligible for this visa if you are, or were the holder of one of the above visas and have:\nYou may not be eligible for this visa if you are or were a family member of a person affected by the above, and either hold or have held one of the above visa subclasses as a dependant family member.\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused, see Limitations on applications in Australia (129KB PDF).\nIf applying for a visa from outside Australia, see Can I go to Australia.\nIf you want immigration assistance, see Who can help with your visa application.\nCheck your current visa status and travel facility prior to applying to determine if an application for a Resident Return visa is necessary. You can check this through VEVO. Note: you may not get a refund after lodging your application – see Cost.\nYou should have a valid passport or other travel document before we grant this visa.\nIf you need a new passport, plan to get it before you apply for this visa.\nIf you get a new passport after you apply, tell us your new passport information as soon as possible. See how to tell us your passport has changed.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nYou must apply online. Only in exceptional circumstances, such as an ImmiAccount technical issue, will we authorise you to lodge on paper. We might grant you the visa automatically without you needing to provide any documents if:\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nProvide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\nAlso provide:\nDocuments that prove a change of name include:\nProvide evidence of your permanent residency with your visa application, particularly if you migrated to Australia before 1990. This could include:\nIn addition to the above, you should provide a copy of your current passport.\nIf you migrated to Australia before 1990 and you have no evidence of your permanent residency, you should contact NAA in the first instance and obtain any necessary documentation prior to lodging your application. This includes any international movement records before 1990, and any relevant visa documentation. Failing to do so may result in significant delays in processing your application.\nIf you do not meet the residence requirement, you must provide documents that show evidence of your substantial ties, which are of benefit to Australia, and\nProvide a statement that shows your ties are both substantial and of benefit to Australia. There may be delays in processing your application if you do not attach documents to your application showing that your ties are both substantial and of benefit to Australia.\nExamples of documents you can attach are (but not limited to):\nSubstantial personal ties may be of benefit to Australia if the applicant is, or has been, a participating member of the Australian community and economy, and their ties enrich the lives of individual Australian residents and citizens. This may include regarding Australia as home or having an intention to reside in Australia.\nCopies of birth certificates, marriage or citizenship certificates of partners and children\nEvidence of continuing relationship with Australian citizen partner\nIf you are outside Australia when you apply, and\nYou are not eligible for an RRV if you are outside Australia when you apply and you were not an Australian citizen or permanent resident in the 10 years immediately before the application unless either of the above applies to you.\nIf you are in Australia when you apply\nYour reasons should include any elements which you thought were compelling at the time. Although not mandatory, you should indicate how the compelling reasons for your absence link to the entirety of your absence from Australia. This could be done by a statement explaining the circumstances of your absence(s). Attach other documents showing your compelling reasons for absence(s) from Australia to your application, or there may be delays in processing your application. Examples of documents you can attach are (but not limited to):\nIt will take us longer to process your application if we need to ask you for more documents. We may still, however, make a decision on your application based on any available information without requesting any additional information from you. As such, it is very important that you read all information on the website, and provide a complete application at the time of lodgement.\nFor married couples, provide the marriage certificate.\nFor de facto relationships, provide either:\nFor both married and de facto applicants, you must provide evidence that you are in a genuine and continuing relationship. Evidence can include but is not limited to:\nFor children under 18 years old, provide:\nWe will tell you if and when you need to get a police certificate.\nTo nominate someone to:\nSend written notification or your forms with your paper application.\nHave all non-English documents translated into English.\nProvide original copies and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited but on each translation, they must include their:\nThese details must be in English.\nNote: You do not need to have any documents certified.\nScan or photograph all documents (English and non-English) in colour.\nThe scans and photos must be clear.\nIf a document is more than one page, save it all as one file.\nApply for this visa online in ImmiAccount. You can use ImmiAccount even if you don’t already have an electronic visa record with us. If you cannot apply online due to a technical issue, you can access technical support in ImmiAccount. If technical support does not resolve the issue, we will consider allowing you to submit a paper application. Applying on paper will incur an additional non-internet application charge even with our authorisation.\nWe will not process your application until you pay the charge.\nEach family member must have their application charge paid and all relevant documents attached to their application.\nSee what you can and must do after you apply.\nWe will let you know when we have received your application and documents.\nYou can track and manage your application using ImmiAccount.\nWe can’t give updates on applications within the standard processing time.\nYou can check if we need more information from you in ImmiAccount. Wait for us to contact you if you applied on paper.\nBefore you leave Australia, make sure you have a valid visa that allows you to return to Australia as a permanent resident.\nIf you are outside Australia when you apply for the visa, and apply on paper, you must be outside Australia when we grant you the visa.\nIf you are in Australia when you apply for the visa, you can be in or outside Australia when we grant you the visa.\nLearn about visa expiry.\nIf you didn't attach all documents when you applied, attach them as soon as possible in ImmiAccount.\nIf you have a pending paper application, you may still be able to attach your documents in ImmiAccount. This can occur after the application has been imported into ImmiAccount. See Applying online or paper > Start and Manage an application > Import an application.\nYour application may take longer to finalise if we have to ask you to provide more information.\nLet us know as soon as you can if you made a mistake on your application.\nComplete Form 1023 Notification of incorrect answers (168KB PDF) and attach it in ImmiAccount, if you applied online or you have imported your application into ImmiAccount.\nLet us know if you no longer want someone to:\nAttach the forms in ImmiAccount.\nFor more information see Who can help you with your application.\nIf you are in Australia, make sure you stay lawful by holding a valid visa while we process your application.\nIf you held a substantive visa when you applied for this visa, you may be eligible to apply for an associated Bridging visa A (BVA). If you are granted a BVA and your current visa expires before we decide this application, the BVA will come into effect. You can stay lawfully in Australia on the BVA while we process your application.\nIf your substantive visa is cancelled or ceases and you do not hold a bridging visa, you will:\nLearn more about visa expiry.\nThings you need to let us know about after you have applied include:\nSee how to tell us if your situation changes.\nYou can be in or outside Australia when we make a decision.\nWe will let you know about your visa application in writing. We will tell you:\nKeep a copy of the decision with you when in Australia.\nWe will notify you in writing if we refuse your visa and explain why we have refused it and whether you have a right to a review of the decision.\nThe visa application charge (VAC) will not be refunded to you just because we refused your visa application.\nYou must have:\nAll people arriving in Australia must complete the Incoming Passenger Card.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nIf an immigration officer processes your clearance at our border, we recommend you tell them that you have a permanent visa and that you do not want a temporary Special Category visa (subclass 444). If you do not tell them, you might be granted the subclass 444 visa which might affect your eligibility for an RRV and Australian citizenship in the future.\nTo see your specific conditions and work entitlements, use VEVO.\nYou must obey all Australian laws.\nThings you need to let us know about include:\nTell us if there is a change in your situation.\nFrom the date we grant your visa, you can travel for a specified period of time. This depends on the reason we granted you the RRV. For information on the travel validity, see How long this visa lasts.\nAfter that period, you will need another RRV visa to re-enter Australia as a permanent resident. Alternatively, you may wish to consider your eligibility for Australian Citizenship and travel on an Australian passport.\nTo see when your travel facility ends, use VEVO.\nTo prove you have a visa and show your conditions to someone, use VEVO.\nYou are protected by Australian workplace law. See your workplace rights and entitlements.\nAs an Australian permanent resident, you might be able to sponsor eligible family members to come to Australia.\nTo find a visa for your family member, explore visa options.\nAfter a certain time, you might be eligible for Australian citizenship. Find out more about becoming a citizen.\nFor citizenship purposes, your permanent residency starts either:\nYou must have a valid passport or other travel document to leave Australia.\nCheck your conditions and the expiry of your RRV in VEVO.\nSee what to do if your visa has expired or is about to expire.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate."
}