{
    "visaID": "visa4.20.4",
    "visaType": "visa4.20",
    "visaName": "Privileges and Immunities stream",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-work-403/privileges-immunities",
    "content": "\n1. Temporary Work (International Relations) visa (subclass 403)\n2. Privileges and Immunities stream\nYou can stay for the time we specify in your visa grant letter. This is usually the time you are an international representative with the support of the Department of Foreign Affairs and Trade (DFAT).\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nSee all conditions\nIf you are getting help with your visa, before you pay someone, read information on Who can help with your visa application.\nApply\n3. With this visa, you can\n4. How long you can stay\nThis is a temporary visa. You can stay for the time we specify in your visa grant letter.\nYou can usually stay in Australia as long as you are working as an international representative with the relevant privileges and immunities and continue to have the support of DFAT.\nThe visa is granted with multiple entry. You can leave and re-enter Australia as many times as you want while the visa is valid.\nThe visa starts on the date we grant the visa (if you are in Australia at the time of grant) or on the date you enter Australia (if you were outside Australia when we granted it).\n5. Stay longer\nYou can't stay in Australia longer by extending this visa. You must apply for a new visa if you want to stay longer.\nYou can apply for another visa under the Privileges and Immunities stream in Australia if you continue to meet the relevant criteria or you can apply for a different visa.\nSee your options.\n6. Include family\nYou can include members of the family unit in your application when you apply.\nFamily members who apply for the visa must meet our character requirement.\n7. Cost\nThere is no cost for this visa.\nYou might have to pay for police certificates and biometrics.\n8. Apply from\nYou can be in or outside Australia when you apply for the visa and when we decide on your application.\n9. Processing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application can take longer to process if:\nWe can't process your application if you do not pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\n10. Your obligations\nYou and your family must comply with all visa conditions and Australian laws.\nLearn more about conditions for this visa.\n11. Travel\nYou can travel outside Australia and return as many times as you want while the visa is valid.\nThe time you spend outside Australia does not extend the visa.\n12. Visa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nThese must be listed under the International Organisations (Privileges and Immunities) Act 1963 or the Overseas Missions (Privileges and Immunities) Act 1995.\nYou must have a letter of support from the Department of Foreign Affairs and Trade (DFAT) recommending that you should be granted the visa.\nWhile you are in Australia, you must have the financial capacity to support yourself and any dependent family members who come with you.\nYou must continue to be employed:\nYou must do the work or activity specified in your visa application.\nIf you are applying in Australia, you must hold or, in the last 12 months, have held a temporary substantive visa.\nThe visa you hold or have held in the last 12 months can't have been:\nYou and family members aged 16 years and over who apply for the visa with you must meet our character requirement.\nYou are personally liable for all your healthcare costs while you are in Australia. Medical insurance helps limit your financial liability.\nYou and your family must have adequate health cover for the whole of your stay to be granted this visa. Your health insurance should cover you for medically necessary treatment, including transport.\nSee more about health insurance for overseas visitors.\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements.\nYou must only intend to:\nIf you owe the Australian Government money, you must have paid it back or have a formal arrangement to pay it back.\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused see Limitations on applications in Australia.\nIf applying for a visa from outside Australia see Can I go to Australia.\nIf you want immigration assistance, see Who can help with your visa application.\nSee what you need to do if you want to get help with your application.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nGather your documents to prove your identity, show you have financial support and health insurance. Prepare them to submit online.\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nProvide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\nAlso provide:\nDocuments that prove a change of name include:\nProvide:\nLearn more about police certificates.\nTo nominate someone to:\nUpload your written notification or your forms to ImmiAccount.\nProvide:\nProvide either:\nDocuments that prove your de facto relationship include:\nTo prove that you can support yourself and any family you bring to Australia, provide:\nWe can also consider allowances, accommodation and other help from your employer.\nFor every dependant under 18 years old who is applying with you, provide:\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\nThey must complete either:\nAlternatively, you can show us:\nInclude:\nIf the child is not staying with a relative or legal guardian, provide Form 1257 Undertaking declaration (211KB PDF). The person they are staying with must sign the form.\nFor every dependant 18 years old or older who is applying with you, provide:\nYou need to prove that this person is dependent on you. Provide:\nYou must also prove this person has been financially dependent on you for at least 12 months before you apply. You could provide:\nHave all non-English documents translated into English.\nProvide original and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nNote: You do not need to have any documents certified.\nScan or photograph all documents (English and non-English) in colour.\nThe scans and photos must be legible.\nIf a document is more than one page, save it all as one file.\nYou must apply for this visa online. You can be in or outside Australia when you apply.\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nWe will not process your application until you pay the charge.\nEach family member must have their application charge paid and documents attached to their application.\nSee what you can and must do after apply.\nWe will let you know when we have received your application.\nIf it is within standard processing times do not call. We can't provide any further updates on the application's progress.\nYou can see if we have asked for more information in your ImmiAccount.\nIf you are in Australia, you don't have to tell us if you want to travel outside Australia while we process your application. This is because you can be outside Australia when we make a decision.\nBut if you leave Australia, make sure you have a valid visa to return.\nLearn about visa expiry.\nWe might ask for biometrics (fingerprints and photo). We will let you know if you need to provide them.\nIf you did not attach all documents when you applied, attach them as soon as possible in ImmiAccount.\nWe might also ask you to provide more information.\nIf you are in Australia, make sure you stay lawful by holding a valid visa while we process your application.\nIf you applied for this visa in Australia and the application was assessed as valid, you were granted a bridging visa. If your current visa expires before we decide on your application, the bridging visa will start. You can stay in Australia on the bridging visa while we process your new visa application.\nLearn more about visa expiry\nYou can add members of the family unit to your application after you apply but before we decide on your visa.\nYour family members must apply separately if you do not include them in your application for this visa.\nTo apply separately your family members will need to complete an application for a Temporary Activity, International Relations or Training Visa (Subsequent entrant) (403,407,408) form in ImmiAccount.\nFind out what to do if your child is born after you apply.\nLet us know as soon as you can.\nComplete Form 1023 Notification of incorrect answers (168KB PDF).\nLet us know if you no longer want someone to:\nUpload your written notification or your forms to ImmiAccount.\nFor more information see Who can help you with your application.\nThings you need to let us know about include:\nSee how to tell us if your situation changes.\nYou can be in or outside Australia when we decide on your visa application.\nWe will let you know our decision in writing.\nIf we grant your visa, we will tell you:\nKeep a copy of the decision.\nIf we refuse your visa, we will tell you:\nWe will not refund the application charge if we refuse your application.\nYou must have:\nAll people arriving Australia must complete the Incoming Passenger Card. You will be given this card onboard.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nTo see your specific conditions and work entitlements use VEVO.\nYou and your family members must meet all visa conditions and obey Australian laws.\nSee your conditions in VEVO.\nLearn more about visa conditions and how they work.\nThings you need to let us know about include:\nSee how to tell us if there is a change in your situation.\nTo see when you must leave, use VEVO.\nYou can't stay in Australia longer by extending this visa. You must apply for a new visa if you want to stay longer.\nYou can travel outside Australia and return as many times as you want while the visa is valid.\nTime spent outside Australia does not extend the visa.\nSee your conditions in VEVO.\nTo prove you have a visa and show your conditions to someone, use VEVO.\nRequest your international movement records to get proof of your travel in and out of Australia.\nTo see your conditions for work, use VEVO.\nIf you have permission to work, you are protected by Australian workplace law. See your workplace rights and entitlements.\nYour family members must apply separately if you do not include them in your application for this visa.\nTo apply separately your family members will need to complete an application for a Temporary Activity, International Relations or Training Visa (Subsequent entrant) (403,407,408) form in ImmiAccount.\nYou must have a valid passport or other travel document to leave Australia.\nEnsure your visa is still valid.\nSee what to do if your visa has expired or is about to expire.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nYou are likely to have some money in a superannuation fund if you worked in Australia and you are:\nSee how to access your super.\nTo get proof of your travel in and out of Australia request your international movement records."
}