{
    "visaID": "visa2.3",
    "visaType": "visa2",
    "visaName": "Training visa (subclass 407)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/training-407",
    "content": "\n1. Subclass 407\n2. Training visa\n3. For Applicants\n4. For Sponsors\nThis is a temporary visa. We might grant you a visa allowing you to stay in Australia for up to 2 years.\nFrom AUD415.00 for the main applicant.\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nSee all conditions\nIf you are getting help with your visa, before you pay someone, read information on Who can help with your visa application.\nApply\n5. With this visa, you can\n6. Nomination types\nThis visa allows people to take part in workplace-based training to improve their skills for their job, area of tertiary study, field of expertise or in a professional development training program in Australia.\nNomination requirements are different depending on the purpose or type of training.\nThere are 3 types of occupational training covered by this visa:\nNomination is the stage where the sponsor provides details about the nominee (intended trainee), the purpose or type of training and how and where the training will be provided.\n7. How long you can stay\nThis is a temporary visa.  We might grant you a visa stay in Australia for up to 2 years.\nYou can leave and re-enter Australia on the visa while it is valid.\n8. Stay longer\nYou can't stay in Australia longer by extending this visa.\nYou can apply for another visa. Explore visa options.\n9. Include family\nYou can include members of the family unit in your application when you apply\nFamily members who apply for the visa with you must also meet our health and character requirements.\nIf you apply for this visa from outside Australia, family members who are not coming to Australia might also have to meet our health requirements.\nFind out what to do if your child is born after you apply or when you hold your visa.\nIf we grant you the visa, your family members might be able to apply to join you in Australia later as a subsequent entrant.\nThey can do this using the Temporary Work and Activity Visa (Subsequent Entrant) (403,407,408) form in ImmiAccount.\nFamily members applying subsequently should :\n10. Cost\nThe visa costs from AUD415.00 for the main applicant.\nThere is also a charge for each family member who applies for the visa with you.\nYou might also have to pay other costs for health checks, police certificates and biometrics.\nTo work out what your visa will cost, use the Visa Pricing Estimator. The estimator does not take into account the other costs.\n11. Apply from\nYou can be in or outside Australia when you apply for the visa and when we decide on your application.\n12. Processing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application might take longer to process if:\nWe can't process your application if you do not pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\n13. Your obligations\nYou and your family members must obey all Australian laws.\nLearn more about conditions for this visa.\n14. Travel\nYou can travel outside Australia and return as many times as you want while the visa is valid.\nThe time you spend outside Australia does not extend the visa.\n15. Visa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n16. Financial support\nYou will need to be able to financially support yourself while in Australia. You will need to be able to financially support accompanying family members.\n17. Changing sponsors\nIf you decide to train with another organisation while you are in Australia, you will need to be sponsored by that organisation. They must submit a new nomination for you.\nWhen the new nomination is approved you can do your occupational training with that organisation for the time remaining on your visa.\nYou do not have to apply for a new visa, as long as you continue to do the training program your visa was approved for.\nIf your occupational training program changes, you need to submit a new visa application.\nIf your sponsor ends your training you must tell us. You may try to find another organisation to sponsor you.\n18. Apply for a new visa\nIf you want to apply for a new Training visa (subclass 407) you will need continuing sponsorship. You may have to provide an explanation of why you were unable to complete the training within the initial training period.\nYour sponsor must be approved as a temporary activities sponsor.\nYour sponsor must have nominated you to participate in a program of occupational training unless your sponsor is a Australian Commonwealth Government agency.\nNomination requirements are different depending on the purpose or type of training.\nThere are 3 types of occupational training covered by this visa:\nUsually, you must be 18 years old or older at the time we decide your visa application.\nIf you are applying in Australia, you must currently hold a valid temporary substantive visa that is not a:\nIf you are in Australia and do not hold a substantive visa, your last substantive visa must not have been one of the above visas and your application must be made within 28 days:\nYou and any family members who apply for the visa with you must meet our health requirement.\nYou and family members aged 16 years and over who apply for the visa with you must meet our character requirement.\nWe might also ask that other family members meet the requirement.\nYou are personally liable for all your healthcare costs while you are in Australia. Medical insurance helps limit your financial liability. You must maintain adequate health cover for the whole of your stay if you are granted this visa. Your insurance should cover you for medically necessary treatment, including transport.\nSee a guide to what we consider adequate health insurance.\nSee more about health insurance for overseas visitors.\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements.\nYou must only intend to:\nYou must have substantially complied with the conditions of the last substantive or subsequent bridging visa that you held.\nYou must have functional English.\nIf you are 18 years of age or older, you must:\nIf you or any family members (including those who don't apply for the visa with you) owe the Australian government money, you or they must have paid it back or arranged to pay it back.\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused see Limitations on applications in Australia.\nIf applying for a visa from outside Australia see Can I go to Australia.\nIf you want immigration assistance, see Who can help with your visa application.\nWe might not grant this visa if it is not in the best interests of an applicant under 18.\nBefore you apply, you have to make sure your sponsoring organisation has applied to be or has been approved as a sponsor. Your sponsoring organisation must also have submitted a nomination application. Australian Commonwealth Government agencies don't have to nominate.\nDon't arrange travel until we tell you in writing you have the visa.\nIf you plan to get a new passport, you should do so before applying for this visa. If you get a new passport after you have submitted your application, you must tell us of this change in writing. You can do this using ImmiAccount.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nGather documents to prove your identity and show you have a sponsor, nomination or government invitation, financial support and health insurance. You will need to prepare them to submit online.\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nWe need proof of your identity. If you can't prove your identity:\nProvide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\nAlso provide:\nDocuments that prove a change of name include:\nYou need to provide:\nIf this is a volunteer position, you and your sponsor need to complete the Acknowledgement of unpaid placement forms.\nYour sponsor should submit these forms with the nomination.\nYou will need to show evidence of your financial capacity to support yourself and your family while you are in Australia, such as:\nYou will need to provide evidence of adequate health insurance for you and your family members for the duration of your stay in Australia.\nProvide evidence that you have functional English language skills to undertake the training programme.\nYou do not need to provide these results if you hold a valid passport from:\nIf you are sponsored by a Australian Commonwealth Government agency, provide a copy of the invitation to participate in the training.\nIf you are not sponsored by a Australian Commonwealth Government agency, provide a copy of the nomination approval letter or receipt for submitting the nomination application.\nAlso provide a copy of your qualifications and curriculum vitae (CV).\nIf registrations or licences are required for you to do the training, provide copies of registrations or licences.\nIf you are sponsored by a Australian Commonwealth Government agency, provide a copy of the invitation to participate in the training.\nIf you are not sponsored by a Australian Commonwealth Government agency, provide a copy of the nomination approval letter or receipt for submitting the nomination application.\nProvide a statement from your sponsor confirming they are satisfied:\nProvide a signed letter on company letterhead from your current manager detailing your current position and duties.\nAlso provide a copy of your qualifications and curriculum vitae (CV).\nYou must provide a letter from the relevant regulatory body for the occupation in Australia or your home country. This letter must :\nIf you are a health practitioner treating patients as part of your occupational training you must:\nProvide an Australian police certificate if you have spent a total of 12 months or more in Australia in the last 10 years since you turned 16. We only accept complete disclosure National Police Certificates issued by the Australian Federal Police. We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police.\nAlso provide military service records or discharge papers if you served in the armed forces of any country.\nDepending on your circumstances, we may ask you to also provide an overseas police certificate from every country, including your home country, where you spent a total of 12 months or more in the last 10 years since you turned 16.\nComplete and provide the following forms:\nTo nominate someone to:\nUpload your written notification or your forms to ImmiAccount.\nProvide your partner's:\nFor de facto relationships provide either:\nFor both married and de facto applicants you must provide evidence that you are in a genuine and continuing relationship. Evidence can include but is not limited to:\nFor every dependant 18 years old or younger who is applying with you, provide:\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\nThey must complete either:\nAlternatively, you can show us:\nInclude:\nTo include your child who is over 18 in your visa application, they must be:\nProvide:\nYou must also provide proof the child is dependent on you:\nHave all non-English documents translated into English.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nNote: You do not need to have any documents certified.\nScan or photograph all documents (English and non-English) in colour.\nThe scans and photos must be clear.\nIf a document is more than one page, save it all as one file.\nKeep a copy of your completed application.\nYou must apply for this visa online.\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nSee what you can and must do after you apply.\nIf it is within standard processing times do not call. We can't provide any further updates on the application's progress.\nYou can see if we have asked for more information in your ImmiAccount.\nMake sure you stay lawful by holding a valid visa while we process your application.\nIf you were in Australia when you applied for this visa, you were granted a Bridging visa A (BVA). If your current visa expires before we decide on your application, the BVA will start. You can stay in Australia on the BVA while we process your new visa application. You cannot travel on the BVA - there is no right of return on this visa; it cancels on departure.\nDo not cancel your current visa. If you do, you will:\nLearn more about visa expiry.\nYou do not have to tell us if you want to travel outside Australia while we process your application. This is because you can be outside Australia when we make a decision.\nBut if you leave Australia, make sure you have a valid visa to return.\nLearn about visa expiry.\nWe will let you know if you need health examinations.\nWe might ask for biometrics. We will let you know if you need to provide them.\nIf you did not attach all your documents when you applied, attach them as soon as possible in ImmiAccount.\nWe might also ask you to provide more information.\nYou cannot add members of the family unit to your application after you apply but before we decide on your visa, unless it is a child born after you apply but before we make a decision on your visa.\nIf your child is born after you apply but before we make a decision on your visa, then your child is considered to have made the same visa application as you.\nYou must tell us as soon as possible and give us:\nAttach supporting documents including the child's passport if available to your ImmiAccount.\nIf we grant you the visa, your family members might be able to apply to join you in Australia later as a subsequent entrant. They can do this using the Temporary Work and Activity Visa (Subsequent Entrant) (403,407,408) form in ImmiAccount.\nFind out what to do if your child is born after you apply or when you hold your visa.\nLet us know as soon as you can if you made a mistake on your application.\nComplete Form 1023 Notification of incorrect answers (168KB PDF)\nLet us know if you no longer want someone to:\nUpload your written notification or your forms to ImmiAccount.\nFor more information see Who can help you with your application.\nThings you need to let us know about include:\nSee how to tell us if your situation changes.\nWe will let you know in writing our decision about your visa application. We will tell you:\nKeep a copy of the decision with you when in Australia.\nIf we refuse your visa we will let you know in writing. We will tell you why we refused and whether you have a right to a review of the decision.\nWe will not refund the application charge if we refuse your application.\nIf we have granted you a Training (subclass 407) visa, you may want to consider withdrawing any other undecided visa applications you have lodged with us.\nWe will continue to progress any undecided visa applications. If they meet the requirements it may result in your current visa ceasing. It may also affect your eligibility for government benefits such as Centrelink or Medicare.\nTo withdraw any other visa application, you must tell us in writing.  More information is available on our website at You want to withdraw an application.\nYou must have:\nAll people arriving Australia must complete the Incoming Passenger Card. You will get the card on board.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nTo see your specific conditions, work and study entitlements, use VEVO.\nYou and your family members must meet all visa conditions that apply and obey all Australian laws.\nCheck your conditions in VEVO or your visa grant letter.\nThings you need to let us know about when you have this visa include:\nSee how to let us know if there is a change in your situation.\nThis is a temporary visa. You can stay until your visa expires. To see when your visa expires use VEVO.\nYou can't stay in Australia longer by extending this visa. You must apply for a new visa if you want to stay longer.\nYou can travel outside Australia and return as many times as you want while the visa is valid.\nThe time you spend outside Australia does not extend the visa.\nTo prove you have a visa and show your conditions to someone, use VEVO.\nYou and your family are protected by Australian workplace law.  See their workplace rights and entitlements.\nFamily members who are granted the same visa with you can only work up to 40 hours every two weeks in Australia.\nTo see your and your family's conditions for work, use VEVO.\nYour family members who did not apply for the visa with you might be eligible to apply as a subsequent entrant after the visa is granted.\nApply for a subsequent entrant visa using the Temporary Work and Activity Visa (Subsequent Entrant) (403,407,408) form in ImmiAccount.\nFind out what to do if your child is born after you apply or when you hold your visa.\nYou must have a valid passport or other travel document to leave Australia.\nCheck your conditions and the expiry of your current visa in VEVO.\nSee what you can and must do if your visa has expired or is about to expire.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nYou are likely to have some money in a superannuation fund if you worked in Australia and you are:\nSee how to access your super.\nRequest your international movement records to get proof of your travel in and out of Australia."
}