{
    "visaID": "visa3.18.2",
    "visaType": "visa3.18",
    "visaName": "Partner (Migrant) visa",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/partner-offshore/migrant-100",
    "content": "\n1. Subclass 100\n2. Partner (Migrant) visa\n3. For Applicants\n4. For Sponsors\nPermanently.\nYou paid for this visa when you made your combined application for the temporary and permanent partner visas.\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nThe processing time for a permanent Partner visa starts from the date of eligibility. This is 2 years after you applied for the combined temporary, provisional and permanent partner visas.\nIn addition to what you can do on your subclass 309 visa, you can:\nSee all conditions\nIf you are getting help with your visa, make sure you read information on Who can help with your visa application.\nApply\n5. With this visa you can\n6. How long you can stay\nThis is a permanent visa.\nYou become a permanent resident on the day we grant the visa.\n7. Your obligations\nYou and your family members must meet all visa conditions and obey Australian laws.\nFor more information see Check visa details and conditions.\n8. Travel on this visa\nIf you are outside Australia at the time of visa grant, you must enter Australia before the first entry arrival date (initial arrival date) specified in your grant letter.\nYou can travel to and from Australia as many times as you want for 5 years from the date we grant this visa. This is as long as the travel facility on this visa remains valid.\nIf you want to travel after the initial 5-year travel facility you will need to apply for and be granted a Resident Return (RRV). This will allow you to travel to Australia as a permanent resident.\nTo see when your travel facility ends, use VEVO.\n9. Include family members\nYou can include members of the family unit in your application when you apply for the temporary Partner visa (subclass 309). Members of the family unit who apply with you must also be outside Australia\nTo include a dependent child in your permanent Partner visa (subclass 100) application after we have granted you a subclass 309 visa, your child must first apply for a Dependent child visa (subclass 445).  We can grant your child the subclass 100 visa if they are members of the family unit and meet all other criteria.\nYou cannot add any family members after we grant the permanent Partner visa (subclass 100).\nIf you have a dependent child who does not hold a subclass 309 visa, you can add them to your permanent Partner visa (subclass 100) application before we make a decision on your permanent visa application.\nYour child must hold a Dependent Child visa (subclass 445) and can be in or outside Australia.\nOnce your child holds a subclass 445 visa, complete and attach to your ImmiAccount, Form 1002 - Application by a subclass 445 dependent child for a permanent partner visa (279KB PDF).\nAfter you have attached the form to ImmiAccount, let us know by using the Partner Processing Enquiry Form.\nIf you have a baby after you have applied for this visa, you will need to let us know. For more information, see You had a baby.\n10. Cost\nYou paid for this visa when you applied for the combined temporary and permanent partner visas.\nYou might have to pay other costs for health or police checks.\n11. Processing times\nThe processing time for a permanent Partner visa starts from the date of eligibility. This is 2 years after you applied for the combined temporary and permanent partner visas.\nWe update processing times regularly. We assess all applications on a case by case basis. Complex cases may take longer to process. You should use published processing times as a guideline only.\nYour application can take longer to process if:\n12. Visa label\nYou will not get a label in your passport. We will digitally link your visa to your passport and create a digital visa record for you.\n13. Frequently asked questions\nYou can find the answers to common questions about this visa at Partner Program Frequently Asked Questions (FAQs).\nYou must hold either a Partner (Provisional) visa (subclass 309) or a Dependent Child (subclass 445) visa.\n2 years must have passed since you applied for the combined 309 and 100 visa for you to be eligible to be assessed for the permanent visa.\nIf you were in a long-term relationship or your sponsor held a specific visa before you applied, you might be granted the permanent visa in less than 2 years. We will let you know if this applies to you.\nYou must continue to be the spouse or de facto partner of the same person who sponsored you for the temporary Partner visa.\nYou must:\nYou might still be eligible for the permanent visa if your relationship ends or your partner dies before we grant the permanent visa. For more information see Your relationship has changed.\nIf you are experiencing domestic and family violence, we may be able to help you. You may still be eligible for the grant of your permanent visa. For more information, see Domestic and family violence and your visa.\nIf you or any family members owe the Australian Government money, you or they must pay it back or arrange to pay it back.\nThis may include family members who do not accompany you to Australia.\nWe might not grant this visa if it is not in the best interests of an applicant under 18.\nIf we granted you a permanent Partner visa (subclass 100) immediately after we granted your temporary Partner visa (subclass 309), you do not have to provide these documents or do anything else. If we did not, you need to provide further documents.\nTo check which visa you currently hold, use VEVO.\nYou can appoint anyone to receive documents on your behalf, relating to your visa application.\nTo appoint someone to receive your correspondence, use Form 956A Appointment or withdrawal of an authorised recipient.\nIf you need help with your application, you can appoint someone to give you immigration assistance. A person who gives you immigration assistance can:\nWe treat any correspondence they send as if it came from you.\nIt is important to provide your own contact details in case we need to contact you directly about your application. The partner visa application form will ask you for your own phone number and email address.\nIf you appoint someone to give you immigration assistance they must be one of the following:\nTo appoint someone to provide immigration assistance, use Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF).\nFor more information, see who can help you with your application.\nYou are eligible for consideration of the permanent Partner visa two years after you apply for the combined temporary and permanent partner visas.\nOnce two years have passed since you first applied, you can submit your documents for the permanent stage of your Partner visa. Do not send them before this time.\nMake sure you provide all required information with your application. Applications with all required information can be processed faster.\nEnsure that all information you provide is accurate. As a visa applicant, you must prove your identity and provide true information with your application.\nFor more information, see Providing accurate information.\nProvide a copy of the pages of your most recent passport. It must show your photo, personal details, signature, passport issue and expiry dates.\nTo show that you meet our character requirements you may need to provide a current Australian police certificate. You usually need to provide this police certificate for the permanent stage of your Partner visa if you did not attach one with your subclass 309 application.\nWe may ask you to provide a new Australian police certificate, if your previous certificate has expired. For immigration purposes, police certificates are valid for 12 months from the issue date.\nWe only accept complete disclosure National Police Certificates issued by the Australian Federal Police. We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police.\nTo get an Australian police certificate see National Police Checks.\nYou also need to provide an overseas police certificate from any country, including your home country, where you spent a total of 12 months or more since the grant of your 309 visa.\nTo get an overseas police certificate, see Offices outside Australia.\nYou need to provide evidence you are still in a relationship with your partner.\nThis evidence must show that:\nYou can also provide further information in support of your visa application. You can provide:\nAttach to your ImmiAccount a Commonwealth statutory declaration form. This form must be completed by your sponsor with information about any of the following:\nIf you are married, provide your marriage certificate or other evidence that your marriage is valid in Australia.\nIf you are a de facto partner, provide proof of your de facto relationship.\nTo show you are still in a relationship with your partner, you can provide the below supporting evidence of your relationship.\nEvidence you and your partner share financial matters. This evidence can include:\nEvidence you and your partner share domestic matters. This evidence can include:\nEvidence that others know about your relationship.\nYou must provide statements from 2 witnesses who:\nStatements from witnesses can be done by completing Form 888 – Supporting statement in relation to a Partner or Prospective Marriage visa application (170KB PDF).\nIf the witness is an Australian citizen or permanent resident, provide evidence of this such as a passport or birth certificate.\nEvidence can also include:\nEvidence you are committed to a long-term relationship with each other. This evidence must show that you:\nYou can also provide the terms of your wills as evidence.\nFor every family member who currently holds a subclass 309 or 445 visa, provide copies of:\nYou may need to complete the Notification of Relationship Cessation form in ImmiAccount.\nTo confirm, check Your relationship has changed.\nIf you do not have access to ImmiAccount, you can notify us directly using the Partner Processing Enquiry Form.\nYou might still be eligible for the permanent visa if your relationship ends or your partner dies. All information you provide is confidential.\nIf you are experiencing domestic and family violence, we may be able to help you. You may still be eligible for the grant of your permanent visa. For more information, see Domestic and family violence and your visa.\nTell us if things change after you apply but before we've made a decision.\nThings you need to let us know about include:\nFor more information, see Change in your situation.\nIf you are unable to upload the relevant documents to your application in ImmiAccount, you need to contact us using the Partner Processing Enquiry Form.\nHave all documents translated into English.\nProvide original and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nScan or photograph all documents (English and non-English) in colour.\nThe scans and photos must be clear enough to read.\nIf a document is more than one page, save it all as one file.\nYou do not need to have any documents certified.\nYou are eligible for consideration of the permanent Partner visa two years after you apply for the combined temporary and permanent partner visas.\nOnce two years have passed since you first applied, you can submit your documents for the permanent stage of your Partner visa. Do not attach them before this time.\nAttach a document only once, even if you are using it to show more than one thing.\nClearly label your documents.\nKeep a copy of your completed application.\nYou can attach up to 100 documents for each person on your application.\nThe attachment limit cannot be increased.\nIf you reach the attachment limit for an applicant, you can attach more documents to other clients on the application.\nYou can find the answers to common questions about this visa at Partner Program Frequently Asked Questions (FAQs).\nYou can track and manage your application using ImmiAccount.\nFor help managing your application in ImmiAccount, see ​​​​​​​​​​​​​​​​​​​​​​​​​​​Applying online in ImmiAccount.\nTo help ensure your application is processed as quickly as possible, attach all necessary supporting documents to your application. The checklist provided on Applying online in ImmiAccount will help in making sure you include all required documents in your application.\nIf it is within standard processing times do not contact us. We cannot provide any further updates on your application's progress. You can see if we have asked for more information in your ImmiAccount.\nTo see standard processing times for this visa, see Global processing times.\nYou can find the answers to common questions about this visa at Partner Program Frequently Asked Questions (FAQs).\nIf you did not attach all documents when you applied, attach them as soon as you can in ImmiAccount.\nWe might ask you to provide more information.\nFor more information on attaching documents in ImmiAccount, see Applying online in ImmiAccount.\nIf you are unable to upload the relevant documents to your application in ImmiAccount, you need to contact us using the Partner Processing Enquiry Form.\nYou can add a dependent child  to your application before we make a decision on your permanent visa application. Your child can be in or outside Australia and must:\nOnce your child holds a subclass 445 visa, complete and attach to your ImmiAccount, Form 1002 - Application by a subclass 445 dependent child for a permanent partner visa.\nAfter you have attached the form to ImmiAccount, let us know by using the Partner Processing Enquiry Form.\nIf you have a baby after you have applied for this visa, you will need to let us know. For more information, see You had a baby.\nAfter you have attached the form to ImmiAccount, let us know by using the Partner Processing Enquiry Form.\nTell us if things change after you lodge your documents but before we have made a decision.\nThings you need to let us know about include:\nFor more information, see Change in your situation.\nIf you are unable to upload the relevant documents to your application in ImmiAccount, you need to contact us using the Partner Processing Enquiry Form.\nYou may need to complete the Notification of Relationship Cessation form in ImmiAccount.\nTo confirm, check Your relationship has changed.\nIf you do not have access to ImmiAccount, you can notify us directly using the Partner Processing Enquiry Form.\nYou might still be eligible for the permanent visa if your relationship ends or your partner dies. All information you provide is confidential.\nIf you are experiencing domestic and family violence, we may be able to help you.\nYou may still be eligible for the grant of your permanent visa. For more information, see Domestic and family violence and your visa.\nLet us know if you no longer want someone to:\nAfter you have attached the form to ImmiAccount , let us know by using the Partner Processing Enquiry Form.\nFor more information see Who can help you with your application.\nLet us know as soon as you can if you have made a mistake on your application.\nFor more information see After you apply.\nIf you are unable to update your application in ImmiAccount, you need to contact us using the Partner Processing Enquiry Form.\nYou can be in or outside Australia when we decide on your permanent Partner visa.\nWe will let you know our decision in writing.\nIf we grant your visa, we will tell you:\nKeep a copy of this decision.\nIf we refuse your visa, we will tell you why we refused the visa and  whether you have a right to a review of the decision.\nWe will not refund the application fee if we refuse your application.\nThis is a permanent visa.\nYou become a permanent resident on the day we grant the visa.\nFor more information, see Permanent resident.\nYou and your family members must meet all visa conditions and obey Australian laws.\nFor more information see Check visa details and conditions.\nIf you are outside Australia at the time of visa grant you must enter Australia before the first entry arrival date (initial arrival date) specified in your grant letter.\nIf the date has passed or will pass before you can travel to Australia, you must ensure that you:\nWe may then send you a travel facilitation letter to state that you can enter Australia after the first entry arrival date of your visa.\n\nWe will not issue a travel facilitation letter unless there is less than 3 months remaining on your first entry arrival date.\nYou can travel to and from Australia as many times as you want for 5 years from the date we grant this visa. This is as long as the travel facility on this visa remains valid.\nIf you want to travel after the initial 5-year travel facility you will need to apply for and be granted a Resident Return (RRV). This will allow you to travel to Australia as a permanent resident.\nTo see when your travel facility ends, use VEVO.\nIf an immigration officer processes your clearance at our border, tell them:\nIf you do not tell them, you might be granted a 444 visa. Grant of a subclass 444 visa will override your permanent visa and might affect your eligibility for Australian citizenship.\nYou cannot add family members to your visa application after we grant the permanent Partner visa (subclass 100).\nAs an Australian permanent resident, you might be able to sponsor eligible family members to come to Australia.\nTo find a visa for your family members, explore visa options.\nTo prove you have a visa and show your conditions to someone, use VEVO.\nAustralian visas are digital. We do not put a visa label in your passport. Instead, we link your digital visa record to your passport.\nYour visa number is contained in your visa grant letter. Use this number to access your digital visa record in VEVO.\nYour digital visa record is also used by:\nTo get proof of your travel in and out of Australia, request your international movement records.\nWith this visa you will have full work rights and be protected by Australian workplace law. See your workplace rights and entitlements.\nWith this visa you will be able to study in Australia. To find out what study you may be eligible for see StudyAssist.\nYou might have to wait to access certain Australian Government payments and benefits. Learn more about newly arrived residents' waiting periods from Services Australia.\nLet us know if you get a new passport.\nSee what to do if you have a new passport.\nAfter a certain time, you may be eligible for Australian citizenship. Find out more about becoming a citizen.\nFor citizenship purposes, your permanent residency starts on either the day your visa was granted if you were in Australia or the day you first entered Australia on this visa after it was granted."
}