{
    "visaID": "visa3.7",
    "visaType": "visa3",
    "visaName": "Child visa (subclass 101)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/child-101",
    "content": "\n1. Subclass 101\n2. Child visa\n3. For Applicants\n4. For Sponsors\nPermanently\nFrom AUD3,140.00\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nSee all conditions\nThe child may be eligible for COVID-19 visa concessions.\nIf you are getting help with your visa, before you pay someone, read information on who can help with your visa application.\n5. With this visa the child can\nThe child can travel to and from Australia as many times as they want for 5 years from the date we grant this visa. This is as long as the travel facility of this visa remains valid.\nIf the child wants to travel after the initial 5-year travel facility:\nTo see when the child's travel facility ends, use VEVO.\nTo be granted this visa, an adopted child must have been adopted before they turned 18 by a parent who was not an Australian citizen, permanent resident or eligible New Zealand citizen at the time of adoption.\nA child adopted before they turned 18 by a parent who was already an Australian citizen, permanent visa holder or eligible New Zealand citizen at the time of adoption might be eligible for an Adoption visa (subclass 102).\n6. How long the child can stay\nThis is a permanent visa. It lets the child stay in Australia indefinitely.\n7. Include other children\nIf the child has siblings who also want to apply, submit separate applications for each sibling.\nThe child's dependent children can be included on their application when they apply or at any time before we decide the application.\nDependent children of the child who apply for the visa must meet our health requirement.\nFamily members who are not coming to Australia might also have to meet our health requirement.\n8. Cost\nThe visa costs AUD3,140.00 for the main applicant.\nThere is also a charge for each of the child's dependent children who apply for the visa.\nThere might be other costs for health exams, police certificates and biometrics.\nTo work out what the visa might cost use the Visa Pricing Estimator. The estimator does not take into account the other costs.\n9. Apply from\nThe child must be outside Australia when the application is submitted.\n10. Processing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nThe application might take longer to process if:\nWe can't process the application if the correct visa application charge is not paid. We will let the applicant know if this is the case and if necessary return the application.\n11. The child's obligations\nThe child must enter Australia before the date specified in their grant letter. The first entry date is generally set at 12 months from the date of visa grant.\nThe child and their family members must meet all visa conditions and obey Australian laws.\nSee what conditions might be attached to this visa on our visa conditions page.\n12. Visa label\nWe will digitally link the child's visa to their passport. They will not get a label in their passport.\nThe child must be dependent on a parent who is:\nThey can be their parent's:\nA child does not meet the dependency requirement if the stepparent is the current spouse or de facto partner of the child’s biological or adopted parent.\nTo be eligible for this visa, an adopted child must have been adopted before they turned 18 by a parent who was not an Australian citizen, permanent visa holder or eligible New Zealand citizen at the time of adoption.\nA child adopted before they turned 18 by a parent who was already an Australian citizen, permanent visa holder or eligible New Zealand citizen at the time of adoption might be eligible for an Adoption visa (subclass 102).\nTo be eligible for this visa, a stepchild must:\nThe step-parent must also have either:\nThe child may choose to apply for Australian citizenship by descent instead of a visa to travel to Australia, if:\nThe child must be sponsored by an eligible parent or their parent's spouse or de facto partner.\nWe must approve the sponsorship. We might not approve sponsorship if the parent or their partner has been charged or convicted of offences involving children. Learn more about measures for the protection of children.\nThe child must be either:\nIf the child is over 18 and under 25 years old they:\nThe child is a full-time student if they are:\nThe child should have started study since turning 18 years of age or within 6 months (or a reasonable time) of finishing school. Any gaps of more than 6 months between their final year of school and the start of their further studies must be explained.\nIf the child is 18 years or older with a disability, they:\nThe child can't be or ever have been:\nThe child and any dependants who apply for the visa with them must meet our health requirement.\nDependent children who are not applying for the visa might also need to meet our health requirement.\nIf the child is aged 16 years or over they must meet our character requirement.\nWe might also ask that other family members meet the requirement.\nIf the child or any member of their family owes the Australian Government money it must be paid back or there must be a formal arrangement to pay it back.\nChildren aged 18 or older must:\nWe will only grant this visa to a child younger than 18 years if either:\nWe might not grant this visa if it is not in the best interests of an applicant under 18.\nCheck the child's passport is valid. Tell us if someone is acting on the child's behalf.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nProvide documents in support of the visa application.\nProvide accurate information. See what happens if the child's identity can't be established or false information is provided.\nProvide the pages of the child's current passport showing their photo, personal details, and passport issue and expiry dates.\nAlso provide:\nDocuments that prove a change of name include:\nIf the child was adopted, provide certified copies of the adoption papers or the adoption compliance certificate.\nProvide 4 recent passport-size photos (45mm x 35mm) of the child and for any dependent child included in the application.\nPhotographs must be:\nThe child can wear untinted prescription glasses. If the child wears a head covering for religious reasons, they can show only their face.\nProvide a certified copy of the passport or travel document the child will use to enter Australia and any passports the child has held since then.\nDepending on the child's situation, we might require other documents.\nProvide evidence the child is enrolled as a full-time student and actively participating in a post-secondary course of study.\nProvide a statement to explain any gaps longer than 6 months between their final year of secondary school and further studies.\nProvide evidence from a qualified medical practitioner the applicant has a total or partial loss of mental or body function that stops them from working.\nProvide evidence the child is related to the parent, such as:\nIf the child is over 18 when the application is made, provide evidence they are dependent on their parent for basic needs such as food, shelter and clothing, and how long this support has been provided. Evidence could include:\nFor every dependant under 18 years old who is applying with the child, provide:\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who has a legal right to decide where the child lives.\nThey must complete either:\nInclude an identity document with the signature and photo of the person who completed the form or declaration, such as a:\nAlternatively, you can show us:\nChildren over 16 years must provide  police certificates from every country they have spent 12 months or more in the last 10 years, since turning 16.\nFor Australia, we only accept National Police Certificates applied for under Code 33 – Immigration/Citizenship. The Australian Federal Police issue these certificates. We don't accept standard disclosure certificates or certificates issued by Australian state or territory police.\nFor immigration purposes, police certificates are valid for 12 months from the issue date.\nIf anyone in the application served in the armed forces of any country, they must provide military service records or discharge papers.\nChildren over 16 years must complete and provide Form 80 Personal particulars for assessment including character assessment (596KB PDF).\nTo nominate someone to:\nSend written notification or your forms with your paper application.\nHave all non-English documents translated into English.\nProvide original and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nHave all documents certified. This includes:\nPhotographs of the child and any of their dependent children included in the application must also be certified.\nKeep a copy of the completed application.\nSend us:\nYou must apply for this visa on paper.\nProvide accurate information. See what happens if you can't prove the child's identity or don't provide true information.\nComplete the following 2 forms and send them together by post (with correct prepaid postage) or by courier to the Child and Other Family Processing Centre in Perth.\nYou must pay the application charge before you post your application. See how to pay.\nWe will not process your application until you pay the application charge. Your application should also include evidence of payment of the application charge and all the relevant supporting documentation.\nIf you submit your application at any other office or in any other way, it will not be a valid application and cannot be considered further.  Applications for this visa cannot be submitted in person.\nThe forms must be completed in English.\nBy post (with correct prepaid postage):\nDepartment of Home Affairs\nChild and Other Family Processing Centre\nLocked Bag 7\nNORTHBRIDGE WA 6865\nBy courier:\nDepartment of Home Affairs\nChild and Other Family Processing Centre\nWellington Central\n836 Wellington Street\nWEST PERTH WA 6005\nIf any of the above steps are incomplete, your application may be invalid. We do not process invalid applications. We will notify you if this is the case, and if requested, return your application.\nDo not send original documents with your application, only send certified copies. Keep a copy of your completed application for your own records, including any supporting documents.\nWe will let the applicant know when we have received the application and documents. There might be other things to do or be aware of after applying.\nWe can't provide updates on the progress of the application within global visa processing times. We will tell you if we need anything further.\nDo not arrange for the child to migrate to Australia until we let you know, in writing, that we have granted the visa.\nWe will tell you when to arrange the child’s health examinations.\nWe might ask for biometrics. We will tell you if you need to provide them.\nIf you lodged the application on or after 1 April 2020:\nIf you lodged the application before April 2020:\nWe might also ask you to provide more information.\nYou can add a child's dependent child to their visa application any time before we make a decision.\nFind out what to do if your child is born after you apply.\nTell us as soon as you can if you have made a mistake on the application.\nComplete Form 1023 Notification of incorrect answers (168KB PDF).\nLet us know if you no longer want someone to:\nSend written notification or your forms to the office your submitted your application.\nFor more information see Who can help you with your application.\nThings you need to let us know about after the child has applied include:\nSee how to tell us if your situation changes.\nWe can grant a visa to any child who is outside Australia and meets the visa grant requirements.\nThis may not apply if you are eligible for a COVID-19 visa concession.\nWe will tell you our decision in writing. Keep a copy of the decision.\nIf we grant the child’s visa, we will tell you:\nIf we refuse the child’s visa, we will tell you:\nWe will not refund the application fee if we refuse the application.\nThe child must have:\nThe child must enter Australia before the date specified in their grant letter.\nIf the child’s visa is still valid and the date specified in their visa grant letter has passed or will pass before they can travel to Australia, they must ensure that:\nWe may then send the child a travel facilitation letter. This will state that we allow them to enter Australia after the first entry arrival date on their visa.\nWe will not issue a travel facilitation letter unless there is less than 3 months remaining on the child’s first entry arrival date.\nAll people arriving into Australia must complete the Incoming Passenger Card.\nWe have an automated process that uses facial recognition technology and your ePassport. Children aged 16 or over might be able to leave the airport using the SmartGate.\nThe child and their family members must meet all visa conditions and obey Australian laws.\nYou can check visa details and conditions in VEVO.\nThis is a permanent visa. The child can stay in Australia indefinitely.\nFor citizenship purposes, the child's permanent residence starts on the day they enter Australia.\nAs a newly arrived resident the child might have to wait to access certain Australian Government payments and benefits. Learn more about newly arrived residents' waiting periods from Services Australia.\nWe need to know about:\nSee how to let us know if there is a change in the child's situation.\nThe child can travel to and from Australia as many times as they want for 5 years from the date we grant this visa. This is as long as the travel facility of this visa remains valid.\nIf the child wants to travel after the initial 5-year travel facility:\nTo see when the child's travel facility ends, use VEVO.\nThe child might be able to work or study in Australia from the date we grant this visa. If the child works, they are protected by Australian workplace law. See their workplace rights and entitlements.\nDependants can't be added to this visa after we have made a decision.\nTo find a visa for a family member, explore visa options.\nAfter a certain time, the child might be eligible for Australian citizenship. Find out more about becoming a citizen.\nFor citizenship purposes, the child's permanent residence starts the day they entered Australia on this visa.\nThe child must have a valid passport or other travel document to leave Australia.\nCheck if the child needs a Resident Return visa to return to Australia as a permanent resident in VEVO.\nWe have an automated process that uses facial recognition technology and your ePassport. The child might be able to leave the airport faster using the SmartGate.\nRequest the child's international movement records to get proof of their travel in and out of Australia."
}