{
    "visaID": "visa3.13",
    "visaType": "visa3",
    "visaName": "Dependent Child visa (subclass 445)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/dependent-child-445",
    "content": "\n1. (Subclass 445)\n2. Dependent Child visa\n3. For Applicants\n4. For Sponsors\nTemporarily, until we have decided the permanent visa application of the parent of the child.\nFrom AUD3,140.00\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nSee all conditions\nIf you are getting help with your visa, before you pay someone, read information on who can help with your visa application.\n5. With this visa the child can\nOnce the child has been granted this visa, they must apply to be added to their parent's permanent Partner visa application.\nWhen an application to add the child to their parent's permanent Partner visa application has been submitted, the child can enrol in Australia's public healthcare scheme, Medicare.\n6. How long the child can stay\nThis is a temporary visa. It starts on the date we grant the visa.\nThe child can stay until we decide their parent's permanent Partner visa application or their parent withdraws their permanent Partner visa application.\n7. Stay longer\nThe child can't stay in Australia longer by extending this visa. Explore your visa options.\n8. Include other children\nEach of the child's siblings must apply for this visa separately.\nThe child's dependent children can be included on their application when they apply or at any time before we decide the application.\nDependent children of the child who apply for the visa must meet our health requirement.\nFamily members who are not coming to Australia might also have to meet our health requirement.\nFind out what to do if your child is born after you apply.\n9. Cost\nThe visa costs AUD3,140.00 for the main applicant.\nThere is also a charge for each dependent child who applies for the visa with the main applicant.\nThere might also be other costs for health checks, police certificates and biometrics.\nTo work out what the visa will cost, use the Visa Pricing Estimator. The estimator does not take into account the other costs.\n10. Apply from\nThe child can be in or outside Australia when the visa application is submitted.\n11. Processing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nThe application can take longer to process if:\nWe can't process the application if the correct visa application charge isn't paid. We will advise if this is the case and if necessary return the application.\n12. The child's obligations\nThe child must enter Australia before the date specified in their grant letter. The first entry date is generally set at 12 months from the date of visa grant.\nThe child and any of their family members who are granted the visa must meet all visa conditions and obey Australian laws.\nSee what conditions might be attached to this visa on our visa conditions page.\nOnce the child has been granted this visa, they must apply to be added to their parent's permanent Partner visa application.\n13. Travel\nThe child can travel to and from Australia as often as they wish while the visa is valid.\nTime spent outside Australia does not extend the visa.\n14. Visa label\nWe will digitally link the visa to the child's passport. They will not get a label in their passport.\nThe child must be dependent on a parent who holds a:\nThe child must apply to be added to their parent's permanent Partner visa application when they have been granted this 445 visa.\nIf the child is in Australia, they can't hold another visa that has a ‘No further stay’ condition.\nThe child may apply for Australian citizenship by descent instead of a visa to travel to Australia, if:\nThe child must be sponsored by the same person who sponsored or nominated their parent's permanent Partner visa application.\nThe sponsorship must be approved by us.\nThe sponsorship may not be approved if the sponsor or their partner has been charged or convicted of offences involving children.\nLearn more about measures for the protection of children.\nThe child must be either:\nThe child and any of their dependent children who apply for the visa with them must meet our health requirement.\nFamily members who are not coming to Australia with the child might also have to meet our health requirement.\nIf the child is aged 16 years and over they must meet our character requirement.\nWe might also ask that other dependent children who apply for the visa meet the requirement.\nIf the child is 18 years of age or older, they must:\nIf the child owes the Australian Government money you must have it paid it back or have a formal arrangement to pay it back.\nWe will only grant this visa to a child younger than 18 years if either:\nWe might not grant this visa if it is not in the best interests of an applicant under 18.\nCheck the child's passport is valid. Tell us if someone is acting on the child's behalf.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nComplete the forms and get the photos, documents and translations you need.\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nProvide the pages of the child's current passport showing their photo, personal details, and passport issue and expiry dates.\nAlso provide:\nDocuments that prove a change of name include:\nProvide 4 recent passport-size photos (45mm x 35mm) of the child and of any other dependent child included in the application.\nPhotographs must be:\nThe child can wear untinted prescription glasses. If the child wears a head covering for religious reasons, they can show only their face.\nChildren over 16 years must provide a police certificate from every country they have spent 12 months or more in the last 10 years since turning 16.\nWe only accept National Police Certificates applied for under Code 33 – Immigration/Citizenship. The Australian Federal Police issue these certificates. We don't accept standard disclosure certificates or certificates issued by Australian state or territory police.\nFor immigration purposes, police certificates are valid for 12 months from the issue date.\nIf anyone included in the application served in the armed forces of any country, they must provide military service records or discharge papers.\nChildren over 16 years must complete and provide Form 80 Personal particulars for assessment including character assessment (596KB PDF).\nProvide evidence the child is related to the parent, such as:\nIf the child is over 18 when the application is made, provide evidence they are dependent on their parent who holds the temporary Partner or Dependent Child visa for basic needs such as food, shelter and clothing, and how long this support has been provided. Evidence could include:\nFor every dependent under 18 years old who is applying with the child, provide:\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who has a legal right to decide where the child lives.\nThey must complete either:\nInclude an identity document with the signature and photo of the person who completed the form or declaration, such as a:\nAlternatively, you can show us:\nProvide evidence from a qualified medical practitioner that the applicant has a total or partial loss of mental or body function that stops them from working.\nTo nominate someone to:\nSend written notification or your forms with your paper application.\nHave all non-English documents translated into English.\nProvide original and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nProvide each supporting document as a certified copy. This includes:\nPhotographs of the applicant and any of their dependent children included in the application must also be certified.\nKeep a copy of the completed application.\nSend us:\nYou must apply for this visa on paper.\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nComplete the following form.\nForm 918 Application for a subclass 445 (temporary) visa by a dependent child (453KB PDF) (462KB PDF)\nSend it by post or by courier to the Child and Other Family Processing Centre in Perth. You must include correct prepaid postage.\nYou must pay the application charge before you post your application. See how to pay.\nWe will not process your application until you pay the application charge. Your application should also include:\nYou must complete the forms in English.\nIf you submit your application at any other office or in any other way, it will not be valid. We will not consider invalid applications further. You cannot submit applications for this visa in person.\nBy post:\nDepartment of Home Affairs\nChild and Other Family Processing Centre\nLocked Bag 7\nNORTHBRIDGE WA 6865\nAUSTRALIA\nOR\nBy courier:\nDepartment of Home Affairs\nChild and Other Family Processing Centre\nWellington Central\n836 Wellington Street\nWEST PERTH WA 6005\nAUSTRALIA\nIf any of the above steps are incomplete, your application may be invalid. We do not process invalid applications. We will notify you if this is the case, and if requested, return your application.\nDo not send original documents with your application, only send certified copies. Keep a copy of your completed application for your own records, including any supporting documents.\nWe will tell you when we have received the application and documents. See what you can and must do after you apply.\nWe can't provide updates on the progress of the application within global visa processing times. We will tell you if we need anything further.\nIf you applied while the child was onshore, and the child wants to travel overseas during visa processing, they need a valid visa to return to Australia.\nLearn about visa expiry.\nWe will tell you when to arrange the child’s health examinations.\nWe might ask for biometrics. We will tell you if you need to provide them.\nIf you did not include all necessary documents when you applied, provide them as soon as you can.\nWe might also ask you for more information.\nIf the application was lodged on or after 1 April 2020:\nIf you lodged the application before April 2020:\nIf the child was in Australia when the application was submitted, make sure they stay lawful by holding a valid visa while we process it.\nWhen a child applies for this visa in Australia, they are granted a bridging visa. If their current visa expires before we decide their application, the bridging visa will start. The child can stay in Australia on the bridging visa while we process their new visa application.\nLearn more about visa expiry.\nYou can add the dependent children of the child to the application at any time before we decide the application.\nFind out what to do if your child is born after you apply.\nLet us know as soon as you can.\nComplete Form 1023 Notification of incorrect answers (168KB PDF).\nLet us know if you no longer want someone to:\nSend written notification or your forms to the office your submitted your application.\nFor more information see Who can help you with your application.\nThings you need to let us know about include:\nSee how to tell us if your situation changes.\nThe child can be inside or outside Australia when we make our decision.\nWe will tell you our decision in writing. Keep a copy of the decision\nIf we grant the visa, we will tell you:\nIf we refuse the visa, we will tell you:\nWe will not refund the application fee if we refuse the application.\nThe child must have:\nThe child must enter Australia before the date specified in their grant letter.\nIf the date has passed or will pass before they can travel to Australia, ensure that the child:\nWe may then send the child a travel facilitation letter. This will state that we allow them to enter Australia after the first entry arrival date on their visa.\nWe will not issue a travel facilitation letter unless there is less than 3 months remaining on the child’s first entry arrival date.\nAll people arriving into Australia must complete the Incoming Passenger Card.\nWe have an automated process that uses facial recognition technology and your ePassport. Children aged 16 or over might be able to leave the airport faster using SmartGate.\nThe child and family members who apply with them must meet all visa conditions and obey Australian laws.\nYou can check visa details and conditions in VEVO.\nOnce granted this visa, the child must apply for the same permanent Partner visa as their parent.\nComplete and attach to their parent’s Partner visa application in ImmiAccount Form 1002 - Application by a subclass 445 dependent child for a permanent partner visa (279KB PDF).\nAfter you have attached the form to ImmiAccount, let us know by using the Partner Processing Enquiry Form.\nSubmit the form before we decide the permanent Partner visa application of the child's parent. This ensures the child remains lawful in Australia.\nThings you need to let us know about include:\nSee how to let us know if there is a change in your situation.\nSee the child's visa expiry, conditions and work and study entitlements in VEVO.\nThis is a temporary visa. The child can stay until we decide their parent's permanent Partner visa application.\nTo see when the child must leave, use VEVO.\nThe child can travel outside Australia and return as many times as you want while the visa is valid.\nTo prove you have a visa and show your conditions to someone, use VEVO.\nRequest your international movement records to get proof of your travel in and out of Australia.\nThe child might be able to work or study in Australia from the date we grant this visa. If the child works they are protected by Australian workplace law.  See their workplace rights and entitlements.\nYou can't add a dependant after we have decided the application.\nTo find a visa for a family member, explore visa options.\nThe child must have a valid passport or other travel document to leave Australia.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nRequest your international movement records to get proof of your travel in and out of Australia."
}