{
    "visaID": "visa6.7",
    "visaType": "visa6",
    "visaName": "Maritime Crew visa (subclass 988)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/maritime-crew-988",
    "content": "\n1. Subclass 988\n2. Maritime Crew visa\nYou can stay in Australia as long as you are a crew member of a Maritime Crew Visa (MCV) eligible ship that is in Australia.\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nSee all conditions\nIf you are getting help with your visa, before you pay someone, read information on Who can help with your visa application.\nApply\nCheck your Maritime visa status\n3. With this visa you can\nWith this visa you cannot:\nFor more information on visa options, see Explore visa options.\n4. Which ships you can work on in Australia\nShips that do meet the eligibility for a Maritime Crew Visa include:\nShips that are not eligible include:\n5. Apply from\nYou must be outside Australia when you apply. You can be inside or outside Australia when your visa is decided.\nYou must not travel to Australia without a visa.\n6. How long you can stay\nMaritime Crew visas last for three years unless they are ceased for one of the following reasons:\nWhile the visa is valid you can enter Australia by sea as a member of a Maritime Crew visa eligible ship as many times as you want.\nIf you want to enter Australia by air to join a ship, and you hold a Maritime Crew visa, you will need another visa to enter.\nFor more information on visa options, see Explore visa options.\n7. Stay longer\nYou cannot apply for a new Maritime Crew visa while you are in Australia. You must apply for another visa. You need to do this before your current visa ceases.\nFor more information on visa options, see Explore visa options.\n8. Include family\nMembers of the family unit can apply for Maritime Crew visas if they are travelling on the same ship as you with permission from the vessel master. They must lodge separate application forms.\nThe Maritime Crew visa held by members of your family unit will cease if:\nFamily members are not permitted to work in Australia on a Maritime Crew visa.\n9. Travel\nYou can enter Australia by sea as a member of a Maritime Crew visa eligible ship as many times as you want while the visa is valid.\nYou cannot fly into Australia only holding a Maritime Crew visa.\n10. Cost\nFree\n11. Processing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n12. Your obligations\nYou and members of your family unit must meet all visa conditions and obey Australian laws.\nLearn more about conditions for this visa.\n13. Health insurance\nYou are personally liable for all your healthcare costs while you are in Australia. Medical insurance helps limit your financial liability.\nLearn more about health insurance for overseas visitors.\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements.\n14. Visa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nYou must be outside Australia when you apply for this visa.\nYou must be an articled crew member on a Maritime Crew visa eligible ship that is taking an international voyage to Australia.\nThis includes:\nIt does not include those who only work on a ship while it is in port or dry dock unless they are travelling with the ship.\nTo be eligible for crew to enter Australia on a Maritime Crew visa, the ship must meet one of the following activities:\nExamples of the types of ships that are not eligible for Maritime Crew visa holders to enter Australia on are:\nYou must meet our character requirement.\nIf you or any family members (including those who don't apply for the visa with you) owe the Australian government money, you or they must have paid it back or arranged to pay it back.\nYou might not be eligible for this visa if you have had a visa cancelled or refused while you were in Australia. Check if visa cancellation affects your eligibility.\nSee if you hold a Maritime Crew visa that is still valid with the Maritime Crew visa online status enquiry page.\nEnsure you apply for the visa well ahead of your travel. We may require further information from you and time to assess that information.\nDo not travel to Australia without a valid visa.\nEnsure that you enter Australia on a Maritime Crew visa eligible ship, which is a ship that:\nExamples of the types of ships that are not eligible for Maritime Crew visa holders to enter Australia on are:\nIf you plan to get a new passport, you should do so before applying for your visa. Your visa is linked to the passport number you use in your application.\nYou and your family members need valid passports before we will grant this visa.\nA seafarer's identity document is not acceptable with the exception of Chinese, Russian and Vietnamese seafarer passports. If you hold both a seafarer's passport and a national passport, you should apply using your national passport.\nTo find an appropriate other visa, use the Visa finder.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nYou will be able to check ImmiAccount for what documents we need from you before you submit your application.\nYou should submit the required identity, employment and education/qualification documentation with your application in ImmiAccount. If you do not provide these documents at time of your application, the decision may be delayed.\nIf you are applying as a partner or dependant of a crew member, we need you to submit identity documents and other documents to prove you are a family member.\nProvide accurate information. See what happens if you can't prove your identity or do not provide true information.\nProvide:\nA seafarer's identity document is not acceptable with the exception of Chinese, Russian and Vietnamese seafarer passports. If you hold both a seafarer's passport and a national passport, you should apply and provide evidence of your national passport.\nAlso provide:\nDocuments that prove a change of name include:\nWe will tell you if and when you need to get police certificates.\nProvide any military service record or discharge papers, if applicable.\nProvide:\nProvide evidence of your highest recognised qualification that relates to your employment as a crew member.\nThis should be a copy of an educational certificate such as a Degree or Diploma.\nProvide:\nProvide either:\nDocuments that prove your de facto relationship include:\nFor every dependent under 18 years old who is applying with you, provide:\nFor every dependent under 18 years old who is applying with you, you must get consent from anyone who:\nThey must complete either:\nInclude a document with the signature and photo of the person who completed the form or declaration, such as a:\nIf the child is not staying with a relative or legal guardian while in Australia, provide Form 1257 Undertaking declaration (211KB PDF). The person they are staying with must sign the form.\nTo include your child who is over 18 in your visa application, they must be:\nProvide:\nYou must also provide proof the child is dependent on you:\nTo nominate someone to:\nUpload your written notification or your forms to ImmiAccount if you applied online, or send with your paper application.\nHave all non-English documents translated into English.\nProvide original and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nNote: You do not need to have any documents certified.\nScan or photograph all documents (English and non-English) in colour.\nThe scans and photos must be clear.\nIf a document is more than one page, save it all as one file.\nAttach a document only once, even if you are using it to show more than one thing.\nLearn more about attaching documents.\nHave all non-English documents translated into English.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nDo not certify police certificates. You need to send us the originals.\nHave a certified copy of all other documents. This includes:\nKeep a copy of your application.\nSend us:\nYou must be outside Australia when you apply. You can be inside or outside Australia when your visa is decided.\nProvide accurate information. See what happens if you can't prove your identity or do not provide true information.\nYou must complete an application for each person travelling to Australia, including children. Each person holds their own visa.\nIf you can't apply online, complete the following form:\nSend the completed form by post, courier or fax to the address specified on the form. Mark the envelope 'Attention: Maritime Global Processing Centre'.\nWe will let you know when we have received your application.\nWe can’t give updates on applications within the standard processing time.\nIf you applied online, you can check if we need more information from you in ImmiAccount.\nWait for us to contact you if you applied on paper.\nWe might also ask you to provide more information.  If we need more information from you we will let you know by messaging you through ImmiAccount.\nIf you are in Australia, make sure you stay lawful by holding a valid visa while we process your application.\nIf you are in Australia and your visa is cancelled, you could become unlawful in Australia.\nLearn more about visa expiry.\nLet us know as soon as you can.\nComplete Form 1023 Notification of incorrect answers (168KB PDF) and attach it in ImmiAccount.\nLet us know if you no longer want someone to:\nUpload your written notification or your forms to ImmiAccount if you applied online, or send to the office where you submitted your application.\nThings you need to let us know about after you have applied include:\nSee how to tell us if your situation changes.\nWe will let you know our decision in writing.\nIf we grant your visa, we will tell you:\nKeep a copy of the decision.\nIf we refuse your visa, we will tell you:\nYou must have:\nA seafarer's identity document is not acceptable. If you hold both a seafarer's passport and a national passport, you should use your national passport.\nWhen you hold this visa:\nTo find an appropriate other visa, use the Visa finder.\nYou must follow all visa conditions and Australian laws.\nYou cannot apply for a Maritime Crew visa while you are in Australia.\nYou must hold a valid visa for the whole time that you are in Australia. If a change in plans means that you will not be able to leave Australia until after your current visa expires, you should apply for another visa before your visa expires.\nExplore your visa options\nIf you cannot leave Australia within 5 days of signing off your ship, a small extension can be given in limited circumstances. It is important that you contact us while your Maritime Crew visa is still valid to ask for an extension.\nSee your visa expiry, conditions and work and study entitlements in VEVO.\nTo prove you have a visa and show your conditions to someone, use VEVO.\nMaritime Crew visa holders can only work as the crew member of a Maritime Crew visa eligible ship.\nTo see your conditions for work, use VEVO.\nFor information on your workplace rights and entitlements, see the Australian Maritime Safety Authority's regulations and standards.\nYou must have a valid passport or other travel document to leave Australia.\nTo prove you have been to Australia, request your international movement records."
}