{
    "visaID": "visa4.19.1",
    "visaType": "visa4.19",
    "visaName": "Post-Vocational Education Work stream",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-graduate-485/post-vocational-education-work",
    "content": "\n1. Temporary Graduate visa (subclass 485)\n2. Post-Vocational Education Work stream\nUp to 18 months.\nHong Kong and British National Overseas passport holders may stay for 5 years.​\nFrom AUD1,945.00\nFor an indication of processing times for your visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nSee all conditions\nIf you are getting help with your visa, before you pay someone, read information on Who can help with your visa application.\n3. With this visa, you can\nYou must find your own employment if we grant this visa.\n4. How long you can stay\nThis is a temporary visa. You can stay in Australia for 18 months.\nHong Kong and British National Overseas passport holders may stay up to 5 years.\nYou can travel in and out of Australia while your visa is valid.\nThe visa starts on the date we grant your visa.\n5. Stay longer\nWe cannot extend this visa.\nYou may be eligible for other skilled work visas. Use our visa finder to find out options for work.\nCurrent and future Temporary Graduate visa holders from Hong Kong may have a pathway to permanent residency after 5 years.\n6. Include family\nYou can include members of the family unit in your application when you apply, if they are in Australia.\nFamily members who apply for this visa must meet our health and character requirements.\nYou can add your children to the application until we decide on your application. You can't add any other member of the family unit to your application during that period.\nIf a family member wants to be added to your visa after we have granted it, they can apply as a subsequent entrant from in or outside Australia (including Replacement stream visa holders). See when you have this visa.\n7. Cost\nThe visa costs AUD1,945.00 for the primary visa applicant.\nThere is also a charge for each family member who applies for the visa with you.\nSubsequent entrants must pay the full Visa Application Charge.\nYou might also have to pay other costs for health checks, police certificates and biometrics.\nTo work out what your visa will cost use the Visa Pricing Estimator. The estimator does not take into account the other costs.\nThe Temporary Graduate visa is exempt from the Subsequent Temporary Application Charge.\n8. Apply from\nYou can be in Australia (but not in immigration clearance) when you apply for this visa.\nSubsequent entrants can be in or outside Australia when they apply.\nAll applicants can be in or outside Australia at the time of decision.\n9. Processing times\nFor an indication of processing times for your visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application can take longer to process if:\nWe can't process your application if you do not pay the correct Visa Application Charge. We will notify you if this is the case and if necessary return your application.\n10. Your obligations\nYou and your family must meet all visa conditions and follow Australian laws.\nLearn more about conditions for this visa.\n11. Travel\nYou can travel outside Australia and return as many times as you want while your visa is valid.\nThe time you spend outside Australia does not extend your visa.\n12. Visa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nYou must be 35 years of age or under when you apply.\nYou can be under 50 years of age when you apply if you hold a Hong Kong or British National Overseas passport.\nYou must be in Australia (but not in immigration clearance) when you apply for this visa.\nSubsequent entrants can be in or outside Australia when they apply.\nWe will only process your visa application if:\nNote: To be eligible for this visa you must have completed your course within 6 months of applying.\nWe can't grant you this visa if we have previously granted you a subclass 485 or a subclass 476 visa as a primary visa holder.\nYou must have been awarded at least one associate degree, diploma or trade qualification in the 6 months immediately before the day you apply for your visa and meet the Australian study requirement.\nYou can use more than one course to meet the 2 academic year component of the Australian study requirement, but each course used must be closely related to your nominated occupation.\nOn 25 November 2023, online study requirements returned to their pre-COVID state. However, online study undertaken during the COVID concession period (1 February 2020 to 25 November 2023) will continue to count towards the Australian study requirement.\nFor further information about eligible study refer to the Australian study requirement.\nThe Department does not undertake pre-lodgement assessments of the Australian study requirement or any other visa criteria. Once a valid visa application has been lodged, a delegate will make an assessment based on the information available to them.\nYou will need to:\nYour application must include your nominated occupation. You cannot change your occupation after lodgement. Your qualification must be closely related to that occupation.\nYour skills must be assessed by a relevant assessing authority as suitable for the nominated occupation.\nYou must provide your valid skills assessment with your application. If you don’t have a skills assessment, you must provide evidence that you have applied for one.\nSkills assessments are valid for a maximum of 3 years, unless a shorter date is specified on the assessment.\nTo prove your English level meets the requirements, show us evidence that\nTest of English as a Foreign Language internet-based Test (TOEFL iBT)\nTOEFL iBT tests that were completed between 26 July 2023 and 4 May 2024 will not be accepted for Australian visa and migration purposes. During this period, the TOEFL iBT test being offered was not an approved test.\nTotal score of at least 83 with a minimum score of:\nHolders of British National (BNO) or Hong Kong passports must have scored one of the following in the 12 months immediately before the day they apply for their visa:​\nTest of English as a Foreign Language internet-based Test (TOEFL iBT)\nTOEFL iBT tests that were completed between 26 July 2023 and 4 May 2024 will not be accepted for Australian visa and migration purposes. During this period, the TOEFL iBT test being offered was not an approved test.\nTotal score of at least 64 with a minimum score of:\nYou and your family members must have and maintain adequate health insurance for the duration of your stay in Australia. See what we consider adequate health insurance.\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements.\nYou and any family members who apply for the visa with you must meet our health requirement.\nYou and family members aged 16 years and over who apply for the visa must meet our character requirement.\nIf you are 18 years of age or older, you must:\nIf you or any family members owe the Australian Government money, you or they must have paid it back or arranged to pay it back.\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused see Limitations on applications in Australia.\nIf applying for a visa from outside Australia see Can you go to Australia.\nIf you need immigration assistance, see Who can help with your visa application.\nBegin these steps as soon as possible after your education provider has confirmed you have successfully completed your course.\nYou need a valid passport for this visa.\nIf you plan to get a new passport, do so before applying for your visa.\nIf you have a current visa with a 'No further stay' condition 8534 or 8503 on your current visa, you can’t apply for this visa online. Please submit an ImmiAccount technical support form.\nTo see your conditions see VEVO.\nYou may need health examinations.\nFind out the examinations you need and how to arrange them. Arranging examinations before you apply may lead to a faster decision.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nA relevant assessing authority must assess your skills as being suitable for your nominated occupation.\nEach authority assesses the skills against their individual professional standards.\nThe relevant authority for your occupation can be found in the list of eligible skilled occupations.\nYou must provide your valid skills assessment with your application. If you don’t have a skills assessment, you must provide evidence that you have applied for one.\nSkills assessments are valid for a maximum of 3 years, unless a shorter date is specified on the assessment.\nProvide proof of your study, qualifications, skills assessment, identity and relationships. You will also need to provide documents for your family members.\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nProvide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\nAlso provide:\nDocuments that prove a change of name include:\nDocuments needed for your application are listed under ‘Evidence to attach to your application’ on Meeting the Australian study requirement.\nTo prove your English level meets the requirements, show us evidence that\nTest of English as a Foreign Language internet-based Test (TOEFL iBT)\nTOEFL iBT tests that were completed between 26 July 2023 and 4 May 2024 will not be accepted for Australian visa and migration purposes. During this period, the TOEFL iBT test being offered was not an approved test.\nTotal score of at least 83 with a minimum score of:\nHolders of British National (BNO) or Hong Kong passports must have scored one of the following in the 12 months immediately before the day they apply for their visa:​\nTest of English as a Foreign Language internet-based Test (TOEFL iBT)\nTOEFL iBT tests that were completed between 26 July 2023 and 4 May 2024 will not be accepted for Australian visa and migration purposes. During this period, the TOEFL iBT test being offered was not an approved test\nTotal score of at least 64 with a minimum score of:\nProvide evidence that the relevant assessment authority has assessed your skills as suitable for your nominated occupation.\nIf you haven’t received your skills assessment yet, you must provide evidence that you have applied to the relevant assessment authority to have your skills assessed.\nYou must attach the completed assessment in ImmiAccount .\nYou must prove that you have adequate health insurance in Australia. Provide:\nYou and any other applicants over 16 years of age must provide evidence that you have applied for an Australian Federal Police check during the 12 months immediately before the day you apply for this visa.\nWe only accept complete disclosure National Police Certificates (Immigration/Citizenship – Australia Name Check Only) issued by the Australian Federal Police. We do not accept standard disclosure certificates, national police certificates issued by Australian state or territory police, or any other organisation.\nComplete and provide the following forms:\nIf requested, you may also need to provide:\nFor more details refer to character requirements for visas.\nTo nominate someone to:\nUpload your written notification or your forms to ImmiAccount.\nProvide your partner's:\nIf you are married, provide your marriage certificate or other evidence that your marriage is valid in Australia.\nIf you are a de facto partner, provide proof of your de facto relationship.\nThis proof should show that:\nAdditional proof of a de facto relationships\nIn addition to documents proving your relationship provide evidence that:\nFor every dependant 18 years old or younger who is applying with you, provide:\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\nThey must complete either:\nAlternatively, you can show us:\nInclude:\nTo include your child who is over 18 in your visa application, they must be:\nIf your child is likely to turn 23 while your application is being processed, you will need to provide evidence they are dependent on you due to disability.\nProvide:\nYou must also provide proof the child is dependent on you.\nHave all non-English documents translated into English.\nProvide original and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nNote: You do not need to have any documents certified.\nScan or photograph all documents (English and non-English) in colour.\nThe scans and photos must be clear.\nIf a document is more than one page, save it all as one file.\nYou must apply for this visa online.\nIf you are having problems lodging your application, see common issues and error messages.\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nWhen you submit your application you must pay for you and your family members or your application will not be valid.\nNote:\nWhen you submit your application you must attach the following information:\nIf you have a technical problem with your ImmiAccount or online application see how to resolve error messages when submitting online.\nWe will let you know when we have received your application and documents. See what you can and must do after you apply.\nWe cannot give status updates while your application is within standard processing timeframes.\nFor any information requests, check ImmiAccount .\nYou can be in or outside Australia (but not in immigration clearance) when we decide on your visa application.\nFind out the examinations you need and how you can arrange them. Arranging examinations before you apply may lead to a faster decision.\nYou can attach further supporting documents in ImmiAccount.\nYou should provide any requested information within the specified timeframe. We can make a decision on your application once the timeframe has passed.\nMake sure you stay lawful by holding a valid visa while we process your application.\nWhen you applied for this visa, you were granted a bridging visa. If your current visa expires before we decide on your application, your bridging visa will allow you to stay lawfully in Australia while we process your application.\nDo not cancel your current visa. If you do, you will be staying in Australia unlawfully.\nLearn more about visa expiry.\nYou may be able to add your dependent child to your application for this visa before we make a decision.\nYou will need to:\nYour family can also apply to join you in Australia as a subsequent entrant after the visa is granted. See when you have this visa.\nNewborn children\nIf your child is born after you apply but before we make a decision on your visa, then your child is considered to have made the same visa application as you.\nYou must tell us as soon as possible and give us:\nLet us know as soon as you can.\nComplete Form 1023 Notification of incorrect answers (168KB PDF)\nLet us know if you no longer want someone to:\nUpload your written notification or your forms to ImmiAccount.\nFor more information see Who can help you with your application.\nThings you need to let us know about include:\nSee how to tell us if your situation changes.\nYou can be in or outside Australia (but not in immigration clearance) when we decide on your visa application.\nIf you are a subsequent entrant (family member), you can be in or outside Australia when we decide on your visa application.\nIf we grant your visa, we will tell you:\nKeep a copy of the email with you when in Australia.\nIf we refuse your visa we will let you know by email. We will tell you why we refused and whether you have a right to a review of the decision.\nWe will not refund the Visa Application Charge if we refuse your application.\nNow that you have your Temporary Graduate (subclass 485) Post-Vocational Education Work visa, you may want to consider withdrawing any other undecided visa applications you have lodged with us. Failure to withdraw any undecided applications may result in you being granted a different visa.\nTo withdraw any other visa application, you must advise us in writing. More information is available at You want to withdraw an application.\nYou must have:\nAll people arriving Australia must complete the Incoming Passenger Card. You will given this card onboard.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nYou can travel, work or study in Australia during your stay.\nYou must find your own employment while on this visa.\nYou and your family members must obey all Australian laws.\nSee your conditions in VEVO or your visa grant letter.\nThings you need to let us know about include:\nSee how to tell us if there is a change in your situation.\nThis is a temporary visa. You can usually stay in Australia for 18 months.\nThe visa starts on the date we grant your visa.\nTo see when you must leave, use VEVO.\nYou can't stay in Australia longer by extending this visa.\nYou might be eligible for other skilled work visas. Use our visa finder to find out options for work.\nThis visa is granted with multiple entries. You can travel outside Australia and return as many times as you want while your visa is valid.\nTime spent outside Australia does not extend your visa.\nSee your conditions in VEVO.\nTo prove you have a visa and show your conditions to someone, use VEVO.\nTo get proof of your travel in and out of Australia request your international movement records.\nTo see your conditions for work, use VEVO.\nYou are protected by Australian workplace law. See your workplace rights and entitlements.\nMembers of the family unit can also apply to join you in Australia as a subsequent entrant after we grant your visa. They can be in or outside Australia when they apply (but not in immigration clearance). Family members applying for this visa as subsequent entrants must apply online in ImmiAccount. For more information see step by step.\nVisa holders must arrive in Australia by their Initial Entry Date.\nFind out what to do if your child is born after you apply or when you hold your visa.\nYou must have a valid passport or other travel document to leave Australia.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nYou are likely to have some money in a superannuation fund if you worked in Australia and you are paid AUD450 or more before tax in a month.\nSee how to access your super.\nTo get proof of your travel in and out of Australia request your international movement records."
}