{
    "visaID": "visa2.2",
    "visaType": "visa2",
    "visaName": "Student Guardian visa (subclass 590)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/student-590",
    "content": "\n1. Subclass 590\n2. Student Guardian visa\nThis is a temporary visa. The length of your visa will be determined by the student visa holder’s stay and their age.\nFrom AUD1,600.00\nEligible Pacific Island and Timor-Leste citizens can apply for a partial refund of the cost, see Getting a refund.\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nSee all conditions\nIf you are getting help with your visa, before you pay someone, read information on Who can help with your visa application.\nApply\n3. With this visa you can\nYou cannot work.\n4. How long you can stay\nYou can stay in Australia until a date specified on your visa grant letter. In deciding this date, we usually consider the length of the student visa holder’s stay or when that student turns 18.\n5. Stay longer\nYou can stay in Australia by applying for a further Student Guardian visa.\n6. Include family\nIf any member of your family unit has not turned 6 years old, you cannot be granted the visa unless:\nThe child must meet the same health requirements as you and have health insurance for the duration of their stay in Australia.\nYou can't include children under 6 years old after you have submitted your application.\nChildren 6 years old or older can come with you but they must apply for their own student visa.\n7. Cost\nThe visa costs from AUD1,600.00 for the main applicant.\nThere is also a charge for each family member who applies for the visa with you.\nEligible Pacific Island and Timor-Leste citizens can apply for a partial refund of the cost, see Getting a refund.\nYou might also have to pay other costs for health checks, police certificates and biometrics.\nTo work out what your visa will cost use the Visa Pricing Estimator. The estimator does not take into account the other costs.\n8. Apply from\nYou can be in or outside Australia when you apply for the visa and when we decide on your application. If you are in Australia you must hold an eligible substantive visa. For more information see 'Have this visa if applying while in Australia' under Eligibility.\n9. Processing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application may take longer to process if:\nWe cannot process your application if you do not pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\n10. Your obligations\nYou and your family members must meet all visa conditions and obey Australian laws.\nSee which conditions will and might be attached to this visa.\n11. Travel\nYou can travel outside Australia and return as many times as you want while the visa is valid. But you can't leave Australia without the student visa holder unless you have made alternative welfare arrangements.\nThe time you spend outside Australia does not extend the visa.\n12. Financial support\nYou will need to be able to financially support yourself while in Australia. You will need to be able to financially support accompanying family members\n13. Visa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nYou can be in or outside Australia when you apply for the visa.\nYou can apply in Australia if you hold a substantive visa except for one of these:\nIf you don't hold an eligible substantive visa you can apply within 28 days of either:\nTo be a Student Guardian you must be:\nYou are required to provide care and support for:\nFor this visa, a relative is the student's:\nYou must be able to provide accommodation, general welfare and support to the student.\nYou must show us evidence that you have enough money to pay for your stay in Australia. This includes meeting the costs and expenses of yourself, your accompanying family members and the student visa holder.\nTo see what you will need to provide, go to Gather Documents in the 'Step by Step tab'.\nIf any member of your family unit has not turned 6, you cannot be granted the visa unless:\nYou must make adequate arrangements for the accommodation, support and welfare of any non-migrating children of your family who:\nWe consider you have made adequate welfare arrangements for your children aged 6 to 18 years if they will be living with:\nYou must show evidence of welfare arrangements and a letter from the appointed guardian accepting responsibility for the non-migrating child while you reside in Australia. The letter should detail the guardian's consent that the child will be wholly or substantially reliant on the guardian's financial support. The child must also reside in the guardian's household.\nA copy of the guardian's current personal particulars (bio-data) page of their passport or a valid driver's licence showing the signature field should also be included.\nYou are personally liable for all your healthcare costs while you are in Australia. Medical insurance helps limit your financial liability.\nYou must maintain adequate health cover for the whole of your stay if you are granted this visa. Your insurance should cover you for medically necessary treatment, including transport.\nSee a guide to what we consider adequate health insurance.\nLearn more about health insurance for overseas visitors.\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements.\nYou must only intend to:\nYou must have substantially complied with the conditions of the last substantive or subsequent bridging visa that you held.\nWhen we assess whether you plan to stay in Australia temporarily we will consider:\nYou and any family members who apply for the visa with you must meet our health requirement\nIf you are a relative of the student visa holder, you must meet our character requirement.\nYou must:\nIf you or any family members owe the Australian Government money, you or they must have paid it back or arranged to pay it back.\nWe will consider your immigration history when we decide on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\nIf applying for a visa from outside Australia see Can I go to Australia.\nIf you want immigration assistance, see Who can help with your visa application.\nWe might not grant this visa if it is not in the best interests of an applicant under 18.\nYou might need to organise health exams. See what to do if you want help with your application.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nProvide accurate information. See what happens if you cannot prove your identity or do not give us true information.\nWe need proof of your identity. If you cannot prove your identity:\nYou must provide:\nDocuments that prove a change of name include:\nYou must have any document(s) in a language other than English translated into English. Provide copies of both the translated documents and the document in the original language.\nProvide a completed Form 157N - Student guardianship arrangements (291KB PDF).\nYour application will not be valid if you do not provide the completed Form 157N.\nShow proof that you are staying in Australia temporarily:\nWrite a personal statement addressing the Genuine Temporary Entry (GTE) requirement. If you are not comfortable writing it in English, you can write your statement in your own language and submit a translated copy with your application.\nIn your written statement, provide evidence or information about circumstances in your home country, ties to your home country or country of residence and incentive to return. This could include:\nWe consider your personal circumstances when we make a decision. When we assess whether you are a genuine temporary entrant, we consider your overall situation.\nFrom 23 March 2024, Ministerial Direction 108 (239KB PDF) (replaces Ministerial Direction 69) sets out a number of factors we consider when determining if you meet the GTE requirement. It is not a checklist. Read Ministerial Direction 108 before drafting your GTE statement.\nThe living costs we ask you to declare and provide with your visa application indicate the cost of living in Australia. Actual living costs vary throughout Australia. We recommend you research the area you intend to live, including the cost of living in that area.\nThere are options to prove you have genuine access to enough money for your stay.\nYou must ensure you have enough money to support yourself, the student visa holder(s) and any children who come to Australia with you.\nYou need enough money to pay for:\nEvidence you can provide includes:\nIf someone else is providing you funds, give us evidence of your relationship with them and their identity documents.\nIf you are providing evidence of deposits of money, explain their source. Only certain people are acceptable in terms of providing you with financial support.\nUse the following information to work out how much money you need. To calculate pro rata costs, divide the annual cost by 365 and multiply the result by the number of days you intend to stay in Australia.\n12-month living costs:\nYou must have 12 months of course fees for the student visa holder(s) or pro-rata if less than 12 months.\nIf you are including children (under 6 years old) in your application, add schooling costs of at least AUD13,502 per year, per child. Costs vary between states, territories and schools in Australia.\nYou are responsible for finding out how much schooling will cost.\nAs a guide, allow $2000 per person.\nYou must show you will have genuine access to funds while you are in Australia for:\nAlternatively, you could also show us that your spouse or de facto partner, (who is not travelling to Australia), will support you. They must have an annual income of AUD102,500 or more in the 12 months immediately before you apply.\nYou must provide evidence of personal income.\nThis must be in the form of official government documents, such as tax assessments that are less than 12 months old.\nWe will not accept bank statements or direct evidence from an employer as evidence of annual income.\nYou will need to provide evidence of adequate health insurance for you and your family members for the first 12 months of your stay in Australia.\nThis can be an Overseas Visitors Health Cover (OVHC) premium or another health insurance product from Australia or your home country that provides a similar level of cover.\nOVHC is available through several private and general insurers in Australia. However, the benefits available, membership costs and eligibility can vary between insurers.\nLearn more about Overseas Visitors & Overseas Students and adequate health insurance.\nIf you are applying from outside Australia and you are travelling from, or spent time in, a country considered at risk of polio, you need to give us a polio vaccination certificate.\nFor the current countries of risk, see Threats to public health.\nIf you are a relative of the student visa holder, you must provide an Australian police certificate if you have spent a total of 12 months or more in Australia in the last 10 years since you turned 16.\nWe only accept complete disclosure National Police Certificates issued by the Australian Federal Police. We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police.\nYou are also required to provide an overseas police certificate from every country, where you spent a total of 12 months or more in the last 10 years since you turned 16. This includes your home country.\nLearn more about country-specific instructions on how to obtain a police certificate and Character requirements for visas.\nFor every dependant 6 years old or younger who is applying with you, you must provide:\nYou must also:\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\nThey must complete either:\nAlternatively, if you have sole responsibility of the student(s) you must, provide evidence. Acceptable evidence may include:\nYou must also include:\nTo nominate someone to:\nUpload your written notification or your forms to ImmiAccount.\nHave all non-English documents translated into English.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nNote: You do not need to have any documents certified.\nScan or photograph all documents (English and non-English) in colour.\nThe scans and photos must be legible.\nIf a document is more than 1 page, save it all as 1 file.\nKeep a copy of your completed application.\nYou must apply for this visa online. You should apply at the same time as the student.\nYou must hold an eligible substantive visa, or apply:\nYou cannot apply for a Student Guardian visa in Australia if you hold one of these:\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nWe will let you know when we have received your application and documents. See what you can and must do after you apply.\nDo not call if it is in standard processing times. We can't give any further updates on the application's progress. You can see if we have asked for more information in your ImmiAccount.\nYou do not have to tell us if you want to travel outside Australia while we process your application. This is because you can be outside Australia when we make a decision.\nBut if you leave Australia, make sure you have a valid visa to return.\nYou can't leave Australia without the student visa holder unless you you have made alternative welfare arrangements.\nLearn about visa expiry.\nWe will let you know if you need health examinations.\nWe might ask for biometrics (fingerprints and photo). We will let you know if you need to provide them.\nIf you did not attach all documents when you applied, attach them as soon as possible in ImmiAccount.\nWe might also ask you to provide more information.\nIf you are in Australia, make sure you stay lawful by holding a valid visa while we process your application.\nIf you were in Australia when you applied for this visa, you were granted a Bridging visa A (BVA). If your current visa expires before we decide on your application, the BVA will start. You can stay in Australia on the BVA while we process your new visa application. You cannot travel on the BVA - there is no right of return on this visa; it cancels on departure.\nDo not get cancel your current visa cancelled. If you do, you will be in Australia unlawfully.\nLearn more about visa expiry.\nLet us know as soon as you can. If you do not tell us you made a mistake on your application, we might refuse it.\nComplete Form 1023 Notification of incorrect answers (168KB PDF) and upload in ImmiAccount.\nLet us know if you no longer want someone to:\nUpload your written notification or your forms to ImmiAccount.\nFor more information see Who can help you with your application.\nThings you need to let us know about after you have applied include:\nSee how to tell us if your situation changes.\nWe will let you know in writing our decision about your visa application. If we grant you the visa, we will tell you:\nKeep a copy of the decision with you when in Australia.\nIf we refuse your visa, we will tell you why it was refused and whether you have a right to a review of the decision.\nWe will not refund the application fee if we refuse your application.\nIf we have granted you a Student Guardian (subclass 590) visa, you may want to consider withdrawing any other undecided visa applications you have lodged with us.\nWe will continue to progress any undecided visa applications. If they meet the requirements it may result in your current visa ceasing. It may also affect your eligibility for government benefits such as Centrelink or Medicare.\nTo withdraw any other visa application, you must tell us in writing. More information is available on our website at You want to withdraw an application.\nYou must have:\nAll people arriving Australia must complete the Incoming Passenger Card. You will get the card on board.\nYou cannot work.\nYou, and your family members, must comply with all visa conditions and Australian laws. Check your conditions in your grant letter or in VEVO.\nThings you need to let us know about include\nSee how to let us know if there is a change in your situation.\nThis is a temporary visa. You can stay in Australia until the date provided in your visa grant letter.\nTo see when you must leave, use VEVO.\nYou can stay in Australia longer by applying for a further Student Guardian visa.\nYou can travel outside Australia and return as many times as you want while the visa is valid.\nBut you can't leave Australia without the student visa holder unless you have made alternative welfare arrangements.\nThe time you spend outside Australia does not extend the visa.\nTo prove you have a visa and show your conditions to someone, use VEVO.\nTo see your conditions for work, use VEVO.\nYou must have a valid passport or other travel document to leave Australia.\nYou can't leave Australia without the student visa holder unless you have made alternative welfare arrangements. You must have:\nIf you leave Australia without alternative welfare arrangements, you may be in breach of condition 8538, and your visa may be cancelled.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nRequest your international movement records to get proof of your travel in and out of Australia."
}