{
    "visaID": "visa7.20",
    "visaType": "visa7",
    "visaName": "Medical Treatment Long Stay visa (subclass 685)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/medical-treatment-long-stay-visa-subclass-685",
    "content": "Medical Treatment Long Stay Visa (subclass 685)\nThe Medical Treatment Long Stay visa (subclass 685) closed to new applications on 23 March 2013. You might be able to get a Medical Treatment visa (subclass 602).\nIf you already have the Medical Treatment Long Stay visa (subclass 685), it will be valid until the expiry date you were given when your visa was granted. \n1. Visa holders\nThis information is for people who have already been granted a Medical Treatment Long Stay visa (subclass 685) or for people who applied for the visa before it was closed to new applications and for which a decision has not yet been made. It explains your rights and obligations.\nYou can use Visa Entitlement Verification Online (VEVO) for free to check your visa details and entitlements.\nThe Medical Treatment Long Stay visa (subclass 685) lasts until the date we gave you in the letter telling you were granted the visa. The intent is to give you time to have your medical treatment.\nYou can apply for a further visa:\nYou must apply for and be granted your next visa before your current visa ends.\nThis visa allows you to:\nIf you already hold this visa, the following people might be able to join you in Australia by applying for a Medical Treatment visa (subclass 602):\nThese people can apply for a Medical Treatment visa (subclass 602) using:\nIn Australia:\nPost or fax your application to the Canberra office in Australian Capital Territory - attention Specialist Temporary Entry Centre. You can pay by credit card, debit card, bank cheque or money order made payable to the Department of Home Affairs.\nOutside Australia:\nLodge your application at one of the immigration offices outside Australia.\nYou and your family must comply with all visa conditions and Australian laws. You cannot work in Australia, except under limited circumstances. You can study for up to three months unless exceptions apply.\nYou are expected to leave Australia before your visa ends. You might be able to apply for another visa in Australia if you need more medical treatment. Medical Treatment visas are usually granted for a short time only, and you are expected to return to your home country.\nYou must tell us if your circumstances change.  This includes a new residential address, a new passport, or a pregnancy, birth, divorce, separation, marriage, de facto relationship or death in your family.\nPlease report changes in your circumstances via ImmiAccount.  If you are not able to use ImmiAccount, you can use the following forms:\nIf you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane."
}