{
    "visaID": "visa7.11",
    "visaType": "visa7",
    "visaName": "Employer Nomination Scheme (subclass 121 and 856)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/employer-nomination-scheme-121",
    "content": "Employer Nomination Scheme visa (subclasses 121 and 856)The Employer Nomination visa (subclasses 121 and 856) closed to new applications on 1 July 2012. You can add your partner or a dependent child to your application if it has not yet been decided.\nThe Employer Nomination Scheme (ENS) allowed Australian employers to sponsor employees who are foreign nationals for a permanent visa to work in Australia. The Employer Nomination visa (subclasses 121 and 856) visa is for applicants who were in Australia and lodged a visa application on or before 30 June 2012.\nThis visa allows you and your family to live and work in Australia on a permanent basis.\n1. About this visa\nEmployer Nomination Scheme (Subclass 121):\nEmployer Nomination Scheme (Subclass 856):\nEmployer Nomination Scheme - Extension (Subclass 856):\n2. Visa holders\nThis information is for people who have been granted an Employer Nomination visa (subclass 121). It explains your rights and obligations.\nYou can use  Visa Entitlement Verification Online (VEVO) for free to check your visa details and entitlements.\nThis is a permanent visa. It allows you and your family to:\nYou and your family must comply with all visa conditions and Australian laws.\nThe employer must comply with all relevant Australian standards and workplace legislation for wages and working conditions\nYou must tell us if your circumstances change.  This includes a new residential address, a new passport, or a pregnancy, birth, divorce, separation, marriage, de facto relationship or death in your family.\nPlease report changes in your circumstances via ImmiAccount.  If you are not able to use ImmiAccount, you can use the following forms:\nIf you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane."
}