{
    "visaID": "visa5.3",
    "visaType": "visa5",
    "visaName": "Refugee visas (subclass 200, 201, 203 and 204)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/refugee-200",
    "content": "\n1. Subclass 200, 201, 203 and 204\n2. Refugee category visas\nPermanently\nThere is no visa application charge for this visa\nThe decision process could take many months, or even years. The number of applications we receive for resettlement each year is far greater than available visas.\nSee all conditions for:\nWe usually grant this visa to people referred to us by United Nations High Commissioner for Refugees (UNHCR) for resettlement in Australia.\nIf you are getting help with your visa, before you pay someone, read information on Who can help with your visa application.\n3. With this visa, you can\n4. How long you can stay\nThis is a permanent visa. It lets you stay in Australia permanently.\nYou become a permanent resident when you enter Australia.\nFor citizenship purposes, your permanent residence starts on the day you enter Australia on this visa.\n5. Include family\nYou can also add certain family members to your application at any time before we decide on your application.\nFor this visa, your family are:\nIf your child is not dependent on you, they must apply for their own visa.\nFamily members who apply for the visa must meet our health and character requirements.\nFamily members who are not coming to Australia might also have to meet our health requirement.\nIt is important to declare all of your family members, even if they will not be applying with you.\nIf you do not declare a family member in your application, you may not be able to propose them for a Humanitarian visa after you arrive in Australia.\n6. Cost\nThere is no visa application charge for this visa\n7. Apply from\nYou must be outside Australia when you apply. You must also be outside Australia when your visa is granted.\n8. Processing times\nWe generally acknowledge Humanitarian visa applications in writing. Processing times can vary according to the applicant’s:\nThe decision process takes many months, even years. The number of applications we receive for resettlement each year is far greater than available visas.\nYour application can take longer to process if:\nProcessing times also vary according to individual and family circumstances, such as health conditions that might require testing or treatment.\nWe will contact you at key stages of processing and when a decision is made.\nThe Australian Government has established policy to guide decisions on which applications ought generally to be given priority. This policy includes those who are outside their home country and are one of following:\nBecause of the limited number of resettlement places available each year and the high demand for them, we accept applicants in the most compelling circumstances only.\n9. Assisted Passage\nThe Assisted Passage program supports the delivery of Australia’s Offshore Humanitarian Program and provides health screening, travel and medical related services to refugee category visa applicants and visa holders.\nThe Assisted Passage service has now transitioned from the International Organization for Migration (IOM) to Toll Transport Pty Ltd (Toll) effective 30 September 2024. IOM will continue to provide Assisted Passage services for Cox’s Bazar.\nToll will assist you to attend health appointments and, if you are granted a visa, assist you to travel to Australia.\n10. Your obligations\nYou must enter Australia before the first entry arrival date (initial arrival date) specified in your grant letter.\nIf you signed a health undertaking, you must comply with it.\nYou and your family members must obey all Australian laws.\n11. Travel\nYour travel to Australia will be arranged by the Department at no cost to you. If the first entry arrival date (initial arrival date) specified in your grant letter has passed, we may issue you with a travel facilitation letter. We may first ask you to undergo a fresh medical examination.\nYou can travel to and from Australia for 5 years from the date we grant the visa. After 5 years you will need a Resident Return (RRV) visa (subclass 155) or (subclass 157) to re-enter Australia as a permanent resident.\n12. Additional information\nThe number of applications we receive for resettlement each year is far greater than available visas.\nThere are four visa subclasses included in the Refugee category of the Humanitarian Program. They are:\nWe will consider your application against each subclass.\nYou can find more information at Refugee visas (offshore).\nYou can't apply for this visa in Australia.\nYou need resettlement because you face persecution in your home country.\nYou can work on this visa.\nYou and any family members who apply for the visa with you must meet our health requirement.\nFamily members who do not apply with you might also have to meet our health requirement.\nIf you have compassionate and compelling circumstances, we might waive your health requirement.\nYou and any family members who apply for the visa with you must meet our character requirement.\nFamily members who do not apply with you might also have to meet our character requirement.\nIf you are 18 years of age or older, you must confirm you will respect the Australian way of life and obey Australian laws when you sign or accept the Australian Values Statement.\nIf you or any family members (including those who don't apply for the visa with you) owe the Australian Government money, you or they must have paid it back or arranged to pay it back.\nCheck that you are eligible.\nIf you need help with your application, get someone to act on your behalf.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nProvide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\nAlso provide:\nDocuments that prove a change of name include:\nIf you can't provide these items, provide a statement explaining why you have no travel or identity documents.\nPlease provide proof if you have registered with any international organisation dealing with refugees, such as the United Nations High Commissioner for Refugees (UNHCR).\nIf you have been referred for resettlement by the UNHCR, provide a full copy of your resettlement registration form.\nAlso write a statement, in English, about why you left your home country.\nProvide certified copies of any visas or residence permits you hold.\nProvide certified copies of marriage certificates or relationship registrations for you and anyone else included in your application, even if they are not joining you in Australia.\nProvide 2 recent photographs (45mm x 35mm).\nThe photographs should be of the head and shoulders only against a plain background.\nPrint your name on the back of each photograph.\nProvide military service records or discharge papers if you served in the armed forces of any country.\nTo nominate someone to:\nSend written notification or your forms with your paper application.\nProvide:\nProvide either:\nDocuments that prove your de facto relationship include:\nFor every dependant under 18 years old who is applying with you, provide:\nUnless you have a court order you must get consent for the child to come to Australia from anyone who:\nThey must complete either:\nInclude a document with the signature and photo of the person who completed the form or declaration, such as a:\nIf the child is not staying with a relative or legal guardian, provide Form 1257 Undertaking declaration (211KB PDF). The person they are staying with must sign the form.\nFor every dependant aged 18 years or older who is applying with you, provide:\nYou must demonstrate financial, physical or psychological dependence.\nHave all non-English documents translated into English.\nProvide original and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nHave all documents certified. This includes:\nKeep a copy of your completed application.\nSend us:\nApply on paper by post.\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nApply with Form 842 Application for an Offshore Humanitarian Visa (828KB PDF)\nSend your application to an immigration office outside Australia.\nSubmit your visa applications and supporting documents together.\nThis helps give us a clear idea of everyone that is applying for a visa.\nIn your application, you must list all family members who are also applying for their own visa.\nWe will let you know when we have received your application and documents.\nWe will advise you if you are required to undertake a medical examination and or have your biometrics collected. Toll, the Department’s Assisted Passage service provider, will assist you with these requirements. If you are requested to undertake these requirements, further information can be found in the letters below.\nWe can’t give updates on applications.\nWait for us to contact you. Ensure you keep us up to date with contact details and changes in circumstances.\nDo not arrange travel to Australia until we let you know, in writing, that we have granted you the visa.\nWe will let you know if you need health examinations.\nWe might ask for biometrics (fingerprints and photo). We will let you know if you need to provide them.\nIf you did not attach all documents when you applied send them to the office where you sent the application, quoting the file number we have given you.\nWe might also ask you to provide more information.\nWe might ask you to attend an interview. You must bring your passport or other identification and any other requested documents. You might be asked about:\nIf we receive information that could result in you being refused a visa, we will usually give you the opportunity to comment.\nIn some circumstances you can add certain family members to your application before we decide on your application.\nComplete Form 1436 Adding an additional applicant after lodgement (481KB PDF).\nLet us know as soon as you can if you made a mistake on your application.\nComplete Form 1023 Notification of incorrect answers (168KB PDF).\nLet us know if you no longer want someone to:\nSend written notification or your forms to the office your submitted your application.\nFor more information see Who can help you with your application.\nThings you need to let us know about after you have applied include:\nSee how to tell us if your situation changes.\nWe will let you know our decision by email or letter.\nIf we grant your visa, we will tell you:\nKeep a copy of the decision.\nIf we refuse your visa, we will tell you:\nTo find out about Australian history, culture, society and values, read the Life in Australia booklet.\nYou must arrive in Australia by the date specified in the letter we sent you when we granted your visa.\nYou can get help from the following organisations and programs:\nThis 5-day program is free and open to all humanitarian visa holders over the age of 5. It is delivered overseas, to give you an understanding of life in Australia before you arrive.\nRead more about the AUSCO program.\nThis service will contact you when your visa is approved. It is free and runs across Australia. The focus is on helping you to learn English and to gain education or work skills.\nRead more about the Humanitarian Settlement Program.\nYou, and any family members travelling with you on the visa, may be required to have a health check in the 72 hours before you leave for Australia.\nThe Australian Government will cover the cost of your health check.\nThe departure health check includes:\nYou must agree to follow up on any health conditions after you arrive in Australia.\nYou must have:\nAll people arriving in Australia must complete the Incoming Passenger Card. You will get a card on board.\nYou and your family members must obey all Australian laws.\nThings you need to let us know about include:\nSee what to do if your situation changes.\nYou can travel to and from Australia for 5 years from the date we grant the visa. After 5 years you will need a Resident Return (RRV) visa (subclass 155) to re-enter Australia. To see when the 5 years ends, use VEVO.\nTo obtain evidence you have a visa and show your conditions to someone, use VEVO.\nRequest your international movement records to get proof of your travel in and out of Australia.\nWith this visa, you can work and study. You are protected by Australian workplace law. For more information on your workplace rights and entitlements see Visa holders and migrant workers.\nIf you are in Australia, you may be eligible for a free, fast-tracked skills assessment if you have skills in a priority occupation. For more information see Migrant Skills Incentives.\nAs an Australian permanent resident, you might be able to sponsor eligible family members to come to Australia.\nTo find a visa for your family member, explore visa options.\nYou can also propose a family member for a Subclass 202 Global Special Humanitarian visa\nAfter a certain time, you might be eligible for Australian citizenship. Find out more about becoming an Australian citizen.\nFor citizenship purposes, your permanent residency starts on the day you entered Australia on this visa.\nYou must have a valid travel document to leave Australia. Check your VEVO.\nSee what to do if your visa has expired or is about to expire.\nRequest your international movement records to get proof of your travel in and out of Australia."
}