{
    "visaID": "visa7.9",
    "visaType": "visa7",
    "visaName": "Electronic Travel Authority (Business Entrant) visa (subclass 956 and 977)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/electronic-travel-authority-business-entrant-subclass-956-and-977",
    "content": "Electronic Travel Authority (Business Entrant) (subclass 956 and 977) \nThe Electronic Travel Authorities (Business Entrant – long validity) (subclass 956) and (Business Entrant – short validity) (subclass 977) closed to new applications on 22 March 2013.\nYou might be able to apply for Electronic Travel Authority (subclass 601). \n\n1. Electronic travel authority holders\nThis information is for people who have already been granted:\nIt explains your rights and obligations.\nYou can use  Visa Entitlement Verification Online (VEVO) for free to check your ETA status and entitlements.\nYou can stay in Australia for up to three months on each visit for the life of your passport.\nYou can stay in Australia for up to three months on each visit within either:\nElectronic travel authorities cannot be extended. If you want to extend your stay after arriving in Australia, you will need to apply for a different type of visa at least two weeks before your authority expires.\nThese authorities let you visit Australia for short-term business purposes, including:\nYou cannot work in Australia. If your main reason for coming to Australia is to work, you should apply for a different visa.\nYou must comply with all electronic travel authority conditions and Australian laws.\nYou must also:\nYou must tell us if your circumstances change. This includes a new residential address, a new passport, or a pregnancy, birth, divorce, separation, marriage, de facto relationship or death in your family.\nPlease report changes in your circumstances via ImmiAccount. If you are not able to use ImmiAccount, you can use the following forms:\nIf you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.​​"
}