{
    "visaID": "visa4.10.2",
    "visaType": "visa4.10",
    "visaName": "Labour Agreement stream",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/skilled-employer-sponsored-regional-494/labour-agreement-stream",
    "content": "\n1. Skilled Employer Sponsored Regional (Provisional) visa (subclass 494)\n2. Labour Agreement stream\n3. For Applicants\n4. For Sponsors\n5 years\nFrom AUD4,770\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nSee all conditions\nIf you are getting help with your visa, before you pay someone, read information on Who can help with your visa application.\n5. With this visa, you can\n6. Specified region\nYou can live, work and study only in a designated regional area. Designated regional areas include all of Australia except for Sydney, Melbourne and Brisbane.\n7. How long you can stay\nThis is a provisional visa. You can stay in Australia for a period of 5 years from when your visa is granted.\n8. Pathways to permanent residence\n9. Stay longer\nYou can't stay in Australia longer by extending this visa. Explore your visa options.\nIf eligible, you can apply for permanent residence after 3 years from the time your visa is granted.\n10. Include family\nYou can include members of the family unit in your application. You can:\nFamily members who apply for the visa with you must meet our health and character requirements.\nFamily members who do not apply for the visa with you might also have to meet our health and character requirements.\nIf your partner or dependent children are not included in this application, you must tell us the reason why. For example, they already hold Australian citizenship or are a permanent resident.\n11. Cost\nThis visa costs AUD4,770 for the main applicant, AUD2,385.00 for each dependent 18 years and over, and AUD1,190 for each dependent under 18 years.\nIt costs an additional AUD4,890 if any dependent applicants who are 18 years and over do not have functional English. This extra charge is called a second instalment.\nTo work out what your visa will cost use the Visa Pricing Estimator. The estimator does not take into account the second instalment or other costs.\nYou will have to pay other costs including English language tests, health checks, police certificates and biometrics.\n12. Apply from\nYou can be in or outside Australia when you apply for the visa and when we make a decision on your application, but not in immigration clearance.\nIf you are applying in Australia, you must hold either of the following visa otherwise your application will not be valid:\n13. Processing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nWe assess applications on a case-by-case basis, and actual processing times can vary due to individual circumstances including:\nWe might ask for more information. We are not obligated to request further information or documents and can make a decision on the information provided. It is your responsibility to ensure all relevant supporting/evidentiary documentation is attached to your application.\n14. Your obligations\nYou and your family must comply with all visa conditions and Australian laws.\nYou must begin your employment within 90 days of:\nYou must only work in your nominated occupation and only work for your nominating employer in regional Australia. If you do not, we might cancel your visa.\n15. Travel\nYou can travel out of Australia and return as many times as you want while the visa is valid.\nThe time you spend outside Australia does not extend the visa.\n16. Visa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nThe nominated occupation must be the subject of a labour agreement between the Commonwealth and the nominator.\nSee the labour agreement under which you will be working.\nUnless the labour agreement states otherwise, you must be under 45 years of age when you apply for the visa.\nYou must demonstrate that you have the skills, qualifications and work experience necessary to perform the nominated occupation.\nYou must undertake a skills assessment to demonstrate this if having a skills assessment is specified in the labour agreement - see Have a positive skills assessment section below.\nIf it is not mandatory for you to undertake a skills assessment, you are still required to provide other evidence to demonstrate that you meet this requirement – see 'Skills and qualifications documents' under the Step by step tab.\nYou must have been employed in the nominated occupation for at least 3 years on a full-time basis and at the skill level required for the nominated occupation.\nGenerally, you should have gained your experience within the last 5 years. The period does not need to be continuous. We might consider equivalent part-time work. We do not consider casual work.\nIf having s skills assessment is specified in the labour agreement, you must have your skills assessed as suitable for the nominated occupation by the relevant assessing authority. The assessment will show us you have the skills to work in the nominated occupation.\nLearn more about skills assessments.\nYou must have the level of English as specified in the labour agreement to be granted this visa. Learn more about English language.\nYou and any family members who apply for the visa with you must meet our health requirement.\nIf requested, family members not accompanying you to Australia might also need to meet our health requirement.\nYou and any family members aged 16 years and over who apply for the visa with you must meet our character requirement.\nFamily members not accompanying you to Australia must also meet the character requirement.\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused see Limitations on applications in Australia.\nIf applying for a visa from outside Australia see Can I go to Australia.\nIf you want immigration assistance, see Who can help with your visa application.\nIf you or any family members (including those who don't apply for the visa with you) owe the Australian government money, you or they must have paid it back or arranged to pay it back.\nIf you are 16 years of age or older, you must:\nThings you will need to arrange before you apply could include obtaining a skills assessment, an English language test or undertaking a health assessment. You might also want to get help with your application.\nGet a skills assessment if you need to. The assessment will prove you have the right skills and qualifications to do your job.\nMake sure your English test results are current for this visa. You must have the level of English as specified in the labour agreement to be granted this visa. Have an English test if necessary.\nYou need to have health examinations. You can complete them before you apply or you can wait until after you apply.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nMake sure your employer has submitted a nomination application. They will receive a nomination Transaction Reference Number (TRN) when they do.\nAsk your employer for the TRN. You need it to apply for the visa.\nCriminal and civil penalties can be applied to anyone who asks for, receives, offers or provides a benefit in exchange for visa sponsorship. Learn more about work visa scams.\nDocuments you may have to provide could include documents for your identity, character, skills, work experience, health and English language skills.\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nProvide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\nAlso provide:\nDocuments that prove a change of name include:\nYou need to provide documents that prove your skills and qualifications including:\nProvide documents that show you have the level of English as specified in the labour agreement.\nYou do not need to provide health documents. If you have had medical exams, the results are sent to us by your doctor.\nProvide an Australian police certificate if you have spent a total of 12 months or more in Australia in the last 10 years since you turned 16 years. We only accept complete disclosure National Police Certificates issued by the Australian Federal Police . We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police. For immigration purposes, Australian police certificates are valid for 12 months from the date of issue.\nAlso provide:\nFurther information is available at: Character requirements for visas\nProvide:\nProvide either:\nDocuments that prove a de facto relationship include:\nYou must show that your partner has Functional English.\nIf you can't show that your partner has Functional English, you will need to pay the second instalment  of the visa application charge when we ask you to.\nFor every dependant under 18 years who is applying with you provide:\nYou must get consent for the child to come to Australia from anyone who:\nThey must complete either:\nInclude a document with the signature and photo of the person who completed the form or declaration, such as a:\nFor every dependant 18 years and over who is applying with you provide:\nYou need to prove that this person is a family member and/or dependent on you. Provide:\nYou must also prove this person has been financially dependent on you for at least 12 months before you apply. You could provide:\nYou must show that your family member and/or dependant has Functional English.\nIf you can't show that your family member and/or dependant has Functional English, you will need to pay the second instalment  of the visa application charge when we ask you to.\nTo nominate someone to:\nUpload your written notification or your forms to ImmiAccount.\nHave all non-English documents translated into English.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nScan or photograph all documents (English and non-English) in colour.\nThe scans and photos must be clear.\nIf a document is more than one page, save it all as one file.\nYou apply for this visa online in ImmiAccount.\nProvide accurate information. See what happens if you can't prove your identity or don't provide accurate information.\nWe will let you know when we have received your application. See what you can and must do after you apply.\nWe can’t give updates on applications within the standard processing time.\nWe might ask for more information. We are not obligated to request further information or documents and can make a decision on the information provided.\nIf you are in Australia, you don't have to tell us if you want to travel outside Australia while we process your application. This is because you can be outside Australia when we decide on your application.\nBut if you leave Australia, make sure you have a valid visa to return.\nLearn about visa expiry.\nLearn about travel on a Bridging visas.\nIf you didn't have health examinations before you applied, we will let you know if you need them. Check ImmiAccount.\nWe might ask for biometrics (fingerprints and photo). We will let you know if you need to provide them.\nWe might ask you to provide more information. Attach any additional documents we ask you for as soon as possible in ImmiAccount..\nIf you are in Australia, make sure you stay lawful by holding a valid visa while we process your application. You must hold a substantive visa or a Bridging visa A, Bridging visa B or Bridging visa C for your visa application to be processed.\nIf you were in Australia when you applied for this visa, you may have been granted a Bridging visa. If your current visa expires before we decide on your application, the Bridging visa will start. You can stay in Australia on the Bridging visa while we process your new visa application.\nDo not ask us to cancel your current visa. If your visa is cancelled, you will:\nIf you need to pay a second instalment of the visa application charge we will send you an invoice after you have met all other requirements for the visa. Pay the instalment after you get the invoice. Do not ask for the invoice.\nYou can't add members of the family unit to your visa application after it has been submitted.\nIf you have submitted your visa application and we are processing it, certain family members that were not included in your visa application can submit a subsequent entrant application.\nAlternatively, if we have granted you a visa, certain family members may apply to join you in Australia later as a subsequent entrant.\nIf you had a baby, you should tell us as soon as possible. If you don’t, your child may be unlawful.\nLet us know as soon as you can if you made a mistake on your application.\nComplete Form 1023 Notification of incorrect answers (168KB PDF).\nLet us know if you no longer want someone to:\nUpload your written notification or your forms to ImmiAccount.\nFor more information see Who can help you with your application.\nTell us if things change after you submit your application but before we decide on your application.\nThings you need to let us know about include:\nSee what to do if your situation changes.\nYou can be in or outside Australia when we decide on your visa application.\nWe must have approved your employer’s nomination before we can grant you this visa.\nWe will let you know our decision about your visa application in writing.\nIf we grant your visa, we will tell you:\nKeep a copy of the decision.\nIf we refuse your visa, we will tell you:\nWe will not refund the visa application charge if we refuse your application.\nYou must have a valid:\nAll people arriving in Australia must complete an Incoming Passenger Card. You will be given this card during your flight.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nYour visa will come with conditions attached to it. To see your conditions, see your grant letter or use VEVO.\nYou and your family must meet all visa conditions and obey Australian laws.\nYou must begin your employment within 90 days after your:\nLearn more about visa details and conditions.\nThings you need to let us know about include:\nSee what to do if your situation changes.\nThis is a provisional visa. You can live, work and study only in regional Australia for up to 5 years.\nTo see when you must leave, see your grant letter or use VEVO.\nIf your visa is expiring and you want to keep working in Australia for your employer:\nYou can’t stay longer by extending the visa.\nYour employer may be able to sponsor you for permanent residence through the Permanent Residence (Skilled Regional) visa (subclass 191).\nYou can travel to and from Australia as many times as you want while the visa is valid.\nTime spent outside Australia does not extend your length of stay in Australia.\nTo prove you have a visa and show your conditions to someone, use VEVO.\nUsually you can only work for the business that sponsored you. They must have a labour agreement and the position must be in regional Australia.\nWhen you work in Australia, you are protected by Australian workplace law. See your workplace rights and entitlements.\nLearn more about visa details and conditions.\nSecondary applicants can apply for this visa as a subsequent entrant.\nYou must have a valid passport or other travel document to leave Australia.\nCheck your conditions and the expiry of your visa in VEVO.\nSee what you can and must do if your visa has expired or is about to expire.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nYou are likely to have some money in a superannuation fund if you worked in Australia and:\nSee how to access your superannuation after you leave Australia.\nTo prove you have been to Australia, request your travel records."
}