{
    "visaID": "visa4.17",
    "visaType": "visa4",
    "visaName": "State or Territory Sponsored Investor visa (subclass 893)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/state-or-territory-sponsored-investor-893",
    "content": "\n1. Subclass 893\n2. State or Territory Sponsored Investor visa\nPermanent\nFrom AUD2,890.00\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nSee all conditions\nIf you are getting help with your visa, before you pay someone, read information on Who can help with your visa application.\n3. With this visa, you can\nNewly arrived residents may have to wait before they can access certain Australian Government payments and benefits.\n4. How long you can stay\nFor citizenship purposes, your permanent residency starts on the day:\n5. Include family\nYou can include members of the family unit in your application. You can:\nMembers of the family unit who apply for the visa must meet our health and character. Family members not accompanying you to Australia may also need to meet our health and character requirements.\n6. Cost\nThe visa costs AUD2,890.00 for the main applicant.\nThere is also a charge for members of the family unit who applies for the visa with you.\nYou might have to pay an extra charge for any applicant 18 years old or older who has less than functional English and who does not hold an eligible visa when they apply. This charge is called the second instalment. This charge is only payable if you are requested to pay it and we send you an invoice.\nThe second instalment charge for family members is AUD4,890.\nYou might also have to pay other costs for health checks, police certificates and biometrics.\nTo work out what your visa will cost use the Visa Pricing Estimator.\nThe Visa Pricing estimator does not include the second instalment or other costs.\nWe can't process your application if you do not pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\n7. Apply from\nYou must be in Australia when you submit your application. Members of your family unit can be in or outside Australia but not in immigration clearance.\nYou must hold an eligible visa to make a valid application for this visa.\n8. Processing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nWe assess applications on a case-by-case basis, and actual processing times can vary due to individual circumstances including:\n9. Your obligations\nYou, and members of your family unit, must obey all Australian laws.\nYou must meet your business obligations.\n10. Travel\nYou can travel to and from Australia for 5 years from the date we grant the visa. After 5 years you will need a Resident Return (RRV) visa (subclasses 155 and 157) to re-enter Australia as a permanent resident.\nTo see when your travel facility ends, use VEVO.\n11. Visa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nYou can apply for this visa if you are the primary holder of State/Territory Sponsored Investor (Provisional) visa (subclass 165).\nYou must have been resident, as the holder of a State/Territory Sponsored Investor (Provisional) visa (subclass 165), in the State or Territory of your sponsoring authority for at least 2 years in the 4 years immediately before you submit your visa application.\nThe 2-year period does not have to be continuous.\nYou, or you and your partner together, must:\nYou must be sponsored by the regional authority in the state or territory in which you have lived for at least 2 years in the 4 years immediately before you apply for this visa.\nThere is no age limit for this visa.\nYou and any family members included in your application must meet our health requirement health requirement.\nIn some circumstances you will not have to do medicals again to meet the health requirement.\nYou should not do medicals until we ask you to do so.\nYou, and family aged 16 years and over who apply for the visa with you, must meet our character requirement.\nFamily members not accompanying you to Australia must also meet the requirement\nAll applicants who are 18 years of age or older, must:\nIf you or any family members (including those who don't apply for the visa with you) owe the Australian Government money, you or they must have paid it back or arranged to pay it back.\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused see Limitations on applications in Australia (129KB PDF).\nIf applying for a visa from outside Australia see Can I go to Australia.\nIf you want immigration assistance, see Who can help with your visa application.\nBefore you apply, you must get sponsorship from the regional authority in the state or territory in which you have lived for at least 2 years in the 4 years immediately prior to visa application.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nYou must be sponsored by the regional authority in the state or territory in which you have lived for at least 2 years in the 4 years immediately before you submit your visa application.\nTo do this you must complete the sponsorship form: Form 949 State/Territory notification: Business Skills class (219KB PDF)\nSend to the appropriate state or territory:\nA representative will sign, stamp and send it back to you. Include this completed form with your visa application.\nYou must give us documents proving your identity and about your business activities. You also need to provide documents about family members applying with you.\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nProvide colour copies of the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\nAlso provide:\nDocuments that prove a change of name include:\nIf you have been married, widowed, divorced or permanently separated, provide proof such as marriage certificates, divorce documents, birth certificate, separation documents or statutory declarations.\nProvide two recent photos (45mm x 35mm) for each person in your application. The photos must have:\nWhere one of the following criteria requires you to provide evidence for a period that ends not more than 3 months immediately before the date of application you must use the same date for each requirement.\nYou must have been living in your sponsoring State or Territory as a State/Territory Sponsored Investor (Provisional) (subclass 165) visa holder for a total of  at least 2 years in the 4 years immediately before you submit your visa application. The 2-year period does not need to be continuous.\nEvidence of residence might include:\nYou must provide evidence you have held your Designated Investment of at least AUD750, 000 made for the purpose of being granted a State/Territory Sponsored Investor (Provisional) visa (subclass 165):\nThis should include evidence from the state/territory corporation confirming the date that the original designated investment and the name(s) in which the investment was made.\nIf the investment has already matured, provide:\nPlease provide:\n•    a 1-page summary of your business or investment activities in Australia\n•    a 1-page summary of your business or investment intentions in the long-term\n•    a report of the Australian business or investment operating environment if you have one\nProvide a short summary of any business and/or investment activities in Australia (besides holding the Designated Investment).\nPlease provide evidence of your partner's identity and relationship with you.\nProvide:\nFor de facto relationship provide either:\nIf your partner is a person who was not included in or a subsequent entrant to your provisional visa application, please also provide evidence that you are in a genuine and continuing relationship. Evidence can include but is not limited to:\nFor every dependant 18 years old or younger who is applying with you, provide:\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\nThey must complete either:\nAlternatively, you can show us:\nInclude:\nNote: If your child is likely to turn 18 while your application is being processed, you will need to provide evidence they are dependent on you. See the section 'Dependants over 18 documents' below for further information. A child who turns 18 while your application is being processed and who is not dependent on you cannot satisfy the criteria for this visa.\nIf you are including a dependant aged over 18 years of age who holds a State/Territory Sponsored Investor (Provisional) (subclass 165) visa ranted on the basis of being a member of your family unit at time of grant of that visa, this section does not apply.\nTo include in your visa application your child who is over 18 and doesn't hold an eligible visa, they must be:\nIf your child is likely to turn 23 while your application is being processed, you will need to provide evidence in relation to the second dot point above.\nProvide:\nYou must also provide proof the child is dependent on you:\nNote: A child who turns 23 while your application is being processed and who does not meet these requirements cannot satisfy the criteria for this visa.\nThis information applies to dependent family members who are 18 years or older and who do not hold an eligible visa at the time of application for this visa.\nYou don't have to provide any documents to prove functional English if your dependant is a citizen of and holds a valid passport from:\nOtherwise, provide proof your dependant has functional English.\nIf you can't show us your dependant has functional English, you will need to pay the second instalment of the visa application charge when we ask you to.\nFor each person in your application, provide an Australian police certificate if they have spent a total of 12 months or more in Australia in the last 10 years since they turned 16. We only accept complete disclosure National Police Certificates issued by the Australian Federal Police. We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police.\nAlso provide:\nComplete and provide the following forms:\nTo nominate someone to:\nSend written notification or your forms with your paper application.\nHave all non-English documents translated into English.\nProvide original and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nKeep a copy of your completed application.\nYou must be in Australia when we receive your application. Your family can be in or outside Australia but not in immigration clearance.\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nTo apply for this visa, you need to pay the application fee before you submit your application. We will not process your application until you pay the fee. Form 47BU tells you how to calculate and pay the fee.\nYour application should also include evidence of payment of the application fee and all the relevant supporting documentation.\nYou must post (with the correct prepaid postage) or send by courier your application to the Adelaide Business Skills Processing Centre. If you submit your application at any other office or in any other way, it will not be a valid application and can't be considered further.\nPostal address\nAdelaide Business Skills Processing Centre\nDepartment of Immigration and Border Protection\nGPO Box 2399\nAdelaide SA 5001\nAustralia\nCourier address\nAdelaide Business Skills Processing Centre\nDepartment of Immigration and Border Protection\nLevel 4\n70 Franklin Street\nAdelaide SA 5001\nAustralia\nWe will let you know when we have received your application and documents.\nThere are other things you need to know and might need to do.\nWe do not give updates on applications under assessment.\nYou don't have to tell us if you want to travel outside Australia while we process your application. However, to be granted this visa you must be in Australia when we make a decision.\nIf you leave Australia, make sure you have a valid visa to return. To see if you can return on your current visa, check VEVO.\nWe will let you know if you need health examinations.\nWe might ask for biometrics (fingerprints and photo). We will let you know if you need to provide them.\nIf you did not send us all documents when you applied, send them to us by courier or mail as soon as you can.\nWe might also ask you to provide more information, however we are not obliged to do so and may make a decision on your application without asking for more documents.\nMake sure you stay lawful in Australia by holding a valid visa while we process your application.\nWhen you apply for this visa, you will be considered for the automatic grant of a Bridging Visa A (BVA). If you are granted a BVA, it will come into effect when your current visa expires and enable you to stay lawfully in Australia while we process your application.\nDo not ask to have the visa you currently hold cancelled. If your visa is cancelled:\nLearn more about visa expiry.\nIf you need to pay a second instalment, we will send you an invoice after you have met all other requirements for the visa. Pay the invoice after you get it. Do not ask for the invoice.\nYou can add members of the family unit to your application after you apply but before we decide on your visa.\nUse Form 1436 adding an additional applicant after lodgement, pay using ImmiAccount, send the form and evidence of payment to the address where you submitted your application.\nFamily members who apply for the visa must meet our health and character requirements.\nFamily members who are not coming to Australia might also have to meet our character and health requirement.\nComplete Form 1436 Adding an additional applicant after lodgement (481KB PDF)\nSend your form to the office processing your application and include:\nIf your child is born after you submit your application but before we decide on your visa, you must tell us as soon as possible. Find out what to do if your child is born after you apply.\nYou must tell us as soon as possible if you made a mistake on your application. Complete Form 1023 Notification of incorrect answers (168KB PDF) and send to the address you sent your application.\nLet us know if you no longer want someone to:\nSend written notification or your forms to the office your submitted your application.\nFor more information see Who can help you with your application.\nThings you need to let us know about after you have applied include:\nSee how to tell us if your situation changes\nYou can be in or outside Australia when we decide your visa application but you must be inside Australia if our decision is to grant you a visa.\nWe will let you know our decision in writing. If we grant you the visa, we will tell you:\nKeep a copy of the decision.\nIf we refuse your visa we will tell you:\nWe will not refund the application fee if we refuse your application.\nYour visa may have conditions. To see your conditions use VEVO.\nYou and your family members must obey all Australian laws.\nWe expect you to continue your business activity in Australia, or make a realistic commitment to doing so.\nThings you need to let us know about include:\nSee how to tell us if there is change in your situation.\nhis is a permanent visa. It lets you stay in Australia indefinitely.\nYou become a permanent resident on the day we grant the visa.\nFor citizenship purposes, your permanent residency starts on the day we grant the visa.\nYou can travel in and out of  Australia as many times as you want for 5 years from the date we grant the visa. After 5 years you will need a Resident Return (RRV) visa (subclasses 155 and 157) to re-enter Australia as a permanent resident.\nTo see when your travel facility ends, use VEVO.\nIf an immigration officer processes your clearance at our border, we recommend you tell them:\nIf you don't tell them, you might be granted a 444 visa. Grant of a subclass 444 visa will cease your permanent visa, which will then affect your eligibility for permanent citizenship.\nTo prove you have a visa and show your conditions to someone, use VEVO.\nYou are protected by Australian workplace law. See your workplace rights and entitlements.\nAs an Australian permanent resident, you might be able to sponsor eligible family to come to Australia.\nTo find a visa for your family member, explore visa options.\nAfter a certain time, you might be eligible for Australian citizenship. Find out more about becoming a citizen.\nFor citizenship purposes, your permanent residency starts on the day:\nYou must have a valid passport or other travel document to leave Australia.\nCheck the travel component of your current visa in VEVO.\nSee what to do if your visa has expired or is about to expire.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nRequest your international movement records to get proof of your travel in and out of Australia."
}