{
    "visaID": "visa1.5.3",
    "visaType": "visa1.5",
    "visaName": "Third Work and Holiday visa",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/work-holiday-462/third-work-and-holiday-462",
    "content": "\n1. Work and Holiday visa (subclass 462)\n2. Third Work and Holiday visa\n12 months\nAUD650.00\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application may take longer to process than the times shown in the guide due to the number of Working Holiday visa applications we receive. Do not arrange travel to Australia before we tell you in writing that we have granted your visa.\nSee all conditions\nSee the Working Holiday Maker program\nIf you are getting help with your visa, before you pay someone, read information on Who can help with your visa application.\n3. With this visa, you can\nYou can do any kind of work on this visa.\nUsually, you can only work for the same employer for 6 months.\nNote: The 6-month work limitation resets when you are granted a third subclass 462 visa. This means you can work another 6 months for someone you worked for on your first and/or second visa.\nIf the main purpose of your stay is to work, consider a work visa.\nYou can study for up to 4 months (17 weeks).\nIf the main purpose of your stay is to study, consider a Student visa.\n4. How long you can stay\nThis depends on your circumstances when we grant the visa. Your grant notification will tell you how long you can stay in Australia and you can also use VEVO to check your visa details and conditions.\nThe bridging visa must be the one you were granted after your second subclass 462 visa expired.\nYou can stay in Australia for up to 12 months from the date your second Work and Holiday (subclass 462) visa expired or would have expired.\nYou can stay in Australia for 12 months from the date we grant the visa.\nTime spent outside Australia after the visa starts does not extend the visa.\nYou can stay in Australia for 12 months from the date you enter Australia.\nYou must enter Australia within 12 months of the date we grant the visa. We will not extend or defer this timeframe.\nYour Work and Holiday visa starts on the date you enter or transit through Australia even if you hold any other temporary visa including:\nIt is important that you only apply for a Work and Holiday visa once you are ready to enter Australia on that visa. Once we grant your Work and Holiday visa and you travel to Australia and are immigration cleared at the border, the 12-month visa period of stay will automatically start upon entry, regardless of the purpose of your visit.\n5. Stay longer\nYou can't:\nTo stay longer in Australia, explore your visa options.\nGenerally, we don't grant a Visitor visa after you have been in Australia on a Work and Holiday (subclass 462) visa.\nIf you want to apply for a Visitor visa to stay longer in Australia and the Visitor visa would result in you staying longer than 12 consecutive months in Australia, you must show there are exceptional circumstances.\nFor this visa, exceptional circumstances might be that a close family member in Australia has died or is seriously ill and you are required to stay in Australia to provide assistance or support.\n6. Include family\nYou can't include family members in your application.\nYou can't be accompanied by dependent children while you are in Australia on this visa.\n7. Cost\nAUD650.00\nYou might also have to pay for health checks, police certificates and biometrics.\n8. Apply from\nYou can be in or outside Australia when you apply for the visa. You must select your current location at the time you apply.\nIf you apply when you are in Australia, you must be in Australia when we grant your visa.\nIf you apply when you are outside Australia, you must be outside Australia when we grant your visa.\nYou must correctly select your current location when applying. If you select the wrong location you will need to amend the information. This may delay processing of your application.\n9. Processing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application might take longer to process if:\n10. Your obligations\nYou must meet all visa conditions and obey Australian laws.\nSee the conditions for this visa.\nWhen you work in Australia on this visa you must pay taxes.\nAustralia has compulsory superannuation - a retirement savings scheme. Your employer must pay superannuation into your superannuation fund if you earn over a certain amount.\nWhen you leave Australia, you can access your superannuation.\nLearn more about compulsory superannuation.\n11. Health insurance\nWe strongly recommend you take out health insurance to cover any unforeseen medical treatment you might need in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability.\nSee what we consider adequate health insurance.\nLearn more about health insurance for overseas visitors.\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements.\n12. Travel\nYou can travel outside Australia and return as many times as you want while the visa is in effect.\nThe time you spend outside Australia after your visa commences does not extend the visa period of stay in Australia.\n13. Visa record\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nYou must be a citizen of and hold a valid passport from one of these countries:\nYou must:\nYou must have enough money to:\nThis is usually about AUD5,000 for your initial stay, plus the fare to where you are going after leaving Australia.\nIf you are applying in Australia, you don’t need to provide evidence.  If you are applying outside Australia and don’t attach evidence to your application, processing may be delayed if we need to contact you to request further information.\nYou must have completed 6 months of specified subclass 462 work.\nYou must be 18 to 30 years old (inclusive) when you apply.\nIf you apply for the visa while you are 30, but turn 31 before we have made a decision, we can still grant you the visa if you meet all other requirements.\nYou must meet our health requirement.\nYou must meet our character requirement.\nIf you or any family members (including those who don't apply for the visa with you) owe the Australian government money, you or they must have paid it back or arranged to pay it back.\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused see Limitations on applications in Australia.\nIf applying for a visa from outside Australia see Can I go to Australia.\nIf you want immigration assistance, see Who can help with your visa application.\nYou might need to have health examinations. You can complete them before you apply or you can wait and have them if we tell you to.\nFind out the examinations you need and how to arrange them if you want to have them before you apply.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nProvide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\nAlso provide a copy of your birth certificate showing both your parents’ names. If you don’t have a birth certificate and you can’t get one, provide a copy of the identification pages of one of these:\nIf you have changed your name, provide proof such as:\nProvide evidence you have enough money for your stay in Australia. This is usually AUD5,000.\nYou must also show us you have enough money to buy a ticket to leave Australia at the end of your stay, or that you already have the ticket.\nIf you are applying in Australia, you don’t need to provide evidence.  If you are applying outside Australia and don’t attach evidence to your application, processing may be delayed if we need to contact you to request further information.\nProvide proof that you have completed 6 months of specified subclass 462 work on your previous WHM visa (or in other eligible circumstances). The proof must cover all periods you worked.\nYou can include any of the following:\nWe might contact your employer(s) to check your work claims.\nIf you have completed volunteer bushfire or flood recovery work, provide:\nWe might ask you to provide:\nWe will let you know if you need to give us these documents.\nTo nominate someone to:\nUpload your written notification or your forms to ImmiAccount if you applied online, or send with your paper application.\nHave all non-English documents translated into English.\nProvide original and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nNote: You do not need to have any documents certified.\nScan or photograph all documents (English and non-English) in colour.\nThe scans and photos must be clear.\nIf a document is more than one page, save it all as one file.\nAttach a document only once, even if you are using it to show more than one thing.\nLearn more about attaching documents.\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nApplicants with dependent children\nYou can’t apply online if you are the parent of a child under the age of 18.\nWork and Holiday visa holders cannot be accompanied by dependent children at any time during their stay in Australia. While it is possible to obtain a Work and Holiday visa if you have a child, your child cannot join you in Australia at any time while you are on your Work and Holiday visa – not even for one day.\nSee what you can and must do after you apply.\nWe will let you know when we have received your application.\nTell us if you want to travel outside Australia while we process your application. We need to know because you must be in Australia when we decide your visa.\nIf you leave Australia, make sure you have a valid visa to return.\nYou can travel outside Australia and return as many times as you want while the visa is valid.\n\nTime spent outside Australia does not extend the visa.\nDo not arrange to travel to Australia until we let you know, in writing, that we have granted you the visa.\nWe might ask for biometrics. We will let you know if you need to provide them.\nIf you didn't have health examinations before you applied, we will let you know if you need them.\nIf you didn't attach all documents when you applied, attach them as soon as you can in ImmiAccount .\nWe might also ask you to provide more information.\nLet us know as soon as you can if you made a mistake on your application.\nComplete Form 1023 Notification of incorrect answers (168KB PDF) and attach it in ImmiAccount.\nLet us know if you no longer want someone to:\nUpload your written notification or your forms to ImmiAccount if you applied online, or send to the office where you submitted your application.\nFor more information, see Who can help you with your application.\nTell us if things change after you submit your application but before we decide your visa.\nThings you need to let us know about include:\nWe will let you know our decision in writing.\nIf we grant your visa, we will tell you:\nKeep a copy of the decision notification with you when in Australia.\nIf we refuse your visa, we will tell you:\nIt is very important that you only apply for a Work and Holiday visa once you are ready to enter Australia on that visa. Once we grant your Work and Holiday visa, you can use the visa to enter Australia.\nAfter you have been granted your third Work and Holiday visa you do not need to apply for another visa, such as an eVisitor (subclass 651), a Transit (subclass 771), or an Electronic Travel Authority (ETA) (subclass 601) visa to enter Australia.\nIf you apply for and are granted another visa (such as subclass 651 or 771 visa) after the grant of your third Work and Holiday visa, your Work and Holiday visa (and related work rights) will cease on the date that visa is granted.\nIf your third Work and Holiday visa ceased due to the grant of another visa, such as an eVisitor or Transit visa, and you entered Australia on that other visa, you may be able to apply for another third Work and Holiday visa while you are in Australia. You will need to pay the Visa Application Charge (VAC) if you apply again.\nIf you enter Australia after the grant of your Work and Holiday visa, the 12-month period of stay on your visa will automatically start on that day.\nThe Work and Holiday visa period will start regardless of the purpose of your visit, even if you:\nor\nYour Work and Holiday visa will be linked to the passport you declared on your application. If you obtain a new passport after your visa is granted, you must tell us your new passport details. See how to tell us if your situation changes.\nIf you do not update your passport details, you will face delays at your overseas departure point and may not be permitted to board your flight.\nCompleting an Incoming Passenger Card\nAll people arriving in Australia must complete the Incoming Passenger Card. You will be given this card on board.\nLeaving the airport faster\nWe have an automated process that uses facial recognition technology and your ePassport, if you have one. You may be able to leave the airport faster if you use SmartGate.\nUsually, you can only work for the same employer for 6 months.\nYou can work another 6 months with an employer you worked for on your first and/or second visa.\nTo see your conditions for work, use VEVO.\nYou must pay taxes when you work.\nYou are protected by Australian workplace law. See your workplace rights and entitlements.\nIf you earn over a certain amount, your employer must pay superannuation into your superannuation fund. Australia has compulsory superannuation- a retirement savings scheme.\nWhen you leave Australia, you can access your superannuation.\nYou can study for up to 4 months (17 weeks).\nTo see your study entitlements use VEVO.\nYou can travel outside Australia and return as many times as you want while the visa is in effect.\nTime spent outside Australia after your visa commences does not extend the visa period of stay in Australia.\nThis depends on your circumstances when you applied and when we grant the visa. Your grant notification will tell you how long you can stay in Australia and you can also use VEVO to check your visa details and conditions.\nThe bridging visa must be the one you were granted after your second subclass 462 visa expired.\nYou can stay in Australia for up to 12 months from the date your second Work and Holiday (subclass 462) visa expired or would have expired.\nYou can stay for 12 months from the date we grant the visa.\nYou can stay for 12 months from the date you enter Australia on the visa.\nTo see when you must leave, use VEVO.\nTime spent outside Australia after the visa starts does not extend the visa.\nYou can't stay in Australia longer by extending this visa.\nYou can't get a fourth Work and Holiday (subclass 462) visa if you have held three Work and Holiday (subclass 462) visas in Australia.\nYou must apply for a different visa if you want to stay longer.\nSee your visa options.\nYou must meet all visa conditions and obey Australian laws.\nSee your conditions in your visa grant letter or VEVO.\nTo prove you have a visa and show your conditions to someone, use VEVO.\nThings you need to let us know about include:\nSee how to tell us if your situation changes.\nYou must have a valid passport or other travel document to leave Australia.\nWe have an automated process that uses facial recognition technology and your ePassport. You may be able to leave the airport faster if you use SmartGate.\nYou are likely to have some money in a superannuation fund if you worked in Australia and you are:\nSee how to access your super.\nProving you have been to Australia\nRequest your international movement records to get proof of your travel in and out of Australia."
}