{
    "visaID": "visa1.4.3",
    "visaType": "visa1.4",
    "visaName": "Business visitor stream",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/visitor-600/business-visitor-stream",
    "content": "\n1. Visitor visa (subclass 600)\n2. Business Visitor stream\nUp to 3 months\nAUD195.00\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nSee all conditions\nIf you are getting help with your visa, before you pay someone, read information on Who can help with your visa application.\nApply\n3. With this visa you can\nAs a business visitor, you can:\nYou can't:\nIf you want to do short-term work in Australia that isn't a business visitor activity, consider applying for a temporary work visa.\nExplore your visa options.\nYou might not need to apply for a visa to travel to Australia if you hold an Asia-Pacific Economic Cooperation (APEC) Business Travel Card (ABTC). We consider you to have applied for a Visitor visa when you applied for the ABTC.\nABTC holders (other than New Zealanders) might be granted a Visitor (subclass 600) Business Visitor stream visa to visit Australia.  If you hold an ABTC with ‘AUS’ printed on the back, you can enter Australia for short-stay business visitor or tourism activities for as long as the ABTC is valid. The ABTC is valid for 5 years from the date we issue it.\nIf you apply for and are granted a separate visa, the visa associated with your ABTC will cease.\n4. How long you can stay\nThis is a temporary visa.\nYou can stay for the period or dates specified on the visa grant letter. We determine the length of your visa on a case by case basis.\nThings we might consider when determining your stay period include:\nWe may not grant the length of stay you want.\nWe can grant this visa with a single entry or multiple entry.\nIf we grant you a visa with multiple entry, you can leave and return to Australia on the visa while it is valid.\nGenerally, we grant a stay period of 3 months. We might grant a stay of up to 12 months in certain circumstances.\nIf you want to stay longer or permanently in Australia you will need to apply for a visa that allows this.\nExplore your visa options\n5. Stay longer\nYou can't stay in Australia longer by extending this visa. You must apply for another visa.\nYou can only apply for a new visa if your visa does not have a condition that prevents further stay, such as condition 8503. We can waive a no further stay condition in limited circumstances.\nIf you want to have a further short stay or stay longer for a holiday you might be eligible for a Visitor visa (subclass 600) Tourist stream (apply in Australia).\nIf you want to stay longer for other reasons, you might be able to apply for a new visa that suits your circumstances.\nExplore your visa options.\n6. Include family\nYou can't include family members in your application. Each family member, including those listed on your passport, must submit a separate application.\n7. Cost\nThe visa costs AUD195.00 for each applicant.\nYou might also have to pay other costs for:\nTo work out what your visa will cost use the Visa Pricing Estimator. The estimator doesn't take into account the other costs.\n8. Apply outside Australia\nTo be eligible for this visa, you must be outside Australia when you apply and when we decide your application.\nSee other eligibility requirements.\n9. Processing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n10. Your obligations\nYou must meet all visa conditions and obey Australian laws.\nLearn more about visa conditions\n11. Health insurance\nYou are liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability. To cover any unforeseen medical treatment you might need in Australia we strongly recommend you take out adequate health insurance.\nLearn more about health insurance for overseas visitors.\nSome countries have a reciprocal healthcare agreements within Australia.\nIn some circumstances, we may grant your visa with Condition 8501 – Maintain adequate health insurance.\n12. Travel\nCheck if you have multiple entry, or single entry, in VEVO or your visa grant letter.\nIf you have multiple entry, you can travel outside Australia and return while your visa is valid.\nIf you have single entry visa and you leave Australia, you have to apply for another visa to return.\n13. Visa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.​​\nYou must meet our health requirement.\nYou must meet our character requirement.\nIf you owe the Australian government money, you must have paid it back, or have arranged to pay it back.\nYou must have, or have access to, enough money to support yourself while you are in Australia.\nYou must only intend to:\nAs a business visitor, you can:\nYou can't:\nWe might not grant this visa if it is not in the best interests of an applicant under 18.\nCheck your passport. If you need help with your application, get someone to act on your behalf.\nFind out the examinations you might need and how to arrange them.\nYou can complete your health examinations before you apply or you can wait until we tell you to have them.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nInclude as much information as possible to support your application. This includes English translations of your documents.\nWe may decide your application without requesting further information from you.\nFollow these instructions to ensure you submit a complete visa application.\nProvide accurate information.\nSee what happens if you can't prove your identity or don't provide true information.\nAlso provide:\nDocuments that prove a change of name include:\nProvide as much proof as you can to show you are visiting Australia as a temporary visitor only:\nShow us you are a genuine visitor and have reasons to return home by providing:\nTell us what business visitor activities you plan to do in Australia. You could provide:\nProvide any military service records or discharge papers, if applicable.\nWe may ask you to provide a police certificate.\nTo nominate someone to:\nUpload your written notification or your forms to ImmiAccount.\nIf you are under the age of 18, you should provide a copy of your birth certificate showing the names of both parents. If you can’t provide a birth certificate, provide one of the following:\nIf somebody other than your biological parents has legal guardianship over you (for example, adoptive parents or a court-appointed guardian), you must provide proof of their legal guardianship.\nProvide adoption papers or parental court orders, if applicable.\nAnyone with a legal right to decide where you live, and who is not travelling in Australia with you, must complete either:\nInclude a document with the signature and photo of the person who completed the form, or declaration, such as a:\nIn addition to consent information, if you’re not staying with a relative or legal guardian, provide Form 1257 - Undertaking declaration (211KB PDF). The person you’re staying with must sign the form.\nHave all non-English documents translated into English.\nProvide original and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nNote: You do not need to have any documents certified unless we ask you to.\nScan or photograph all documents (English and non-English) in colour.\nThe scans and photos must be clear and legible.\nIf a document is more than one page, save it all as one file.\nAttach a document only once, even if you are using it to show more than one thing.\nLearn more about attaching documents.\nProvide accurate information.\nSee what happens if you can't prove your identity or don't provide true information.\nWe will let you know when we have received your application and documents.\nThere are other things you need to know and might need to do.\nDo not arrange to travel to Australia until we let you know, in writing, that we have granted you the visa.\nIf you travel to Australia on a different visa and that visa ends, you cannot get a bridging visa to stay in Australia. This is because you must be outside Australia when we make a decision on your Visitor visa application.\nWe might ask for biometrics. We will let you know if you need to provide them.\nIf you didn't have health examinations before you applied for the visa, have them if we tell you to\nIf you did not attach all documents when you applied, or if we ask you for more documents, attach them as soon as you can in ImmiAccount.\nWe may decide your application without requesting further information from you.\nLet us know as soon as you can if you made a mistake on your application.\nFind out what to do if you made a mistake on your online application.\nLet us know if you no longer want someone to:\nUpload your written notification or your forms to ImmiAccount.\nFor more information see Who can help you with your application.\nTell us if things change after you submit your application but before we have made a decision.\nThings you need to let us know about include:\nWe will let you know our decision on your visa application in writing. We will tell you:\nKeep a copy of our decision with you when in Australia.\nIf we refuse your visa we will let you know in writing. We will tell you why we refused your visa and whether you have a right to a review of the decision.\nCheck your travel documents\nYou must have:\nComplete an Incoming Passenger Card\nEveryone who arrives in Australia must complete an Incoming Passenger Card.\nUsing the SmartGate\nA SmartGate is an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use the SmartGate.\nYou must meet all visa conditions and obey Australian laws. See your conditions in VEVO or your visa grant letter.\nLearn more about visa conditions and how they work.\nThings you need to let us know about include:\nSee how to let us know if there is a change in your situation.\nAs a business visitor, you can:\nYou can't:\nIf you want to do short-term work in Australia that isn't a business visitor activity, consider applying for a temporary work visa.\nTo see your specific conditions, work and study entitlements use VEVO.\nIf your visa is granted with multiple entries, you can travel outside Australia and return as many times as you want while the visa is valid.\nIf your visa is granted with single entry and you leave Australia, you cannot re-enter on the visa. You have to apply for another visa to come back.\nSee when you must leave in VEVO.\nYou can't stay in Australia longer by extending this visa. You must apply for a new visa if you want to stay longer. See your options.\nTo prove you have a visa and show your conditions to someone, use VEVO.\nRequest your international movement records to get proof of your travel in and out of Australia.\nCheck your travel documents\nYou must have a valid passport or other travel document to leave Australia.\nDepartures SmartGate\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nInternational Movement Record \nRequest your international movement records to get proof of your travel in and out of Australia."
}