{
    "visaID": "visa4.14",
    "visaType": "visa4",
    "visaName": "Skilled Regional visa (subclass 887)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/skilled-regional-887",
    "content": "\n1. Subclass 887\n2. Skilled Regional visa\nPermanently\nFrom AUD490.00\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nSee all conditions\nIf you are getting help with your visa, before you pay someone, read information on Who can help with your visa application.\nApply\n3. With this visa you can\nNewly arrived residents may have to wait before they can access certain Australian Government payments and benefits.\n4. How long can you stay\nThis is a permanent visa. It lets you stay in Australia indefinitely.\nThe visa has a travel component that expires 5 years after the date of visa grant.\nFor citizenship purposes, your permanent residence starts on the day:\n5. Include family\nYou can include members of the family unit in your application if they currently hold an eligible visa. You must include each family member who is eligible to apply for this visa at the time you lodge your application.  You can't add family members after you have submitted your application.\nYou can include family members who no longer meet the standard definition of member of the family unit provided they hold an eligible visa that was granted on the basis that they were a member of your family unit. This provision would apply, for example, if you want to include a child in your application who has turned 23 years of age since they were granted an eligible visa.\nFamily members included in your application must meet our health and character requirements. Family members not accompanying you to Australia may also need to meet our health and character requirements.\nIf you have a child who was born either in or outside Australia since you were granted your current visa you must tell us about your child before you lodge this application. Find out what to do if your child is born after we granted your current visa. If we have not linked your child’s current visa to their passport you will be unable to lodge their application online.\n6. Cost\nThe visa costs AUD490.00 for the main applicant.\nThere is also a charge for each family member who applies for the visa with you.\nYou might have to pay an extra charge for any member of the family unit applicant 18 years old or older who has less than functional English. This charge is called the second instalment charge. Pay it only when we ask you to. We ask for the charge only if we are going to grant the visa.\nThe second instalment charge is AUD4,890.\nTo work out what your visa will cost use the Visa Pricing Estimator. The estimator does not take into account the second instalment or other costs. You might also have to pay other costs for health checks, police certificates and biometrics.\n7. Apply from\nAll applicants must be in Australia and hold an eligible visa at the time a subclass 887 visa application is made unless COVID-19 concessions apply.\n8. Processing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nWe assess applications on a case-by-case basis, and actual processing times can vary due to individual circumstances including:\n9. Your obligations\nYou and your family must follow Australian laws.\n10. Travel\nYou can travel in and out of Australia as many times as you want for 5 years from the date we grant the visa. After 5 years you will need a Resident Return (RRV) to re-enter Australia as a permanent resident.\n11. Visa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nCOVID-19 concessions to lodgement and eligibility requirements are available to eligible prospective Skilled – Regional visa (subclass 887) applicants where they meet criteria set out below.\nEligible prospective subclass 887 visa applicants can make their visa application outside Australia during the concession period and be granted the visa while they are outside Australia. Applicants outside of Australia who lodge during the concession period are given access to shorter employment requirements and shorter residence requirements.\nThese applicants must provide evidence of at least:\nEligible prospective subclass 887 applicants inside Australia who lodge during the concession period are given access to shorter employment requirements.\nThese applicants must provide evidence of at least:\nAll applicants must be in Australia and hold an eligible visa at the time a subclass 887 visa application is made unless COVID-19 concessions apply.\nAn eligible visa is a:\nThe person seeking to satisfy the primary criteria must also have held one of the following eligible visas for a total of 2 years before a subclass 887 visa application is made:\nThe eligible visa must have been granted to them on the basis of satisfying the primary criteria, or on the basis of being the spouse or de facto partner of the person who satisfied the primary criteria.\nNote: The person seeking to satisfy the primary criteria in this application will be the person who seeks to meet the 887 work and residence requirements.\nAt the time you apply for this visa you must have lived for a total of at least 2 years (unless COVID-19 concessions apply), as the holder of one or more eligible visas, in:\nWhen you apply for this visa you must have worked full-time for at least 12 months (unless COVID-19 concessions apply), as the holder of one or more eligible visas:\nFull time work means 35 hours per week.  You can combine work in concurrent part-time employment to satisfy this requirement. You can work in your nominated occupation or any other occupation.\nYou, and any family members holding an eligible visa, must have complied with the conditions attached to your eligible visa when in Australia. This requirement applies for the whole period you hold the visa(s).\nAt the time we make a decision on your application you must:\nYou and any family members who apply for the visa with you must meet our health requirement. As you undertook a health examination for your eligible visa, in most circumstances you will not need to undertake another one.\nYou and family members aged 16 years and over who apply for the visa with you must meet our character requirement.\nFamily members not accompanying you to Australia must also meet the requirement.\nIf you are 18 years of age or older, you must:\nIf you or any family members (including those who do not apply for the visa with you) owe the Australian Government money, you or they must have paid it back or arranged to pay it back.\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused see Limitations on applications in Australia (129KB PDF).\nIf applying for a visa from outside Australia see Can I go to Australia.\nIf you want immigration assistance, see Who can help with your visa application.\nBefore you apply you need to gather and prepare your documents.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nYou and your family members must have valid passports or travel documents to be able to submit an application for this visa.\nYou will need to provide identity, character and other documents that evidence you have complied with your visa conditions in Australia. You will also need to provide documents for your partner and any dependent children.\nProvide accurate information. See what happens if you can't prove your identity or do not provide true information.\nUnless COVID-19 concessions apply, you must provide proof that you have lived for a total of at least 2 years, and worked full-time (minimum 35 hours a week) for at least 12 months as the holder of an eligible visa in one or more areas listed as:\nThe evidence provided should demonstrate that you and any family members included in your application have complied with your visa conditions when in Australia.\nProof of full-time work can include but is not limited to:\nTo satisfy the full time work requirement the 35 hours can comprise hours worked in one or more jobs in each week.  Suitable evidence will need to be provided for each position to support your claims.\nFor periods of self or contract employment, proof can include but is not limited to:\nThe evidence should demonstrate that your self-employment activities require you to be active in the business for at least 35 hours a week.\nProof of residence can include but is not limited to:\nProvide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\nAlso provide:\nDocuments that prove a change of name include:\nIf you are or have been married, widowed, divorced or permanently separated, provide proof such as marriage certificates, divorce documents, death certificates, separation documents or statutory declarations.\nIf your partner or dependent children are not included in this application, tell us the reason why (for example, they already hold Australian citizenship or are a permanent resident).\nProvide an Australian police certificate if you have spent a total of 12 months or more in Australia in the last 10 years since you turned 16.\nWe only accept complete disclosure National Police Certificates issued by the Australian Federal Police. We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police.\nFor immigration purposes, Australian police certificates are valid for 12 months from the date of issue.\nAlso provide:\nComplete and provide the following forms:\nProvide proof that all applicants aged 18 years and older, who have not paid the second instalment of the visa application charge in respect of their eligible visa, have at least functional English.\nApplicants aged 18 years and older, who have not paid the second instalment visa application charge in respect of their eligible visa and can't provide evidence of functional English, will need to pay the second instalment of the visa application charge when we ask for it.\nWe need to see evidence of your partner's identity and relationship with you.\nProvide:\nFor de facto relationship provide either:\nFor both married and de facto applicants you must provide evidence that you are in a genuine and continuing relationship. Evidence can include but is not limited to:\nYour dependant must hold an eligible visa.\nFor every dependant 18 years old or younger who is applying with you, provide:\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\nThey must complete either:\nAlternatively, you can show us:\nInclude:\nYou don't have to prove that your dependant under 18 years of age has functional English.\nTo include your child who is over 18 in your visa application, they must hold an eligible visa that was granted on the basis that they were a member of your family unit.\nProvide:\nTo nominate someone to:\nUpload your written notification or your forms to ImmiAccount.\nHave all non-English documents translated into English.\nProvide original and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited but on each translation, they must include their:\nThese details must be in English.\nScan or photograph all documents (English and non-English) in colour.\nThe scans and photos must be clear.\nNote: You do not need to have any documents certified\nIf a document is more than 1 page, save it all as 1 file.\nYou can apply for this visa online. You can be inside or outside Australia when you apply.\nProvide accurate information. See what happens if you can't prove your identity or do not provide true information.\nWe will let you know when we have received your application.\nIf you are granted a bridging visa you will receive notification of your visa grant.\nWe do not give updates on applications under assessment.\nYou can check if we need more information from you in ImmiAccount.\nYou don't have to tell us if you want to travel outside Australia while we process your application. This is because you can be outside Australia when we make a decision.\nIf you leave Australia, make sure you have a valid visa to return. To see if you can return on your current visa, check VEVO.\nLearn about visa expiry.\nWe will let you know if you need health examinations.\nWe might ask for biometrics (fingerprints and photo). We will let you know if you need to provide them.\nIf you did not attach all documents when you applied, attach them as soon as you can in ImmiAccount.\nWe might also ask you to provide more information; however we are not obliged to do so and we may make a decision on your application without asking for more documents.\nMake sure you stay lawful in Australia by holding a valid visa while we process your application.\nWhen you applied for this visa, you were granted a Bridging visa A (BVA). If your current visa expires before we decide on your application, the BVA will come into effect. You can stay in Australia on the BVA while we process your new visa application.\nDo not ask to have the visa you currently hold cancelled. If your visa is cancelled:\nLearn more about visa expiry.\nIf you need to pay a second instalment, pay it when we send you the invoice.\nYou can't add family members after you have submitted your application, except for newborn children.\nIf your child is born after you submit your application but before we decide on your visa, you must tell us as soon as possible.\nFind out what to do if your child is born after you apply.\nYou must tell us as soon as possible if you made a mistake on your application.\nComplete Form 1023 Notification of incorrect answers (168KB PDF) and attach it in ImmiAccount.\nLet us know if you no longer want someone to:\nUpload your written notification or your forms to ImmiAccount.\nFor more information see Who can help you with your application.\nThings you need to let us know about after you have applied include:\nSee how to tell us if your situation changes.\nYou can be inside or outside Australia when we decide your visa application. We will let you know our decision in writing.\nIf we grant your visa, we will tell you:\nKeep a copy of the decision.\nIf we refuse your visa, we will tell you:\nWe will not refund the application charge if we refuse your application.\nYou and your family members must obey Australian laws.\nThis is a permanent visa. It lets you stay in Australia indefinitely.\nYou can travel to and from Australia for 5 years from the date we grant the visa. After 5 years you will need a Resident Return (RRV) visa (subclass 155 or 157) to re-enter Australia as a permanent resident. To see when the 5 years ends, use VEVO.\nIf an immigration officer processes your clearance at our border, we recommend you tell them:\nIf you don't tell them, you might be granted a subclass 444 visa. Grant of a subclass 444 visa will cease your permanent visa, which will then affect your eligibility for Australian citizenship.\nTo prove you have a visa and show your conditions to someone, use VEVO.\nYou are protected by Australian workplace law. See your workplace rights and entitlements.\nAs an Australian permanent resident, you might be able to sponsor eligible family to come to Australia.\nTo find a visa for your family member, explore visa options.\nAfter a certain time, you might be eligible for Australian citizenship. Find out more about becoming a citizen.\nFor citizenship purposes, your permanent residence starts on the day we granted the visa.\nYou must have a valid passport or other travel document to leave Australia and return.\nCheck the travel component of your visa in VEVO.\nSee what to do if your visa has expired or is about to expire.\nWe have an automated process that uses facial recognition technology and your ePassport. You could leave the airport faster if you use SmartGate.\nRequest your international movement records to get proof of your travel in and out of Australia."
}