{
    "visaID": "visa4.20.3",
    "visaType": "visa4.20",
    "visaName": "Domestic Worker (Diplomatic or Consular) stream",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-work-403/domestic-worker",
    "content": "\n1. Temporary Work (International Relations) visa (subclass 403)\n2. Domestic Worker (Diplomatic or Consular)\nUp to 12 months on your first visa.\nA further Domestic Worker stream visa will let you stay for the time specified in your Department of Foreign Affairs and Trade (DFAT) support letter.\nFrom AUD365.00\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nSee all conditions\nIf you are getting help with your visa, before you pay someone, read information on Who can help with your visa application.\nApply\n3. With this visa, you can\n4. How long can you stay\nThis is a temporary visa. If this is the first time you are applying for this visa, you can usually only stay for 12 months.\nYou can apply for a further Domestic Worker stream visa in Australia before your current visa expires. You must not be in immigration clearance. You can stay for the length of time in your support letter from the Department of Foreign Affairs and Trade (DFAT).\nThe visa is granted with multiple entry. You can leave and re-enter Australia as many times as you want while the visa is valid.\nThe visa starts:\nYour visa grant letter will tell you how long you can stay.\n5. Stay longer\nYou can't stay in Australia longer by extending this visa.\nYou can apply for a further Domestic Worker stream visa in Australia if you:\nIf you want to stay longer for other reasons, you must apply for a new visa that suits your circumstances. See Explore your visa options.\n6. Include family\nYou can't include family members in your visa application.\n7. Cost\nThe visa costs AUD365.00 for the applicant.\nYou may also have to pay other costs for police certificates, biometrics and health checks.\nTo work out how much this visa costs, use the Visa Pricing Estimator. The estimator does not take into account the other costs.\n8. Apply from\nYou must be outside Australia when you apply and when we decide on your first application.\nIf you apply for a further Domestic Worker visa, you can be in or outside Australia, but not in immigration clearance.\n9. Processing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application might take longer to process if:\nWe cannot process your application if you do not pay the correct visa application charge. We will tell you if this is the case and invalidate your application.\n10. Your obligations\nIf we grant you a visa you must comply with all visa conditions and Australian laws.\nLearn more about conditions for this visa.\n11. Travel\nYou can travel outside Australia and return as many times as you want while the visa is valid.\nThe time you spend outside Australia does not extend the visa.\n12. Visa Label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nYou must be aged 18 years of age or older.\nYou must have a letter of support from the Australian Government Department of Foreign Affairs and Trade (DFAT).\nYour pay and working conditions must meet the relevant Australian legislation and awards.\nAustralian workplace laws apply to all workers employed in Australia, see Fact sheet for foreign officials about private domestic workers.\nWhile you are in Australia, you must have the financial capacity to support yourself.\nWe need to meet with you to confirm your identity, employment details and see your documents. This may be at your nearest:\nYou must intend to work as a full-time domestic worker in the Australian household a person who holds a Diplomatic visa (subclass 995).\nFor more information on your workplace rights and conditions, see Fact sheet for Private Domestic Workers.\nIf you apply from in Australia, you must already hold a Temporary Work (International Relations) visa (subclass 403) in the Domestic Worker (Diplomatic or Consular Stream).\nYou must meet our health requirement.\nIf you apply for this visa outside Australia, members of the family unit who are not coming to Australia may also have to meet our health requirement.\nYou must meet our character requirement.\nWe might also ask that family members who are not coming to Australia meet the requirement.\nYou are personally liable for all your healthcare costs while you are in Australia. Medical insurance helps limit your financial liability.\nYou must have adequate health cover for the whole of your stay to be granted this visa. Your cover should cover you for medically necessary treatment, including transport.\nLearn more about health insurance for overseas visitors.\nSee more about health insurance for overseas visitors.\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements.\nYou must have a genuine intention to:\nIf you owe the Australian Government money, you must have paid it back or formally arrange to pay it back.\nWe will consider your immigration history when we decide on your application. This means you may not be eligible for this visa if you have had a visa cancelled or refused.\nIn some cases you may still apply for a permanent visa if you have had a visa cancelled or an application refused. See Limitations on applications in Australia.\nIf applying for a visa from outside Australia, see Can I go to Australia.\nIf you need immigration help, see Who can help with your visa application.\nIf you need help with your application, nominate someone to help.\nYou might need to have health examinations. You can complete them before you apply or you can wait until after you apply.\nFind out the examinations you need and how to arrange them if you want to have them before you apply.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nGather documents to prove your identity and show you have your employer's support, financial support and health insurance. You must prepare them to submit online.\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nProvide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\nAlso provide:\nA copy of your employment contract signed and dated by both parties.\nLetter of support from the Department of Foreign Affairs and Trade (DFAT).\nTo prove that you can support yourself in Australia, give us:\nWe can also consider allowances, accommodation and other help from your employer.\nWe will tell you if and when you need to get a police certificates.\nTo nominate someone to:\nUpload your written notification or your forms to ImmiAccount.\nHave all non-English documents translated into English.\nProvide original and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nNote: You do not need to have any documents certified.\nScan or photograph all documents (English and non-English) in colour.\nThe scans and photos must be clear.\nIf a document is more than one page, save it all as one file.\nApply for this visa online. You must be outside Australia when you submit your first application.\nYou can apply for a further Domestic Worker visa from in or outside Australia, but not in immigration clearance.\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nWe will not process your application until you pay the charge.\nWe will let you know when we have received your application.\nWe can’t give updates on applications within the standard processing time.\nYou can check if we need more information from you in ImmiAccount\nIf you are in Australia, you don't have to tell us if you want to travel outside Australia while we process your application. This is because you can be outside Australia when we make a decision.\nBut if you leave Australia, make sure you have a valid visa to return.\nLearn about visa expiry.\nIf you didn't have health examinations before you applied, we will let you know if you need them. Check ImmiAccount.\nWe might ask for biometrics (fingerprints and photo). We will let you know if you need to provide them.\nIf you did not attach all documents when you applied, attach them as soon as possible in ImmiAccount.\nIf you are in Australia, make sure you stay lawful by holding a valid visa while we process your application.\nIf you applied for this visa in Australia and your application was assessed as valid, you were granted a bridging visa. If your current visa expires before we decide on your application, the bridging visa will start. You can stay in Australia on the bridging visa while we process your new visa application.\nLearn more about visa expiry\nLet us know as soon as you can if you made a mistake on your application.\nComplete Form 1023 Notification of incorrect answers (168KB PDF) and attach it in ImmiAccount.\nLet us know if you no longer want someone to:\nUpload your written notification or your forms to ImmiAccount.\nFor more information see Who can help you with your application.\nThings you need to let us know about after you have applied include:\nSee how to tell us if your situation changes.\nYou must be outside Australia when we decide on your first visa. You can be in or outside Australia, but not in immigration clearance, when we decide on a further visa application.\nWe will let you know our decision in writing.\nIf we grant your visa, we will tell you:\nKeep a copy of the decision.\nIf we refuse your visa, we will tell you:\nWe will not refund the application fee if we refuse your application.\nYou must have a valid:\nAll people arriving Australia must complete the Incoming Passenger Card. You will receive this card on board.\nWe have an automated process that uses facial recognition technology and your ePassport. You could leave the airport faster if you use SmartGate.\nTo see your specific conditions and work entitlements use VEVO.\nYou must meet all visa conditions and obey Australian laws.\nSee your conditions in VEVO\nLearn more about visa conditions and how they work.\nThings you need to let us know about when you have this visa include:\nSee what to do if your situation changes.\nTo see when you must leave, use VEVO.\nYou can't stay in Australia longer by extending this visa.\nYou can apply for a further Domestic Worker stream visa in Australia, but not in immigration clearance, if you:\nIf you want to stay longer for other reasons, you must apply for a new visa that suits your circumstances, see Explore your visa options.\nYou can travel outside Australia and return as many times as you want while the visa is valid.\nTime spent outside Australia does not extend the visa.\nSee your conditions in VEVO.\nTo prove you have a visa and show your conditions to someone, use VEVO.\nTo see your conditions for work, use VEVO.\nIf you have permission to work, Australian workplace law protects you. See your workplace rights and entitlements\nYou must have a valid passport or other travel document to leave Australia.\nSee what to do if your visa has expired or is about to expire.\nWe have an automated process that uses facial recognition technology and your ePassport. You could leave the airport faster if you use SmartGate.\nYou are likely to have some money in a superannuation fund if you worked in Australia and you are:\nSee how to access your super.\nTo get proof of your travel in and out of Australia request your international movement records."
}