{
    "visaID": "visa6.5",
    "visaType": "visa6",
    "visaName": "Crew Travel Authority visa (subclass 942)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/crew-travel-authority-942",
    "content": "\n1. Crew Travel Authority\nThere are no processing times available for this visa.\nSee all conditions\n2. About this authority\nUnder the Special Purpose visa framework, a Crew Travel Authority (subclass 942) is an electronic immigration record. Commercial airlines register crew members for Crew Travel Authorities to aid uplift. The registration is valid for the life of the passport. Commercial airlines can use the Carrier Portal to check that their international aircrew can legally enter Australia.\nInternational airline flights include:\nCrew members with Australian or New Zealand passports do not need Crew Travel Authorities.\nIf you are a New Zealand citizen further information regarding your entry requirements, entitlements and pathway to permanent residence and citizenship can be found at the New Zealand citizens webpage.\n3. Private flight operators\nPeople operating private flights can't register for, or use a Crew Travel Authority (subclass 942) to enter Australia. The flight must be a commercial or chartered flight carrying passengers or cargo.\nTo see what other visas you might be eligible for use the Visa Finder.\n4. With this travel authority you can\n5. How long you can stay\nIf you are an international airline crew member or aircraft safety inspector, you can stay in Australia for up to 30 days.\nIf you are an airline positioning crew member, you can stay in Australia for up to 5 days.\n6. New Zealand passport holders\nIf you are a New Zealand citizen crew member who arrives in Australia and do not hold another visa (such as a permanent residence visa) and you wish to remain in Australia longer than the above periods, you should not enter Australia via SmartGate. Instead, you should approach a border clearance officer and make an application to be granted a Special Category visa (subclass 444) by:\nThe SCV will allow you to live, visit, work and study in Australia.\nWhen you leave Australia, your SCV will end. Next time you enter Australia, you will apply for a new SCV.\nEntering Australia on a Special Purpose visa as a crew member rather than an SCV may impact your status as a resident for social security purposes.\nIf you apply for the SCV after you arrive in Australia, you will need to apply online and attend an appointment. For further information see New Zealand citizens\n7. Stay longer\nYou can't stay in Australia as the holder of a Special Purpose visa longer than allowed. You must apply for another type of visa if you want to stay longer.\n8. Cost\nFree\n9. Obligations\nYou must obey Australian laws. You cannot use a Crew Travel Authority to:\n10. Travel\nYou can travel outside Australia and return as many times as you want when working as an airline aircrew member or as an airline safety inspector, while the Crew Travel Authority is valid.\nThe time you spend outside Australia does not extend the Crew Travel Authority.\nThe Crew Travel Authority registration is valid for the life of your passport and is based on your passport expiry date.\n11. Visa label\nWe will digitally link your Crew Travel Authority to your passport. You will not get a label in your passport.\n12. Include family\nYou can't include family on this travel authority.\nYou must be travelling on an international airline flight that is a:\nYou must also be:\nAir carriers usually register crew members for Crew Travel Authorities. If you plan to renew your passport, you need to do so before your carrier registers you for a Crew Travel Authority (CTA).\nYour CTA is linked to your passport number. You need to use the same passport to travel to Australia.\nYou will need:\nSee the documents you will need to show when you arrive in Australia.\nYou are obliged to prove your identity and provide true information with your application.\nWe will grant Aircraft safety inspectors a Special Purpose visa for 30 days, beginning when they disembark from the aircraft, provided they hold:\nYou must also be included in a list of crew members given to us by or for the carrier that operates the aircraft.\nWe will grant Airline crew members a Special Purpose visa for 30 days, beginning when they disembark from the aircraft, provided they hold:\nThey must also be included in a list of crew members provided to us by or for the carrier that operates the aircraft.\nCrew members on freight flights should also be listed on the General Declaration Form signed on behalf of the air carrier.\nAirline positioning crew members are automatically granted a Special Purpose visa for 5 days, beginning when they disembark from the aircraft, provided they hold a valid passport.\nThey must also have a letter from their employer that:\nCarriers can register crew members through Carrier Portal. They can also check whether crew members hold valid Crew Travel Authorities.\nCarriers that do not have access to the Carrier Portal can register crew for Crew Travel Authorities by emailing appinfringements@abf.gov.au\nThe airline carrier will be notified immediately if your registration is successful. See what you can and must do after you are registered.\nYou must obey all Australian laws while in Australia.\nThings you need to let us know about after you have applied include:\nSee how to tell us if your situation changes.\nFor any other issues, email appwebsite@abf.gov.au\nYou must have a valid:\nAfter registering for a Crew Travel Authority, you must also show other documents when you arrive in Australia.\nWe will grant Airline crew members a Special Purpose visa for 30 days, beginning from their arrival in Australia, provided they:\nCrew members on freight flights should also be listed on the General Declaration Form signed on behalf of the air carrier.\nAirline positioning crew members are automatically granted a Special Purpose visa for 5 days, beginning from their arrival in Australia, provided they hold a valid passport or other travel document.\nThey must also have a letter from their employer that:\nWe will grant Aircraft safety inspectors a Special Purpose visa for 30 days, beginning from their arrival in Australia, provided they:\nYou can't stay in Australia longer by extending this travel authority. You must apply for another visa if you want to stay longer.\nAirline carriers and Australian border officials can use the Advance Passenger Processing system to check whether crew members hold valid Crew Travel Authorities.\nYou must have a valid passport or other travel document to leave Australia.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nTo prove you have been to Australia, request your international movement records."
}