{
    "visaID": "visa3.19.1",
    "visaType": "visa3.19",
    "visaName": "Partner visa (Temporary)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/partner-onshore/temporary-820",
    "content": "\n1. Subclass 820\n2. Partner visa (temporary)\n3. For Applicants\n4. For Sponsors\nTemporarily until your permanent Partner visa (subclass 801) application is finalised or you withdraw your application.\nFrom AUD9,095.00 for most applicants. From AUD1,515 for Prospective Marriage visa (subclass 300) holders.\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nSee all conditions\nIf you are getting help with your visa, make sure you read information on Who can help with your visa application.\nApply\n5. With this visa you can\n6. How long you can stay\nYou can stay in Australia until your permanent Partner visa (subclass 801) application is finalised or you withdraw your application.\nFor information on processing times for the permanent stage see Partner visa (Permanent) (subclass 801).\n7. Include family members\nYou can include a dependent child in your application either when you lodge your visa application, or after you lodge your application but before we decide on your temporary visa.\nFamily members who apply with you must:\nFamily members who are not coming to Australia might also have to meet our health requirement and character requirement.\nFor information on what to do if your child is born after you apply see You had a baby.\nIf you hold or have held a Prospective Marriage visa (subclass 300), you can also include members of the family unit who hold or have held a Prospective Marriage visa (subclass 300) at the time you apply for this visa. You cannot add these family members after you submit your subclass 820 application.\n8. Cost\nCosts for this application differ depending on your circumstances and which visa you hold. The costs below cover this Temporary visa and the Permanent Partner visa (subclass 801).\nMost applicants: AUD9,095.00 for the main applicant.\nProspective Marriage visa (subclass 300) holders: AUD 1,515 for the main applicant.\nIf you previously held a Prospective Marriage visa but didn't apply for the subclass 820 and 801 visas before that visa expired: AUD 1,920 for the main applicant.\nThere is also a fee for each family member that applies for the visa with you.\nWe cannot process your application if you do not pay the correct visa application charge.\nYou might also have to pay other costs for health checks, police certificates and biometrics.\nTo work out how much your visa will cost, including adding additional family members, use the Visa pricing estimator.\nThe estimator does not take into account the costs for health checks, police certificates and biometrics.\n9. Apply for this visa\nYou must be in Australia when you apply for this visa. Family members who apply with you must also be in Australia.\n10. Your obligations\nYou and your family members must meet all visa conditions and obey Australian laws.\nSee what conditions might be attached to this visa on our visa conditions page.\n11. Adequate health insurance\nDepending on your circumstances, you may be eligible to access Australia’s public health care system, Medicare, while you await a decision on your visa application. For more information, see Medicare\nIf you are not eligible for Medicare, we recommend you take out health insurance to cover any unforeseen medical treatment you might need in Australia. Otherwise, you will be personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability. For more information, see Adequate health insurance.\nLearn more about health insurance for overseas visitors.\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal health care agreement.\nYou can get Australian residents' private health insurance if you have an interim (blue) Medicare card or a full (green) Medicare card.\n12. Travel\nYou can travel to and from Australia as many times as you want while you hold this visa.\n13. Visa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n14. Frequently asked questions\nYou can find the answers to common questions about this visa at Partner Program Frequently Asked Questions (FAQs).\nYou might not be eligible to apply for this visa if you do not hold a substantive visa and you have had a visa cancelled or refused, see Limitations on applications in Australia.\nIf you do not hold a substantive visa and are eligible to apply for this visa, you must do the following:\nIf this information is not included when you lodge your application, it may be deemed invalid.\nNote: If you do not hold a substantive visa at the time you apply for this visa, you will have to meet additional criteria to be granted this visa.\nIf you want immigration assistance, see Who can help with your visa application.\nYou might not be eligible to apply if you are the holder of certain regional visas.\nIf you are the holder of or your last substantive visa was one of the following, you must have held that visa for at least two years before you can apply:\nIf you are the holder of or your last substantive visa was one of the following, you must have held that visa for at least three years before you can apply:\nEligible applicants must apply for this visa in Australia. Family members who apply with you must also be in Australia.\nYou can apply for this visa if your current or previous visa does not have a condition that prevents further stay, such as condition 8503. You might be able to request a waiver of the no further stay condition in some circumstances. A waiver must be approved before you can apply for this visa. See No Further stay waiver.\nYou need to be aware of your visa status before you apply for this visa. Use VEVO to check your visa details and conditions.\nIf you want immigration assistance, see Who can help with your visa application.\nYou and anyone who applies for the visa with you must have a sponsor when you lodge your application and when you are on this visa.\nYour sponsor is usually your partner.\nWe must approve your sponsor.\nYou cannot change your sponsor. The person who sponsors you when you apply for the visa must be same person who sponsors you for 2 years after we grant your temporary Partner visa (subclass 820).\nYou may still be eligible for the temporary and permanent visa if your relationship ends or your partner dies. All information you provide is confidential. For more information, see Your relationship has changed.\nYou will need to be in Australia and apply for the Partner visa (subclasses 820 and 801).\nIf you are experiencing domestic and family violence, you may still be eligible for the grant of your temporary and permanent visa. For more information, see Family Violence Provisions.\nMarried applicants must, in most cases, be 18 or older when they apply. This is because usually, you must be 18 or older to be married under Australian law.\nApplicants in de facto relationships must be 18 or older when they apply.\nIf you do not hold a substantive visa at the time you apply for this visa and you did not previously hold a Prospective Marriage (subclass 300) visa, you must demonstrate that compelling reasons exist for the grant of a Partner visa.\nYou need to be aware of your visa status before you apply for this visa. Use VEVO to check your visa details and conditions.\nIf you want immigration assistance, see Who can help with your visa application.\nYou must be the spouse or de facto partner of an:\nThis applies when you make your application and when your application is being decided.\nYour relationship can be with someone of the same or different sex.\nIf you are experiencing domestic and family violence, we may be able to help you. You can apply for consideration to be granted your temporary and permanent visa. For more information, see Domestic and family violence and your visa.\nFor more information see Changes in your situation.\nYou are a married applicant if your marriage is valid under Australian law, and:\nTo find out if your marriage is valid under Australian law, contact the relevant state or territory agency for births, deaths and marriages.\nTo be a de facto partner, you must be in a de facto relationship.\nYou and your partner are in a de facto relationship if:\nUsually you must be in a de facto relationship for at least 12 months immediately before you apply for this visa. Time spent dating or in an online relationship might not count as being in a de facto relationship.\nThe 12-month requirement will not apply if you can show us compelling and compassionate circumstances exist for you to be granted the temporary Partner visa (subclass 820).\nThe 12-month requirement also will not apply if:\nIt also will not apply if:\nYou, any members of the family unit, or dependent children who apply for the visa with you, must meet our health requirement. Family members who do not accompany you to Australia might also need to meet our health requirement.\nYou and any family members who apply for the visa with you, must meet our character requirement. Family members who do not accompany you to Australia might also need to meet our character requirement.\nIf you or any family members owe the Australian government money, you or they must have paid it back or arranged to pay it back.\nThis may include family members who do not accompany you to Australia.\nYou and any family members who apply with you who are 18 years of age or older, must:\nWe might not grant this visa if it is not in the best interests of an applicant under 18.\nThere are things you need to know and might need to do before you apply.\nYou can appoint anyone to receive correspondence on your behalf relating to your visa application.\nTo appoint someone to receive your correspondence, use Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF).\nIf you need help with your application, you can appoint someone to give you immigration assistance. A person who gives you immigration assistance can:\nWe treat any correspondence they send as if it came from you.\nIf you appoint someone to give you immigration assistance they must be:\nTo appoint someone to provide immigration assistance, use Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (225KB PDF).\nFor more information, see who can help you with your application.\nYou should provide all required information with your application, or as soon as possible after you apply. Applications with all required information reduce processing delays.\nYou have the option to obtain your police certificates before you apply. However for immigration purposes, police certificates are valid for 12 months from the issue date.\nIf more than 15 months has passed since your National Police certificate (NPC) was issued by the Australian Federal Police (AFP), new checks will be required to progress your application.\nEnsure that all information you provide is accurate. As a visa applicant, you must prove your identity and provide true information with your application. For more information see Providing accurate information.\nProvide a birth certificate showing the names of both parents.\nIf you cannot provide this, provide the identification page for one of the following:\nAlso provide:\nYou need to provide evidence of:\nYou need to provide evidence of your relationship with your partner. This evidence must show that:\nRelationship history\nTell us in writing about:\nRelationship documents\nIf you are married, provide your marriage certificate or other evidence that your marriage is valid in Australia.\nIf you are a de facto partner, you need to provide evidence of your de facto relationship.\nEvidence of your de facto relationship\nIn addition to documents proving your relationship, show us you have been in your de facto relationship for at least 12 months before you applied for this visa.\nIf you haven't been with your de facto partner for 12 months, you can:\nFinances\nEvidence you and your partner share financial matters. Evidence can include:\nYour household\nEvidence you and your partner share domestic matters. Evidence can include:\nSocial matters\nEvidence that others know about your relationship.\nYou must provide statements from 2 witnesses who:\nStatements from witnesses can be done by completing Form 888 – Supporting statement in relation to a Partner or Prospective Marriage visa application (241KB PDF).\nIf the witness is an Australian citizen or permanent resident, provide evidence of this such as a passport or birth certificate.\nEvidence can also include:\nCommitment\nEvidence you are committed to a long-term relationship with each other. Evidence must show that you:\nYou can also provide the terms of your wills as evidence.\nIf you have previously been married, widowed, divorced or permanently separated, provide divorce documents, death certificates, separation documents or statutory declarations.\nFor every dependent child under 18 years old who is applying with you, provide:\nParental responsibility documents\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\nThey must complete either of the following:\nInclude:\nAlternatively, you can show us one of the following:\nTo include your dependent child who is over 18 in your visa application, they must:\nProvide:\nYou must also provide evidence the child is dependent on you. This includes the following:\nProspective Marriage visa holders\nIf you hold or have held a Prospective Marriage visa (subclass 300), you can also include members of the family unit who hold or have held a Prospective Marriage visa (subclass 300) at the time you apply for this visa. You cannot add these family members after you submit your subclass 820 application.\nTranslate\nHave all documents translated into English.\nProvide original and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. On each translation, they must include their:\nThese details must be in English.\nScan or photograph\nScan or photograph all documents (English and non-English) in colour.\nThe scans and photos must be clear enough to read.\nIf a document is more than one page, save it all as one file.\nYou do not need to have any documents certified.\nYou must apply online and while in Australia.\nWe cannot process your application if you do not pay the correct visa application charge.\nTo find information for how to apply as a sponsor, click on the “Personalise this page” toggle above to view this information.\nThe partner visa application form will ask you for your own phone number and email address. It is important to provide your own contact details in case we need to contact you directly about your application.\nOnly attach a document once, even if you are using it to show more than one thing.\nClearly label your documents.\nKeep a copy of your completed application.\nYou can attach up to 100 documents for each person on your application.\nThe attachment limit cannot be increased.\nIf you reach the attachment limit for an applicant, you can attach more documents to other clients on the application.\nFor more information see Applying online in ImmiAccount (homeaffairs.gov.au).\nFrequently asked questions\nA list of common questions and answers is available at Partner Program Frequently Asked Questions (FAQs).\nWe will let you know when we have received your application.\nYou need to have health examinations.\nTo organise your health examinations, see What health examinations you need.\nWe cannot grant you a visa unless you have a valid health assessment.\nThe results of your health assessment are valid for 12 months from the time you completed your examinations. If we ask you to sign a health undertaking, this will be valid for 6 months.\nFor more information on health requirements, see Health.\nProspective Marriage (subclass 300) visa holders\nIf you had health examinations for your subclass 300 visa, you might not need to have them again. We will let you know if you need them.\nIf you have spent a total of 12 months or more in Australia in the last 10 years (since you turned 16), you must provide an Australian police certificate.\nWe only accept complete disclosure National Police Certificates issued by the Australian Federal Police. We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police.\nTo get an Australian police certificate see National Police Checks.\nAlso provide:\nFor immigration purposes, police certificates are valid for 12 months from the issue date.\nTo get an overseas police certificate, see Offices and locations.\nComplete and attach to your application Form 80 Personal particulars for assessment including character assessment (596KB PDF).\nTo help ensure your application is processed as quickly as possible, attach all necessary supporting documents to your application. The checklist provided on ImmiAccount will help make sure you include all required documents in your application.\nIf your application is within standard processing times, do not contact us. We cannot provide any further updates on your application's progress. You can see if we have asked for more information in your ImmiAccount.\nTo see standard processing times for this visa see Global processing times.\nA list of common questions and answers is available at Partner Program Frequently Asked Questions (FAQs).\nYou can travel outside Australia and return if your current visa lets you.\nIf you hold a bridging visa see Travel on a bridging visa (homeaffairs.gov.au)\nIf you leave Australia, make sure you have a valid visa to return.\nYou do not need to provide biometrics for this visa.\nIf you did not attach all documents when you applied, attach them in ImmiAccount as soon as you can.\nWe might ask you to provide more information.\nFor more information on attaching documents in ImmiAccount see Applying online in ImmiAccount\nIf you are unable to upload the relevant documents to your application in ImmiAccount, you need to contact us using the Partner Processing Enquiry Form.\nYou can add a dependent child to your application before we decide on your visa. Your child must be in Australia.\nComplete Form 1436 - Adding an additional applicant after lodgement (481KB PDF) and attach it to your ImmiAccount.\nAfter you have attached the form, let us know by using the Partner Processing Enquiry Form.\nNewborn children\nIf you have a baby, you will need to let us know. For more information, see You had a baby.\nAfter you have updated us in ImmiAccount, let us know by using the Partner Processing Enquiry Form.\nTell us if things change after you apply but before we have made a decision.\nThings you need to let us know about include:\nFor more information, see Change in your situation.\nIf you are unable to upload the relevant documents to your application in ImmiAccount, you need to contact us using the Partner Processing Enquiry Form.\nDepending on your situation you may need to complete the Notification of Relationship Cessation form in ImmiAccount. To confirm, check Your relationship has changed.\nIf you do not have access to ImmiAccount, you can notify us using the Partner Processing Enquiry Form.\nYou may still be eligible for a temporary and permanent visa if your relationship ends or your partner dies. All information you provide is confidential.\nIf you are experiencing domestic and family violence, we may be able to help you. You may still be eligible for the grant of your temporary and permanent visa. For more information, see Family Violence Provisions.\nMake sure you stay lawful by holding a valid visa while we process your application.\nIf you held a valid substantive visa when you applied for your partner visa, you were granted a Bridging visa A (BVA). If your current visa expires before we decide your application, the BVA will start. You can stay in Australia on the BVA while we process your new visa application.\nSee what to do if your visa has expired or is about to expire.\nLet us know if you no longer want someone to:\nAfter you have attached the form to ImmiAccount, let us know by using the Partner Processing Enquiry Form.\nLet us know as soon as you can if you have made a mistake on your application.\nFor more information see After you apply\nIf you are unable to update your application in ImmiAccount, you need to contact us using the Partner Processing Enquiry Form.\nYou can be in or outside Australia when we decide your temporary visa application.\nWe will let you know our decision in writing.\nIf we grant your visa, we will tell you:\nKeep a copy of the decision.\nIf we refuse your visa, we will tell you:\nWe will not refund the application fee if we refuse your application.\nYou can stay until your permanent Partner visa (subclass 801) application is finalised or you withdraw your application.\nYou and your family members must meet all visa conditions and obey Australian laws.\nUse VEVO to check visa details and conditions.\nYou can travel outside and return to Australia as many times as you want.\nIf an immigration officer processes your clearance at our border, tell them:\nIf you do not tell them, you might be granted a 444 visa. Grant of a subclass 444 visa will override your temporary Partner visa. This means you will not be eligible for the permanent Partner visa (subclass 801).\nTo prove you have a visa and show your conditions to someone, use VEVO.\nAustralian visas are digital. We do not put a visa label in your passport. Instead, we link your digital visa record to your passport.\nYour digital visa record is also used by:\nWith this visa you will have full work rights and are protected by Australian workplace law. See your workplace rights and entitlements.\nWith this visa you will be able to study in Australia. However you will not receive any government support and any study costs will be at your own expense.\nYou might have to wait to access certain Australian Government payments and benefits. Learn more about newly arrived residents' waiting periods from Services Australia.\nYou cannot add family members to your visa application after we grant the Partner visa (Temporary) (subclass 820).\nTo include a dependent child in your permanent visa application after we have granted you a subclass 820 visa, but before we have finalised your permanent Partner visa (subclass 801), your child must first apply for a Dependent child visa (subclass 445).\nOnce your child holds a Dependent child visa (subclass 445), you can include them in your permanent Partner visa application. Your child must be in Australia.\nComplete and attach to your application in ImmiAccount Form 1002 - Application by a subclass 445 dependent child for a permanent partner visa (279KB PDF).\nAfter you have attached the form to ImmiAccount, let us know by using the Partner Processing Enquiry Form.\nIf you have a baby after you have been granted this visa, you need to let us know. For more information see You had a baby.\nTell us if things change. Things you need to let us know about include:\nSee what to do if there is a change in your situation.\nIf you do not have access to ImmiAccount you can let us know by us completing the Partner Processing Enquiry Form.\nDepending on your situation you may need to complete the Notification of Relationship Cessation form in ImmiAccount. To confirm, check Your relationship has changed.\nIf you do not have access to ImmiAccount, you can notify us using the Partner Processing Enquiry Form.\nYou may still be eligible for the permanent visa if your relationship ends or your partner dies. All information you provide is confidential.\nIf you are experiencing domestic and family violence, we may be able to help you. You may still be eligible for the grant of your permanent visa. For more information, see Family Violence Provisions.\nTo get the permanent Partner visa (subclass 801), you must hold this subclass 820 visa or the Dependent child visa (subclass 445). If you are granted any other visa, you will no longer be eligible for the grant of the permanent Partner visa (subclass 801).\nYou are eligible for consideration of a permanent Partner visa two years after you first applied the combined temporary and permanent partner visas.\nWhen we assess you for the permanent visa, you will need provide additional documents.\nFor more information see Partner visa (subclass 801)."
}