{
    "visaID": "visa7.26",
    "visaType": "visa7",
    "visaName": "Skilled Independent visa (subclass 175)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/skilled-independent-subclass-175",
    "content": "Skilled — Independent (subclass 175)The Skilled-Independent visa (subclass 175) closed to new applications on 1 July 2012. This visa is subject to the Cap and cease arrangement that took place on 22 September 2015. Visa applications that were not decided by 22 September 2015 are taken not to have been made.\n1. About this visa\nThis visa uses a points test and allows you to migrate to Australia if you have competent English language and other skills and attributes which will contribute the most to the Australian economy.\nThe Skilled-Independent visa (subclass 175) closed to new applications on 1 July 2012. This visa is subject to the cap and cease arrangement that took place on 22 September 2015. Visa applications that were not decided by 22 September 2015 are taken not to have been made.\nThere is a visa finder function which outlines the requirements of all current skilled migration visas. This function will assist you to identify visa subclass(es) which suit your personal circumstances.\n2. Visa Holders\nThis information is for people who have been granted a Skilled-Independent visa (subclass 175). It explains your rights and obligations.\nYou can use Visa Entitlement Verification Online (VEVO) for free to check your visa details and entitlements\nThis is a permanent residence visa. It lets you and any member of your family unit who has also been granted this visa:\nYou and your family must comply with all visa conditions and Australian laws.\nYou must tell us if your circumstances change.  This includes a new residential address, a new passport, or a pregnancy, birth, divorce, separation, marriage, de facto relationship or death in your family.\nPlease report changes in your circumstances via ImmiAccount.  If you are not able to use ImmiAccount, you can use the following forms:\nIf you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane."
}