{
    "visaID": "visa1.4.6",
    "visaType": "visa1.4",
    "visaName": "Sponsored family stream",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/visitor-600/sponsored-family-stream",
    "content": "\n1. Visitor visa (subclass 600)\n2. Sponsored family stream\n3. For Applicants\n4. For Sponsors\nUp to 12 months\nAUD195.00. We might ask your sponsor to pay a security bond.\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYou should check if a Visitor (subclass 600) visa in the Tourist stream might better suit you. The Visitor visa (subclass 600) Tourist stream visa also lets you holiday in Australia to see family and friends and does not require a sponsor.\nSee all conditions\nIf you are getting help with your visa, before you pay someone, read information on Who can help with your visa application.\nApply\n5. With this visa you can\nYou can study or train for up to 3 months in total on this visa. If your main reason for travelling to Australia is study, a student visa might be more appropriate.\nYou can't work.\nYou should check if a Visitor (subclass 600) visa in the Tourist stream might better suit you. The Visitor visa (subclass 600) Tourist stream visa also lets you holiday in Australia to see family and friends and does not require a sponsor.\nYou will need a visa if you enter Australia during a cruise.\nIf your cruise is a round trip cruise, the time you spend on the cruise counts as time spent in Australia - that is, we do not consider you have left Australia. A round trip cruise will not reset your stay period on your visa.\nAsk your cruise operator or travel agent if we consider your cruise to be a round trip cruise.\n6. How long you can stay\nThis is a temporary visa. We might grant it for up to 12 months.\nWe determine the length of your visa on a case by case basis. Things we might consider when determining your stay period include:\nYou might not be granted the length of stay you want.\nGenerally we grant this visa with only one entry permitted. This means that after you leave Australia you need to apply for another visa before you can return.\n7. Stay longer\nYou can't stay in Australia longer by extending this visa. You must apply for another visa.\nYou can't apply for a new visa in Australia because your visa will have condition 8503, 'No Further Stay'. In limited circumstances, you might be able to request a waiver of the No Further Stay condition.\nYou must not breach condition 8531. That is, you must not remain in Australia beyond your visa period.\nYou can explore your visa options.\n8. Include family\nYou can't include family members in your application. A separate application must be made for each member of your family, including those listed on your passport.\nIf other family members are applying for this visa, your applications can be processed together. Learn more when you apply for the visa.\nFind out what to do if your child is born after you apply.\n9. Cost\nThe visa costs AUD195.00 for each applicant.\nYou might also have to pay other costs for health checks, police certificates and biometrics.\nUse the Visa Pricing Estimator to work out what your visa will cost. The estimator does not take into account the other costs.\n10. Apply from\nYou must be outside Australia when you apply and when we decide on your application.\n11. Processing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n12. Your obligations\nYou must meet all visa conditions and obey Australian laws.\n13. Health insurance\nWe recommend you obtain health insurance to cover any unforeseen medical treatment you might need in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability.\nSee what we consider adequate health insurance.\nLearn more about health insurance for overseas visitors.\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements.\n14. Travel\nIf we grant you a multiple-entry visa, you can travel outside Australia and return as many times as you want while the visa is valid.\nIf we grant you a single-entry visa and you leave Australia, you can't re-enter on the visa. You must apply for another visa to come back.\nCheck if you have multiple or single entry in Visa Entitlement Verification Online (VEVO) or your visa grant letter.\n15. Visa record\nWe will digitally link your visa to your passport. You will not get a label in your passport.​​\nYou and any family members who apply for the visa with you must meet our health requirement.\nYou must meet our character requirement.\nWe might expect other family members to meet the requirement.\nIf you or any family members (including those who don't apply for the visa with you) owe the Australian government money, you or they must have paid it back or arranged to pay it back.\nYou must have, or have access to, enough money to support yourself while you are in Australia.\nYou must only intend to:\nYou must have a sponsor.\nTo learn about who can sponsor you, see the Sponsor Eligibility tab.\nIf a family member wants to support you without becoming a sponsor, you can apply for a Visitor visa (subclass 600) Tourist stream. Provide a letter of invitation from your family member with your application.\nWe might not grant this visa if it is not in the best interests of an applicant under 18.\nYou can complete your health examinations before you apply or you can wait until we tell you to have them.\nFind out the examinations you need and how to arrange them if you want to have them before you apply.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nProvide accurate information.\nSee what happens if you can't prove your identity or don't provide true information.\nProvide the pages of your current passport showing your photo, personal details and passport issue and expiry dates.\nAlso provide:\nProvide as much proof as you can to show you are visiting Australia as a temporary visitor only. This could include:\nProof that you have reasons to return home such as:\nYour sponsor must complete Form 1149 - Application for sponsorship for Sponsored Family Visitors (329KB PDF). Provide a copy of the completed form with your application.\nProvide any military service record or discharge papers, if applicable.\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\nThey must complete either:\nAlternatively, you can show us:\nInclude:\nTo nominate someone to:\nUpload your written notification or your forms to ImmiAccount.\nHave all non-English documents translated into English.\nProvide original and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nNote: You don't need to have any documents certified.\nScan or photograph all documents (English and non-English) in colour.\nThe scans and photos must be clear and legible.\nIf a document is more than one page, save it all as one file.\nProvide accurate information.\nSee what happens if you can't prove your identity or don't provide true information.\nWe will let you know when we have received your application and documents.\nThere are other things you need to know and might need to do.\nWe will let you know if you need to provide biometrics.\nIf you didn't have health exams before you applied for the visa, have them if we tell you to.\nIf you did not send us all documents when you applied, send them via ImmiAccount as soon as you can.\nWe might also ask you to provide more information.\nLet us know as soon as you can if you made a mistake on your application.\nComplete Form 1023 Notification of incorrect answers (168KB PDF).\nLet us know if you no longer want someone to:\nUpload your written notification or your forms to ImmiAccount.\nFor more information see Who can help you with your application.\nTell us if things change after you lodge your application but before we have made a decision.\nThings you need to let us know about include:\nWe will let you know our decision on your visa application in writing. We will tell you:\nKeep a copy of our decision with you when in Australia.\nIf we refuse your visa we will let you know in writing. We will tell you why we refused and whether you have a right to a review of the decision.\nYou must have:\nEveryone who arrives in Australia must complete an Incoming Passenger Card.\nA SmartGate is an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use the  SmartGate.\nYou must meet all visa conditions and obey Australian laws. See your conditions in VEVO or your visa grant letter.\nLearn more about visa conditions and how they work.\nThings you need to let us know about include:\nSee how to let us know if there is a change in your situation.\nThis visa lets you:\nTo see your specific conditions, work and study entitlements use VEVO.\nVolunteer work tourism schemes\nYou can't work in Australia on a Visitor visa, but you might be able to do volunteer work.\nIf your visa is granted with multiple entries, you can travel outside Australia and return as many times as you want while the visa is valid.\nIf your visa is granted with single entry and you leave Australia, you can't re-enter on the visa. You have to apply for another visa to come back.\nSee when you must leave in VEVO.\nYou can't stay in Australia longer by extending this visa. You must apply for a new visa if you want to stay longer. See your options.\nTo prove you have a visa and show your conditions to someone, use VEVO.\nCheck your travel documents\nYou must have a valid passport or other travel document to leave Australia.\nDepartures SmartGate\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use the SmartGates.\nInternational Movement Record\nRequest your international movement records to get proof of your travel in and out of Australia."
}