{
    "visaID": "visa7.40",
    "visaType": "visa7",
    "visaName": "Training and Research visa (subclass 402)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/training-and-research-visa-subclass-402",
    "content": "Training and Research visa (subclass 402)The Training and Research visa (subclass 402) is closed to new applications from 19 November 2016.\nYou might be eligible to apply for Training visa (subclass 407) or Temporary Activity visa (subclass 408).\nYou might want to consider the Training visa (subclass 407) if you intend to:\nYou might want to consider the Temporary Activity visa (subclass 408) if you are:\n1. Visa holders\nThis information is for people who have already been granted a Training and Research visa (subclass 402). It explains your rights and ob​ligations.\nYou can use Visa Entitlement Verification Online (VEVO) for free to check your visa details and entitlements.\nThis visa is valid for the period of the position, usually up to a maximum of:\nOccupational Trainee and Research streams:\nIf you want to stay longer when you are in Australia, you must lodge a new application for this visa, including all relevant documents. You will also have to pay the visa application charge.\nIf your visa was granted in the Occupational Trainee stream, you might have to provide an explanation of why you were unable to complete the training within the initial training period.\nProfessional Development stream:\nYou cannot apply or reapply for this visa while you are in Australia.\nThis visa allows you to:\nIf you hold this visa under the Occupational Trainee or Research streams, you could also bring your family with you. Your family:\nFamily members in the Occupational Trainee stream can only work for up to 40 hours a fortnight.\nFamily members in the Research stream might have unrestricted work rights.\nYou and your family must comply with all visa conditions and Australian laws.\nDuring your stay in Australia, you must:\nYou must:\nIf you decide to train with another organisation while in Australia, you will need to be sponsored by that organisation, which must lodge a nomination. When the new nomination is approved you will be able to do workplace-based occupational training for that organisation for the period left on your visa without having to apply for a new visa.\nIf your sponsor ceases your employment training you must notify the department and find another employer who is willing to sponsor you.\nYour family members cannot work for more than 40 hours a fortnight.\nYou must:\nIf your sponsor ceases your employment or training, you must notify the department and find another employer who is willing to sponsor you.\nYou must:\nYou must tell us if your circumstances change.  This includes a new residential address, a new passport, or a pregnancy, birth, divorce, separation, marriage, de facto relationship or death in your family.\nPlease report changes in your circumstances via ImmiAccount.  If you are not able to use ImmiAccount, you can use the following forms:\nIf you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.\n2. Sponsors\nThis information is for approved sponsors of people on a Training and Research visa (subclass 402).\nYou can use  Visa Entitlement Verification Online (VEVO for Organisations) to check the visa status and entitlements of people you have sponsored.\nYou cannot apply to sponsor applicants for this visa because it is no longer open to new applications. As an approved sponsor, you can no longer nominate someone for this visa.\nIf you were approved as a training and research sponsor before 19 November 2016 you can use this approval to sponsor a Training visa (subclass 407) or Temporary Activity visa (subclass 408) applicant (who is engaging in the relevant activity) during the transitional period, that is until 18 May 2017, or until your sponsorship approval ceases (whatever is earlier).\nFrom 19 May 2017 you must apply online for approval as a temporary activities sponsor if you want to sponsor a Training visa (subclass 407) or Temporary Activity visa (subclass 408) applicant after this date.\nIf you applied for approval as a training and research or professional development sponsor before 19 November 2016 your application will continue to be assessed under the pre-19 November 2016 legislation. If approved, the sponsorship would only be valid to sponsor new Training visa (subclass 407) or Temporary Activity visa (subclass 408) applications until 18 May 2017.\nYou must comply with the following sponsorship obligations:\nDepending on the stream in which you made a nomination, you could also be required to comply with the following sponsorship obligations:\nYou are responsible for meeting all your obligations, even if you have authorised someone else to act on your behalf, including a migration agent.\nYou must cooperate with inspectors appointed under the Migration Act 1958 (the Act) who are investigating whether:\nThis obligation:\nCooperating with inspectors can include (but is not limited to):\nYou must keep records to show how you have complied with your obligation to tell the department when certain events occur. All records must be reproducible and some must be capable of verification by an independent person.\nYou must keep a record of:\nThis obligation:\nYou do not need to keep any records for more than five years.\nYou must provide records or information, if they are requested by a departmental officer that goes to determining whether:\nWe could ask you in writing to provide records or information which relate to your sponsorship obligations, and any other matters that relate to your sponsorship of visa holders. You must provide the records or information requested if it is a record or information that:\nThis obligation starts to apply on the day the sponsorship is approved.\nThis obligation ends two years after:\nYou must tell us in writing when certain events occur. Send the information by registered post or electronic mail to a specified address and within certain timeframes of the event occurring.\nEvents where a sponsor must provide information to us include:\nThis obligation starts to apply on the day the sponsorship is approved.\nThis obligation ends two years after:\nResearch stream\nIf you are sponsoring someone under the Research stream, you must also notify the department:\nProfessional Development stream\nIf you are sponsoring someone under the Professional Development stream, you must also notify the department if:\nWhere to send a notice of an event or change\nYou must send details of these events by email or to one of our state or territory offices listed below.\nBy email (preferred): sponsor.notifications@homeaffairs.gov.au\nBy registered post:\nYou must not take any action or seek to take any action that would result in the transfer or charging of costs (including migration agent costs) to another person, such as a sponsored visa holder or their sponsored family members. This includes costs that relate to:\nThis obligation:\nSponsors are also required to pay certain costs associated with becoming a sponsor and not pass these costs, in any form, onto another person. These include:\nIn the event a primary sponsored person (or any of their sponsored family members) becomes an unlawful non-citizen, you could be required to pay the costs incurred by the Commonwealth in locating and/or removing the primary or secondary sponsored persons from Australia.\nYou could be liable to pay the Commonwealth the difference between the actual costs incurred by the Commonwealth (up to a maximum of AUD10 000) less any amount which could have already been paid under the obligation to pay travel costs to enable sponsored persons to leave Australia (see ‘Obligation to pay travel costs’ above).\nThis obligation starts on the day the person you sponsored becomes an unlawful non-citizen. It ends five years after they leave Australia.  This means that the department might, up to five years after the person you have sponsored has left Australia, give you a letter requiring payment of the costs that the Commonwealth paid to locate and remove the person you sponsored prior to their departure from Australia.\nYou must meet this obligation only if you sponsor someone:\nIf you sponsor someone under these streams, you must secure an offer of a reasonable standard of accommodation in Australia for them and any family they bring with them.\nIf the accommodation becomes unavailable, you must find alternative accommodation for them.\nA ‘reasonable standard of accommodation’ means you must:\nThis obligation starts on the day:\nThis obligation ends on the day (whichever is earliest):\nThis obligation applies to you only if you have sponsored someone under the Occupational Trainee stream.\nYou must ensure that the person you have sponsored for this visa participates only in the position or activity for which you nominated them. If you want them to do workplace-based training in a different position, you must nominate them for that position and lodge a new nomination application.\nThis obligation starts on the day the person you have sponsored for the position is granted a visa. If they already hold a visa, your obligation starts on the day the nomination is approved.\nThis obligation ends on the day (whichever is earliest):\nThis obligation applies to you only if you have sponsored someone under the Professional Development stream.\nYou must pay reasonable and necessary travel costs to enable the person you have sponsored to leave Australia. The person must ask in writing. The department can also ask on their behalf.\nThe costs will be considered reasonable and necessary if they include all of the following:\nTravel costs must be paid within 30 days of receiving the request.\nThis obligation starts:\nThis obligation ends on the day (whichever is the earliest):"
}