{
    "visaID": "visa3.20",
    "visaType": "visa3",
    "visaName": "Prospective Marriage visa (subclass 300)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/prospective-marriage-300",
    "content": "\n1. Subclass 300\n2. Prospective Marriage visa\n3. For Applicants\n4. For Sponsors\n9 to 15 months from date of grant of visa.\nFrom AUD9,095.00\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nThe Department continues to prioritise aged, and compassionate and compelling applications. This is reflected in current processing times.\nSee all conditions\nIf you are getting help with your visa, make sure you read information on Who can help with your visa application.\nApply\n5. With this visa you can\n6. Settle in Australia\nIf you and your spouse want to settle in Australia, apply for a Partner visa (subclass 820 and 801):\n7. How long you can stay\nThis is a temporary visa. You can stay in Australia for the period specified on the visa grant letter. This is 9 to 15 months from the visa grant date.\n8. Include family members\nYou can include members of the family unit in your application.\nFamily members who apply with you must:\nFamily members who are not coming to Australia might also have to meet our health and character requirement.\nFor information on what to do if your child is born after you apply, see You had a baby.\n9. Cost\nThe visa costs AUD9,095.00 for the main applicant.\nThere is also a fee for each family member who applies for the visa with you. We cannot process your application if you do not pay the correct visa application charge. You might also have to pay other costs for health checks, police certificates and biometrics.\nTo work out how much your visa will cost, including adding additional family members, use the Visa pricing estimator. The estimator does not take into account the costs for health checks, police certificates or biometrics.\nYou will also have to pay a fee for your Partner visa (subclasses 820 and 801). You pay less for this visa if you marry your prospective spouse and apply for the Partner visa before your Prospective Marriage visa ends.\n10. Apply for this visa\nYou must be outside of Australia when you apply for this visa. Family who apply with you must also be outside Australia.\n11. Your obligations\nYou and your family members must meet all visa conditions and obey Australian laws.\nSee what conditions might be attached to this visa on our visa conditions page.\nIf you are outside Australia at the time of visa grant you must enter Australia before the first entry arrival date (initial arrival date) specified in your grant letter.\nYou must enter Australia on the Prospective Marriage visa before the date specified on your grant letter.\nYou must have married your prospective spouse before your Prospective Marriage visa expires.\nYou can get married in any country but your marriage must be valid under Australian law.\n12. Adequate health insurance\nWe recommend you take out health insurance to cover any unforeseen medical treatment you might need while in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability.\nSee what we consider adequate health insurance.\nLearn more about health insurance for overseas visitors.\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal health care agreements.\n13. Travel\nYou can travel to and from Australia as many times as you want while you hold this visa.\nIf you are outside Australia at the time of visa grant you must enter Australia before the first entry arrival date (initial arrival date) specified in your grant letter.\n14. Visa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n15. Frequently Asked Questions\nYou can find the answers to common questions about this visa at Partner Program Frequently Asked Questions (FAQs).\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused, see Can I go to Australia.\nIf you want immigration assistance, see Who can help with your visa application.\nYou must be outside Australia when you apply for this visa. Family who apply with you must also be outside Australia.\nYou and anyone who applies for the visa with you must have a sponsor when you lodge your application and while you are on this visa.\nYour sponsor is your prospective spouse.\nWe must approve your sponsor.\nYou and your sponsor must be 18 years old or older when you apply for this visa.\nIn most cases, your prospective spouse must be an:\nYour relationship can be with someone of the same or different sex.\nYou and any family members who apply for the visa with you must meet our health requirement. We might ask for health information about family not coming to Australia with you.\nYou and any family members aged 16 years and over who apply for the visa with you must meet our character requirements. We might ask for character information about family not coming to Australia with you.\nIf you or any family members owe the Australian government money, it must have been paid back or arranged to be paid back. This may include family members who do not accompany you to Australia.\nYou and any family members who apply with you who are 18 years of age or older must:\nWe might not grant this visa if it is not in the best interests of an applicant under 18.\nThere are things you need to know and might need to do before you apply.\nYou can appoint anyone to receive correspondence relating to your visa application.\nTo appoint someone to receive your correspondence, use Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF).\nIf you need help with your application, you can appoint someone to give you immigration assistance. A person who gives you immigration assistance can:\nWe treat any correspondence they send as if it came from you.\nIf you appoint someone to give you immigration assistance they must be:\nTo appoint someone to provide immigration assistance, use Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (225KB PDF) .\nFor more information, see who can help you with your application.\nYou should provide all required information with your application, or as soon as possible after lodging your application. Applications with all required information reduce processing delays.\nYou have the option to obtain your police certificates before you apply. However for immigration purposes, police certificates are valid for 12 months from the issue date.\nIf more than 15 months has passed since your National Police certificate (NPC) was issued by the Australian Federal Police (AFP), new checks will be required to progress your application.\nEnsure that all information you provide is accurate. As a visa applicant, you must prove your identity and provide true information with your application. For more information, see Providing accurate information.\nProvide a birth certificate showing the names of both parents.\nIf you cannot provide this, provide one of the following:\nAlso provide:\nYou need to attach to your application, evidence of:\nYou must provide statements from 2 witnesses who:\nStatements from witnesses can be done by completing Form 888 – Supporting statement in relation to a Partner or Prospective Marriage visa application (170KB PDF).\nIf the witness is an Australian citizen or permanent resident, provide evidence of this, such as a passport or birth certificate.\nAlso provide other evidence of your relationship such as:\nIf you have previously been married, widowed, divorced or permanently separated, provide divorce documents, death certificates, separation documents or statutory declarations.\nFor each of the members of the family unit under 18 years old who is applying with you, provide:\nParental responsibility documents\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\nThey must complete one of the following:\nInclude:\nAlternatively, you can show us one of the following:\nTo include members of the family unit who are over 18 in your visa application, they must be:\nProvide:\nYou must also provide evidence the child is dependent on you. This includes the following:\nIf the child is aged 23 or is likely to turn 23 while your application is being processed, you must also provide a report from a qualified medical practitioner. This report should state that they are dependent on you or your partner due to the total or partial loss of their bodily or mental functions.\nTranslate\nHave all documents translated into English.\nProvide original and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nScan or photograph\nScan or photograph all documents (English and non-English) in colour.\nThe scans and photos must be clear enough to read.\nIf a document is more than one page, save it all as one file.\nYou do not need to have any documents certified.\nYou must apply:\nWe cannot process your application if you do not pay the correct visa application charge.\nTo find information for how to apply as a sponsor, click on the “Personalise this page..” toggle above to view this information.\nThe partner visa application form will ask you for your own phone number and email address. It is important to provide your own contact details in case we need to contact you directly about your application.\nClearly label your documents and only attach a document once, even if you are using it to show more than one thing.\nKeep a copy of your completed application.\nYou can attach up to 100 documents for each person on your application.\nThe attachment limit cannot be increased.\nIf you reach the attachment limit for an applicant, you can attach more documents to other clients on the application.\nFor more information, see Applying online in ImmiAccount.\nYou can find the answers to common questions about this visa at Partner Program Frequently Asked Questions (FAQs).\nWe will let you know when we have received your application.\nYou need to have health examinations.\nTo organise your health examinations, see What health examinations you need.\nThe results of your health assessment are valid for 12 months from the time you completed your examinations. If we ask you to sign a health undertaking, this will be valid for 6 months.\nFor more information on health requirements and examinations, see Health\nTo show that you meet our character requirements you need to provide:\nFor immigration purposes, police certificates are valid for 12 months from the issue date.\nTo get a police certificate, see Offices outside Australia.\nComplete and attach to your application Form 80 Personal particulars for assessment including character assessment (596KB PDF).\nAustralian police certificate\nProvide an Australian police certificate if you have spent a total of 12 months or more in Australia in the last 10 years since you turned 16.\nWe only accept complete disclosure National Police Certificates issued by the Australian Federal Police. We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police.\nTo get an Australian police certificate see National Police Checks.\nTo help ensure your application is processed as quickly as possible, attach all necessary supporting documents to your application. The checklist provided on ImmiAccount will help make sure you include all required documents in your application.\nIf your application is within standard processing times, do not contact us. We cannot provide any further updates on your application's progress. You can see if we have asked for more information in ImmiAccount.\nTo see standard processing times for this visa see Global processing times.\nYou can find the answers to common questions about this visa at Partner Program Frequently Asked Questions (FAQs).\nDo not arrange to travel to Australia until we let you know, in writing, that we have granted you the subclass 300 visa.\nWe will tell you if you need to provide biometrics.\nIf you did not attach all documents when you applied, attach them in ImmiAccount as soon as you can.\nWe might ask you to provide more information.\nFor more information on attaching documents in ImmiAccount see Applying online or paper.\nIf you are unable to upload the relevant documents to you application in ImmiAccount, you need to contact us using the Partner Processing Enquiry Form.\nYou can add a dependent child to your application before we decide on your visa. Your child must be outside Australia.\nComplete and attach to your application in ImmiAccount Form 1436 - Adding an additional applicant after lodgement (481KB PDF).\nAfter you have attached the form, let us know by using the Partner Processing Enquiry Form.\nWe can grant your child the subclass 300 visa if they are members of the family unit, and meet all other criteria for grant.\nIf you have a baby, you will need to let us know. For more information, see You had a baby.\nAfter you have updated ImmiAccount, let us know by using the Partner Processing Enquiry Form.\nTell us if things change after you apply but before we have made a decision.\nThings you need to let us know about include:\nFor more information, see Change in your situation.\nIf you are unable to upload the relevant documents to your application in ImmiAccount, you need to contact us using the Partner Processing Enquiry Form.\nComplete the Notification of Relationship Cessation form in the ‘Update Details’ tab in ImmiAccount.\nIf you are having trouble completing the ImmiAccount form, complete the Partner Processing Enquiry Form.\nIf you get married before we decide on your visa application, you are no longer eligible for this visa. To tell us about this change:\nYou will also need to attach the following to your application:\nAfter you have updated ImmiAccount, let us know by using the Partner Processing Enquiry Form.\nIf you do not withdraw your application, it will be refused as you no longer meet the eligibility requirements for the visa.\nIf you travel to Australia on a visa while your Prospective Marriage visa is in progress, you are responsible for ensuring that you continue to hold a valid visa for the duration of your stay.\nLet us know if you no longer want someone to:\nAfter you have attached the form to ImmiAccount, let us know by using the Partner Processing Enquiry Form.\nFor more information see Who can help you with your application.\nLet us know as soon as you can if you have made a mistake on your application. For more information, see After you apply.\nIf you are unable to update your application in ImmiAccount, you need to contact us using the Partner Processing Enquiry Form.\nYou can be in or outside Australia when we decide your visa application.\nWe will tell you our decision in writing. Keep a copy of the decision.\nIf we grant your visa, we will tell you:\nIf we refuse your visa, we will tell you:\nWe will not refund the application fee if we refuse your application.\nThis visa lets you:\nYou can stay in Australia for 9 to 15 months from date of visa grant. To see when your visa expires, refer to your grant letter or use VEVO.\nYou and your family members must meet all visa conditions and obey Australian laws.\nCheck your visa details and conditions using VEVO.\nIf you are outside Australia at the time of visa grant, you must enter Australia before the first entry arrival date (initial arrival date) specified in your grant letter.\nIf you and your spouse intend to settle in Australia, you should apply for a Partner visa (subclass 820 and 801) after your marriage and before your Prospective Marriage visa expires. You will pay less for the Partner visa if you apply for it before your Prospective Marriage visa ends.\nYou can travel to and from Australia as many times as you want whilst your visa is valid.\nIf you are outside Australia at the time of visa grant, you must enter Australia before the first entry arrival date (initial arrival date) specified in your grant letter.\nIf an immigration officer processes your clearance at our border, we recommend you tell them:\nIf you do not tell them, you might be granted a 444 visa. Grant of a subclass 444 visa will override your Prospective Marriage visa.\nAs a subclass 300 visa holder, you are eligible to pay a lower visa application charge for the Partner visa (subclasses 820 and 801) application.\nIf you are granted any other visa, the new visa will replace your subclass 300 visa. This means you may need to pay a higher visa application charge when you apply for the Partner visa (subclasses 820 and 801).\nTo prove you have a visa and show your conditions to someone, use VEVO.\nAustralian visas are digital. We do not put a visa label in your passport. Instead, we link your digital visa record to your passport.\nYour visa number is contained in your visa grant letter. Use this number to access your digital visa record in VEVO.\nYour digital visa record is also used by:\nWith this visa you will have full work rights and are protected by Australian workplace law. See your workplace rights and entitlements.\nWith this visa you will be able to study in Australia. However you will not receive any government support and any study costs will be at your own expense.\nYou cannot add family members to your visa application after we grant your Prospective Marriage visa subclass 300.\nTo find a visa for a family member, explore visa options.\nIf you have a baby after you have been granted this visa, you need to let us know. For more information, see You had a baby.\nDepending on your situation you may need to complete the Notification of Relationship Cessation form in ImmiAccount. To confirm, check Your relationship has changed.\nIf you do not have access to ImmiAccount, you can notify us using the Partner Processing Enquiry Form.\nYou may still be eligible for the Partner visa (subclasses 820 and 801) if your relationship ends or your partner dies. All information you provide is confidential.\nYou must be in Australia to apply for the Partner visa (subclasses 820 and 801).\nIf you are experiencing domestic and family violence, we may be able to help you. You may still be eligible for the grant of your temporary and permanent visa. For more information, see Domestic and family violence and your visa.\nYou must tell us about:\nSee what to do if there is a change in your situation.\nIf you do not have access to ImmiAcount you can let us know by completing the Partner Processing Enquiry Form."
}