{
    "visaID": "visa1.4.1",
    "visaType": "visa1.4",
    "visaName": "Tourist stream (apply outside Australia)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/visitor-600/tourist-stream-overseas",
    "content": "\n1. Visitor visa (subclass 600)\n2. Tourist stream (apply outside Australia)\nUp to 12 months\nFrom AUD195.00\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nSee all conditions\nIf you are getting help with your visa, before you pay someone, read information on Who can help with your visa application.\nApply\n3. With this visa you can\nYou can study or train for up to 3 months on this visa. But if your main reason for travelling to Australia is study, a student visa might be more appropriate.\nYou can't work.\nYou will need a visa if you enter Australia during a cruise.\nIf your cruise is a round trip cruise, the time you spend on the cruise counts as time spent in Australia. We do not consider you to have left Australia. A round trip cruise will not reset your stay period on your visa.\nAsk your cruise operator or travel agent if we consider your cruise to be a round trip cruise.\n4. How long you can stay\nThis is a temporary visa.\nYou can stay for the period or dates specified on the visa grant letter. We determine the length of your visa on a case by case basis. Things we might consider when determining your stay period include:\nWe might not grant the length of stay you want.\nWe can grant this visa with a single entry or multiple entry.\nIf we grant you a visa with multiple entry, you can leave and return to Australia on the visa while it is valid.\nGenerally, we grant a stay period of 3 months. We might grant a stay of up to 12 months in certain circumstances.\nConsider the Visitor visa (subclass 600) Frequent Traveller stream if:\nIf you are the parent or step-parent of an Australian citizen or permanent resident, and you meet all the visa criteria, we may grant you a visa that is valid for more than 12 months.\nWe consider these applications on a case-by-case basis.\nIf we grant you a visa that is valid for more than 12 months you might be able to enter Australia multiple times while the visa is valid. You can’t stay in Australia for more than 12 months in total in any 18 month period. You must also have made adequate arrangements for health insurance.\nIf you want to stay longer than 12 months on each visit you might be eligible for a Sponsored Parent (Temporary) visa.\n5. Stay longer\nYou can't stay in Australia longer by extending this visa. You must apply for another visa in Australia.\nYou can apply for a new visa if your current visa does not have a condition that prevents further stay, such as condition 8503 - No Further Stay. We can waive a no further stay condition in limited circumstances.\nIf you want to stay longer or permanently in Australia you will need to apply for a visa that allows this.\nExplore your visa options.\n6. Include family\nYou can't include family members in your application.\nEach family member, including those listed on your passport, must submit a separate application.\n7. Cost\nThis visa costs from AUD195.00 for each applicant.\nYou might also have to pay other costs for:\nTo work out what your visa will cost use the Visa Pricing Estimator. The estimator does not take into account the other costs.\n8. Apply outside Australia\nTo be eligible for this visa, you must be outside Australia when you apply and when we decide your application.\nSee other eligibility requirements.\n9. Processing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n10. Your obligations\nYou must comply with all visa conditions and Australian laws.\nLearn more about visa conditions.\n11. Health insurance\nYou are liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability. To cover any unexpected medical treatment you might need in Australia, we strongly recommended you take out adequate health insurance.\nLearn more about health insurance for overseas visitors.\nSome countries have a reciprocal healthcare agreement with Australia.\nIn some circumstances, we might grant your visa with Condition 8501 – Maintain adequate health insurance.\n12. Travel\nCheck if you have multiple entry, or single entry, in VEVO or your visa grant letter.\nIf you have multiple entry, you can travel outside Australia and return while your visa is valid.\nIf you have single entry and you leave Australia, you have to apply for another visa to return.\n13. Visa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.​​\nYou must meet our health requirement.\nYou must meet our character requirement.\nIf you owe the Australian government money, you must have paid it back, or have arranged to pay it back.\nYou must have, or have access to, enough money to support yourself while you are in Australia.\nYou must only intend to:\nWe might not grant this visa if it is not in the best interests of an applicant under 18.\nYou need a valid passport or other travel document for this visa. If you plan to get a new passport, do this before you apply.\nYou can complete your health examinations before you apply or you can wait until we tell you to have them.\nFind out the examinations you might need and how to arrange them.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nInclude as much information as possible to support your application. This includes English translations of your documents.\nWe may decide your application without requesting further information from you.\nFollow these instructions to ensure you submit a complete visa application\nProvide accurate information.\nSee what happens if you can't prove your identity or don't provide true information.\nProvide the pages of your current passport showing your photo, personal details and passport issue and expiry dates.\nAlso provide:\nProvide as much proof as you can to show you are visiting Australia as a temporary visitor only. This could include:\nProvide any military service record or discharge papers, if applicable.\nWe may ask you to provide a police certificate.\nTo nominate someone to:\nUpload your written notification or your forms to ImmiAccount.\nIf you are requesting a longer visa, tell us in your application. This includes parents and step-parents of Australian citizens or permanent residents.\nProvide us with further information about the reason for your request.\nFor example, proof that your child is an Australian citizen or permanent resident.\nIf you are under the age of 18, you should provide a copy of your birth certificate showing the names of both parents. If you can’t provide a birth certificate, provide one of the following:\nIf somebody other than your biological parents has legal guardianship over you (for example, adoptive parents or a court-appointed guardian), you must provide proof of their legal guardianship.\nProvide adoption papers or parental court orders, if applicable.\nAnyone with a legal right to decide where you live, and who is not travelling in Australia with you, must complete either:\nInclude a document with the signature and photo of the person who completed, or declaration, such as a:\nIn addition to consent information, if you’re not staying with a relative or legal guardian, provide Form 1257 - Undertaking declaration (211KB PDF). The person you're staying with must sign the form.\nHave all non-English documents translated into English.\nProvide original and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nYou do not need to have any documents certified unless we ask you to.\nScan or photograph all documents (English and non-English) in colour.\nThe scans and photos must be clear and legible.\nIf a document is more than one page, save it all as one file.\nProvide accurate information.\nSee what happens if you can't prove your identity or don't provide true information.\nWe will let you know when we have received your application and documents.\nThere are other things you need to know and might need to do.\nIf you applied from outside Australia you must be outside Australia when we decide your visa. Do not arrange to travel to Australia until we let you know, in writing, that we have granted you the visa.\nWe will let you know if you need to provide biometrics.\nIf you didn't have health examinations before you applied for the visa, have them if we tell you to.\nIf you did not attach all documents when you applied, or if we ask you for more documents, attach them as soon as you can in ImmiAccount .\nWe may decide your application without requesting further information from you.\nLet us know as soon as you can if you made a mistake on your application.\nFind out what to do if you made a mistake on your online application.\nLet us know if you no longer want someone to:\nUpload your written notification or your forms to ImmiAccount.\nFor more information see Who can help you with your application.\nTell us if things change after you submit your application but before we have made a decision.\nThings you need to let us know about include:\nWe will let you know our decision on your visa application in writing. We will tell you:\nKeep a copy of our decision with you when in Australia.\nIf we refuse your visa we will let you know in writing. We will tell you why we refused your visa and whether you have a right to a review of the decision.\nCheck your travel documents\nYou must have:\nComplete an Incoming Passenger Card\nEveryone who arrives in Australia must complete an Incoming Passenger Card.\nUsing the SmartGate\nA SmartGate is an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nYou must meet all visa conditions and obey Australian laws. See your conditions in VEVO or your visa grant letter.\nLearn more about visa conditions and how they work.\nThings you need to let us know about include:\nSee how to let us know if there is a change in your situation.\nThis visa lets you:\nVolunteer work tourism schemes\nYou can't work in Australia on a Visitor visa, but you might be able to do volunteer work.\nTravel on your visa\nWe grant the visa with either:\nSee how long you can stay\nSee when you must leave in VEVO.\nStay longer\nYou can't stay in Australia longer by extending this visa. You must apply for a new visa if you want to stay longer. See your options.\nProve you have a visa\nTo prove you have a visa and show your conditions to someone, use VEVO.\nCheck your travel documents\nYou must have a valid passport or other travel document to leave Australia.\nDepartures SmartGate\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nInternational Movement Record \nTo prove you have been to Australia, request your international movement records by completing a Request for international movement records form."
}