{
    "visaID": "visa4.9.2",
    "visaType": "visa4.9",
    "visaName": "Temporary Residence Transition stream",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/regional-sponsor-migration-scheme-187/temporary-residence-transistion-stream",
    "content": "\n1. Regional Sponsored Migration Scheme visa (subclass 187)\n2. Temporary Residence Transition stream\n3. For Applicants\n4. For Sponsors\nPermanently\nFrom AUD4,770.00\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nSee all conditions\nIf you are getting help with your visa, before you pay someone, read information on Who can help with your visa application.\n5. With this visa, you can\nNewly arrived residents may have to wait before they can access certain Australian Government payments and benefits.\nFrom the date we grant this visa, you can travel to and from Australia for up to 5 years.\nAfter that period, you will need a Resident Return (RRV) visa to re-enter Australia as a permanent resident.\nIf you leave Australia after the expiry date of your travel facility, without being granted another permanent visa with a valid travel facility, for example a Resident Return (RRV), you might not be able to return to Australia as a permanent resident.\nTo see when your travel facility ends, use VEVO.\n6. How long you can stay\nThis is a permanent visa – it lets you stay in Australia indefinitely.\nYou become a permanent resident on the day we grant the visa.\nYour permanent residency for citizenship purposes starts:\n7. Include family\nYou can:\nFor this visa, your family members are:\nYou can also include someone who holds a subclass 457 visa or subclass 482 visa if we granted them that visa on the basis they are a member of your family.\nFamily members who apply for the visa with you must meet our health and character requirements.\nFamily members who do not apply for the visa with you might also have to meet the requirements.\n8. Cost\nThe visa costs AUD4,770.00 for the main applicant.\nThere is also a charge for each family member who applies for the visa with you.\nYou will need to pay an extra charge called a second instalment for any family member aged 18 years or older who:\nThe second instalment for family members who apply for the visa with you is AUD4,890.00.\nTo be eligible for this visa as the main applicant, you must be able to show us you have Competent English unless you are exempt. If you are exempt from showing us you have Competent English, you must still show us you have Functional English. If you can't show us you have Functional English you must also pay a second instalment of AUD9,800.00 when we ask you to.\nIf you need to pay the second instalment, we will send you an invoice after you have met all other requirements for the visa.\nYou might also have to pay other costs for health checks, police certificates and biometrics.\nTo work out what your visa will cost use the Visa pricing estimator. The estimator does not take into account the second instalment or other costs.\n9. Apply from\nApply for this visa from in or outside Australia. If you are in Australia, you must hold a substantive visa or a bridging visa A, B or C.\nYou can be in or outside Australia when we decide on your application.\n10. Processing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application can take longer to process if:\nWe can`t process your application if you don't pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\n11. Your obligations\nYou and your family members must obey all Australian laws.\nWe expect that you will work for your nominating employer in regional Australia for at least 2 years. If you don't, we might cancel your visa.\nYou agree to begin your employment within 6 months of:\n12. Visa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nYou must have the required skills and qualifications needed to perform the tasks of the nominated occupation.\nWe might ask you to get a skills assessment to show you have these skills.\nYou must be licensed, registered or a member of a professional body if it is mandatory in the state or territory you intend to work in.\nYour employer must have sponsored you to work full-time on your subclass 457 or subclass 482 visa for at least 2 of the 3 years prior to nominating you for the subclass 187 visa.\nUsually, you must be under 45 years of age when you apply.\nYou are exempt from this criteria if any of the following applies to you:\nIf you held (or had applied for and were later granted) a subclass 457 visa on 18 April 2017, you can still apply for this visa if you are under 50 when you apply.\nYou must currently be the primary visa holder of either:\nThe bridging visa must be the one you were granted after your subclass 457 or TSS visa expired.\nLegislation defines “transitional 482 worker” as a person who on 20 March 2019 either held a TSS visa (subclass 482) in the Medium-term stream, or was an applicant for a TSS visa in the Medium-term stream that was subsequently granted.\nThe 20 March 2019 cut-off date for “transitional 482 workers” relates to the date the Australian Government made announcements regarding the closure of the Regional Sponsored Migration Scheme (RSMS) Direct Entry visa (subclass 187). At the same time, the announcement was made relating to the introduction of the Skilled Employer Sponsored Regional (Provisional) visa (subclass 494)\nYou and any family members who apply for the visa with you must meet our health requirement.\nOther family members will also need to meet the requirement.\nYou and family members aged 16 years and over who apply for the visa with you must meet our character requirement.\nOther family members will also need to meet the requirement.\nIf you are 18 years of age or older, you must:\nYou must have at least Competent English.\nYou are exempt from this requirement if you have completed at least 5 years of full-time study in a secondary or higher education institution where all tuition was delivered in English.\nIf you owe the Australian Government money, you must have paid it back or have a formal arrangement to pay it back.\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused see Limitations on applications in Australia.\nIf applying for a visa from outside Australia see Can I go to Australia.\nIf you want immigration assistance, see Who can help with your visa application.\nYou need to have health examinations. You can complete them before you apply or you can wait until after you apply.\nFind out the examinations you need and how to arrange them if you want to have them before you apply.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nMake sure your employer has submitted a nomination application. They will receive a nomination Transaction Reference Number (TRN) when they do.\nAsk your employer for the TRN. You need it to apply for the visa.\nCriminal and civil penalties can be applied to anyone who asks for, receives, offers or provides a benefit in exchange for visa sponsorship. Learn more about work visa scams.\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nProvide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\nAlso provide:\nDocuments that prove a change of name include:\nProvide evidence of any licence, registration or professional membership mandatory to perform the nominated occupation in the state or territory you intend to work in, if applicable.\nWe will ask you to undertake a skills assessment if you are required to do so.\nIf you are 45 years old or older, provide documents to show you are exempt from the age eligibility criteria.\nProvide documents that show you have Competent English at the time you submit your application.\nYou are exempt from having to show us you have Competent English if you can instead show us you have completed at least 5 years of full-time study in a secondary or higher education instituation where all tuition was delivered in English. If this is the case you must still show us you have Functional English or pay the second instalment.\nYou do not need to provide health documents. If you have had medical exams, the results are sent to us by your doctor.\nProvide an Australian police certificate. We only accept complete disclosure National Police Certificates issued by the Australian Federal Police . We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police. For immigration purposes, Australian police certificates are valid for 12 months from the date of issue.\nAlso provide:\nFurther information is available at: Character requirements for visas\nTo nominate someone to:\nUpload your written notification or your forms to ImmiAccount.\nProvide:\nProvide either:\nDocuments that prove a de facto relationship include:\nYou must show that your partner has Functional English.\nIf you can't show that your partner has Functional English, you will need to pay the second instalment when we ask you to.\nFor every dependant under 18 years old who is applying with you, provide:\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\nThey must complete either:\nInclude a document with the signature and photo of the person who completed the form or declaration, such as a:\nAlternatively, you can show us:\nInclude:\nFor every dependant 18 years old or older who is applying with you, provide:\nYou need to prove that this person is a family member and/or dependent on you. Provide:\nYou must also prove this person has been financially dependent on you for at least 12 months before you apply. You could provide:\nFor other family members, if applicable, provide evidence the person:\nYou must show us your family member has Functional English.\nIf you can't show your family member has Functional English, you will need to pay the second instalment when we ask you to.\nHave all non-English documents translated into English.\nProvide original and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters .\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nNote: You do not need to have any documents certified.\nScan or photograph all documents (English and non-English) in colour.\nThe scans and photos must be clear.\nIf a document is more than one page, save it all as one file.\nAttach a document only once, even if you are using it to show more than one thing.\nLearn more about attaching documents.\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nSee what you can and must do after you apply.\nWe will let you know when we have received your application.\nThere are other things you need to know and might need to do.\nWe can’t give updates on applications within the standard processing time.\nYou can check if we need more information from you in ImmiAccount.\nIf you are in Australia, you don't have to tell us if you want to travel outside Australia while we process your application. This is because you can be outside Australia when we decide on your application.\nBut if you leave Australia, make sure you have a valid visa to return.\nLearn about visa expiry.\nLearn about Bridging visas.\nIf you didn't have health examinations before you applied, we will let you know if you need them. Check ImmiAccount.\nWe might ask for Biometrics (fingerprints and photo). We will let you know if you need to provide them.\nIf you didn't attach all documents when you applied, attach them as soon as possible in ImmiAccount.\nWe might also ask you to provide more information.\nMake sure you stay lawful by holding a valid visa while we process your application.\nWhen you apply for this visa in Australia, you are likely to be granted a bridging visa. If your current visa expires before we decide your application, the bridging visa will start. You can stay in Australia on the bridging visa while we process your new visa application.\nLearn more about visa expiry.\nIf you need to pay a second instalment we will send you an invoice after you have met all other requirements for the visa.\nYou can add family to your application after you apply but before we decide on your visa.\nFor the purposes of adding family to your application after you apply, your family members are:\nFind out what to do if your child is born after you apply.\nLet us know as soon as you can if you made a mistake on your application.\nComplete Form 1023 Notification of incorrect answers .\nLet us know if you no longer want someone to:\nUpload your written notification or your forms to ImmiAccount.\nFor more information see Who can help you with your application.\nThings you need to let us know about after you submit you application include:\nSee what to do if your situation changes\nWe might ask you to get a skills assessment.\nYou can be in or outside Australia when we decide on your application.\nWe must have approved your employer’s nomination before we can grant you this visa.\nWe will let you know our decision about your visa application in writing.\nIf we grant your visa, we will tell you:\nKeep a copy of the decision.\nIf we refuse your visa, we will tell you:\nWe will not refund the visa application charge if we refuse your application.\nIf we grant your visa, we will tell you:\nKeep a copy of the decision.\nIf we refuse your visa, we will tell you:\nWe will not refund the visa application charge if we refuse your application.\nCheck your travel documents\nYou must have:\nAll people arriving Australia must complete an Incoming Passenger Card . You will be given this card during your flight.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate\nIf an immigration officer processes your clearance at our border, we recommend you tell them:\nIf you do not tell them, you might be granted the 444 visa. Grant of a subclass 444 visa will override your permanent visa and might affect your eligibility for Australian citizenship.\nThis visa lets you:\nNewly arrived residents may have to wait before they can access certain Australian Government payments and benefits.\nYou and your family members must obey all Australian laws.\nWe expect that you will work for your nominating employer in regional Australia for at least 2 years. If you don't, we might cancel your visa.\nYou must begin your employment within 6 months of:\nPermanently\nThings you need to let us know about when you have this visa include:\nSee how to let us know if there is a change in your situation.\nFrom the date we grant this visa, you can travel to and from Australia for up to 5 years.\nAfter that period, you will need a Resident Return (RRV) visa to re-enter Australia as a permanent resident.\nIf you leave Australia after the expiry date of your travel facility, without being granted another permanent visa with a valid travel facility, for example a Resident Return (RRV), you might not be able to return to Australia as a permanent resident.\nTo see when your travel facility ends, use VEVO.\nTo prove you have a visa and show your conditions to someone, use VEVO\nTo prove you have been in Australia, request your international movement records by completing Form 1359 - Request for international movement records\nWhen you work in Australia, you are protected by Australian workplace law. See your workplace rights and entitlements .\nAs an Australian permanent resident, you might be able to sponsor eligible relatives to come to Australia.\nTo find a visa for your family member, explore visa options.\nAfter a certain time, you might be eligible for Australian citizenship. Find out more about becoming a citizen.\nFor citizenship purposes, your permanent residency starts on the day:\nYou must have a valid passport or other travel document to leave Australia.\nCheck your conditions and the expiry of your Resident Return visa in VEVO\nSee what you can and must do if your visa has expired or is about to expire.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nTo prove you have been to Australia, request your international movement records by completing Form 1359 Request for international movement records (195KB PDF)."
}