{
    "visaID": "visa4.18.8",
    "visaType": "visa4.18",
    "visaName": "Superyacht Crew",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-activity-408/superyacht-crew",
    "content": "\n1. Temporary Activity visa (subclass 408)\n2. Superyacht Crew stream\n3. For Applicants\n4. For Sponsors\nUp to 12 months\nAUD415.00\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nSee all conditions\nIf you are getting help with your visa, before you pay someone, read information on Who can help with your visa application.\n5. With this visa, you can\nA superyacht is a high-value luxury sailing or motor vessel that:\n6. How long you can stay\nThis is a temporary visa. We grant the length of stay based on the activity we approve you to do on the visa.\nWe usually do not grant a visa stay period of more than 12 months for this activity. The maximum stay for this visa stream is 2 years.\nThe visa is granted with multiple entry. You can leave and re-enter Australia as many times as you want while the visa is valid.\nIf you are outside Australia when the visa is granted, the visa stay period starts on the day that you enter Australia. If you are in Australia, the visa starts on the day that it is granted.\nYour visa grant letter will tell you how long you can stay.\n7. Stay longer\nYou can't stay in Australia longer by extending this visa.\nIf you need to stay longer to complete your superyacht activities, you will need to submit a new application for this visa.\n8. Cost\nThe visa usually costs from AUD415.00 for the main applicant.\nYou might also have to pay other costs for health checks, police certificates and biometrics.\nTo work out what your visa will cost use the Visa Pricing Estimator. The estimator does not take into account the other costs.\n9. Apply from\nYou can be in or outside Australia when you apply for the visa and when we decide on your application.\n10. Processing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application can take longer to process if:\nWe can't process your application if you do not pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\n11. Your obligations\nYou and your family must meet all visa conditions and follow Australian laws.\nLearn more about conditions for this visa.\nYour activities must not harm the work, training or job conditions of Australian citizens or permanent residents.\nIf your sponsor or supporting organisation or individual stops your activity or employment, you must do one of the following:\n12. Travel\nYou can travel outside Australia and return as many times as you want while the visa is valid.\nThe time you spend outside Australia does not extend the visa.\n13. Visa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nIf we grant you a visa, we will send you a grant notification letter containing the visa grant number. You can use this number to access your digital visa record.\nYou must have:\nA superyacht is a high-value luxury sailing or motor vessel that:\nYou don't need a sponsor to apply for this visa if you:\nYou must have a supporter to apply for this visa. Your supporter must be the captain, owner or operator of the superyacht.\nYou need a sponsor to apply for this visa if you:\nYour sponsor must be the captain, owner or operator of the superyacht.\nYou must have enough money to support yourself during your stay in Australia.\nYou must be aged 18 years or older.\nYou must meet our health requirement.\nYou must meet our character requirement.\nWe might also ask that other family members meet the requirement.\nYou are personally liable for all your healthcare costs while you are in Australia. Medical insurance helps limit your financial liability.\nYou must have adequate health cover for the whole of your stay to be granted this visa. Your cover should cover you for medically necessary treatment, including transport.\nSee what we consider adequate health insurance.\nSee more about health insurance for overseas visitors.\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements.\nYou cannot use our temporary visa program to maintain ongoing residency in Australia.\nThe genuine temporary entrant (GTE) requirement helps us to make sure that you use temporary visas correctly.\nWe generally do not let temporary residents extend their stay in Australia beyond 4 years by applying for this visa.\nWe must be satisfied that you have a genuine intention to stay here temporarily.\nWhen assessing your application, we will consider:\nIf you owe the Australian Government money, you must have paid it back or have a formal arrangement to pay it back.\nIf you are 18 years of age or older, you must acknowledge the Australian Values Statement that confirms you will respect the Australian way of life and obey Australian laws when you apply for the visa.​\nYou might not be eligible for this visa if you have had a visa cancelled or refused while you were in Australia. Check if visa cancellation affects your eligibility.\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused see Limitations on applications in Australia.\nIf applying for a visa from outside Australia see Can I go to Australia.\nIf you want immigration assistance, see Who can help with your visa application.\nYou must have an eligible sponsor or supporter. Let us know if you are getting help with your application.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nProvide evidence to support your application, including sponsor or supporter documents.\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nProvide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\nAlso provide:\nDocuments that prove a change of name include:\nIf you are being sponsored for the visa, provide evidence your sponsor:\nYou must also provide evidence that your sponsor is the owner, operator or captain of a superyacht.\nProvide:\nYour supporter or sponsor must give you:\nShow us you can support yourself in Australia and anyone who comes to Australia on the visa with you by providing:\nWe can also consider allowances, accommodation and other help from your employer.\nWe will tell you if and when you need to get police certificates.\nTo nominate someone to:\nUpload your written notification or your forms to ImmiAccount.\nHave all non-English documents translated into English.\nProvide original and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nNote: You do not need to have any documents certified.\nScan or photograph all documents (English and non-English) in colour.\nThe scans and photos must be legible.\nIf a document is more than one page, save it all as one file.\nYou apply for this visa online. You can be in or outside Australia when you apply.\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nWe will not process your application until you pay the fee.\nYou must pay the fee and attach documents for all family members who apply.\nWe will let you know when we have received your application. See what you can and must do after apply.\nWe can’t give updates on applications within the standard processing time.\nYou can check if we need more information from you in ImmiAccount\nIf you are in Australia, you don't have to tell us if you want to travel outside Australia while we process your application. This is because you can be outside Australia when we make a decision.\nBut if you leave Australia, make sure you have a valid visa to return.\nLearn about visa expiry.\nIf you didn't have health examinations before you applied, we will let you know if you need them. Check ImmiAccount.\nWe might ask for biometrics (fingerprints and photo). We will let you know if you need to provide them.\nIf you did not attach all documents when you applied, attach them as soon as possible in ImmiAccount.\nWe might also ask you to provide more information.\nIf you are in Australia, make sure you stay lawful by holding a valid visa while we process your application.\nIf you were in Australia when you applied for this visa, you may be granted:\nIf your current visa expires before we decide your application, the bridging visa will come into effect. You can stay in Australia on the bridging visa while we process your visa application. You can't re-enter Australia on a BVA or BVC - there is no right of return on these visas and they will cease on departure.\nLearn more about visa expiry.\nCheck what conditions might apply to your bridging visa or the visa you have applied for with our condition checker.\nFind out what to do if your child is born after you apply.\nLet us know as soon as you can if you made a mistake on your application.\nComplete Form 1023 Notification of incorrect answers (168KB PDF) and attach it in ImmiAccount.\nLet us know if you no longer want someone to:\nUpload your written notification or your forms to ImmiAccount.\nFor more information see Who can help you with your application.\nThings you need to let us know about after you have applied include:\nSee how to tell us if your situation changes.\nYou can be in or outside Australia when we decide on your visa application.\nWe will let you know our decision in writing.\nIf we grant your visa, we will tell you:\nKeep a copy of the decision.\nIf we refuse your visa, we will tell you:\nWe will not refund the application fee if we refuse your application.\nYou must have:\nAll people arriving in Australia must complete the Incoming Passenger Card. You will be given this card onboard.\nTo see your specific conditions and work entitlements use VEVO.\nYou must meet all visa conditions and obey Australian laws.\nCheck your conditions in VEVO or your visa grant letter.\nThings you need to let us know about include:\nSee how to tell us if there is a change in your situation\nThe visa stay period starts on the date you enter Australia.\nYou can check your visa stay period in your visa grant letter or use VEVO.\nTo see when you must leave, use VEVO.\nYou can't stay in Australia longer by extending this visa. You must apply for a new visa if you want to stay longer.\nSee your options.\nYou must make your first entry to Australia by the date specified in the visa grant letter. This is the Must not arrive after date.\nOnce you make your first entry to Australia your Visa stay period starts. Your Visa stay period is the length of time you can stay in Australia.\nYou can travel outside Australia and return as many times as you want during your Visa stay period while the visa is valid.\nTime spent outside Australia does not extend the visa. The visa stay period does not start again each time you enter Australia. Any time you spend outside of Australia counts as part of the stay period.\nSee your conditions in VEVO.\nTo prove you have a visa and show your conditions to someone, use VEVO.\nRequest your international movement records to get proof of your travel in and out of Australia.\nTo see your conditions for work, use VEVO.\nIf you have permission to work, you are protected by Australian workplace law. See your workplace rights and entitlements.\nYou must have a valid passport or other travel document to leave Australia.\nCheck your conditions and the expiry of your current visa in VEVO.\nSee what you can and must do if your visa has expired or is about to expire.\nYou are likely to have some money in a superannuation fund if you worked in Australia and you are:\nSee how to access your super.\nTo get proof of your travel in and out of Australia request your international movement records."
}