{
    "visaID": "visa7.29",
    "visaType": "visa7",
    "visaName": "Skilled Regional Sponsored (subclass 487)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/skilled-regional-sponsored-visa-subclass-487",
    "content": "Skilled — Regional Sponsored visa (subclass 487)The Skilled – Regional Sponsored visa (subclass 487) closed to new applications on 1 January 2013. You might be able to apply for the Skilled – Regional (Provisional) (subclass 489) visa.\nIf you have applied for this visa but no visa decision has yet been made, you can add your dependent children to your application at any time until your visa is granted.\nIf you are granted this visa and your eligible family members want to join you in Australia, they can apply for the Skilled – Regional (Provisional) (subclass 489) visa.\n1. Visa applicants\nThe Skilled – Regional Sponsored visa (subclass 487) is closed to new applications.\nThis information is for people who have already applied for a Skilled – Regional Sponsored visa (subclass 487).\nYou can add your dependent children to your application at any time until a decision about the visa is made. You cannot add a spouse or other family members to this application.\nTo add dependent children, you must notify us in writing. A fee is payable unless the family member is a newborn child.\nFor newborn children, you can use:\nFor other dependent children, use:\nLodge these forms by ImmiAccount, or by mail or courier at the Adelaide office in South Australia - attention Adelaide General Skilled Migration.\nIf you have added a dependent child who is older than 18 years of age to your application, they might also need to provide evidence of their English language skills to determine whether they need to pay for the second instalment of the visa application charge.\nPoints test\nIf your partner lodged a combined application with you and they meet the threshold requirements for a skilled migration visa, we might use this evidence to award you points in the Points test.\nAfter you have lodged your application and documents, we will acknowledge that we have received your information.\nYour application could take longer if you need character or health checks (including chest x-rays), if you need to provide more information, or if your application is incomplete.\nOutside Australia:\nIf you apply for this visa from outside Australia, do not make arrangements to travel to Australia until you are advised in writing that you have been granted a visa.\nIn Australia:\nIf you apply for this visa in Australia, you could be able to get a Bridging visa that allows you to stay in the country lawfully while your application is processed. If you are given a Bridging visa A, you can apply for Bridging visa B (BVB) to travel outside Australia while you wait for a decision.\nYou can provide more information to us, at any time until a decision is made on the application. If you want to correct information you provided, use:\nWe could also ask you for more information. You will have to respond by a set date. After that date, we can make a decision about your application using the information that we have.\nIf another person gives us information that could result in you being refused a visa, we will usually give you the opportunity to comment on the information.\nYou might also be interviewed. If you are asked to attend an interview in person, bring your passport or other identification and any requested documents to the interview.\nYou must tell us if your circumstances change. This includes a new residential address, a new passport, or a pregnancy, birth, divorce, separation, marriage, de facto relationship or death in your family.\nPlease report changes in your circumstances via ImmiAccount. If you are not able to use ImmiAccount, you can use the following forms:\nIf you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.\nYou can withdraw the application at any time before we grant or refuse to grant the visa, using the following form:\nYour request must include your full name and date of birth. You should also include the number we gave you when you applied, if you know it - this could be a file reference number, client ID, or a Transaction Reference Number.\nYou can withdraw the application at any time before we make a decision about it. To do this, send us a letter or email to ask for the withdrawal. Your request must include your full name and date of birth. You should also include your file reference number, client ID, or a Transaction Reference Number.\nAll applicants 18 years of age or older, wishing to withdraw, must sign the request for withdrawal.\nIf the visa is granted, we will let you know:\nIf the visa is not granted, we will let you know:\n2. Visa holders\nThis visa is valid until the date we told you on your grant letter.\nThis visa lets you:\nYou might be eligible for permanent residency after you have:\nThe Skilled – Regional visa (subclass 887)is specifically designed for holders of a provisional skilled visa who want to apply for permanent residency.\nYou and your family must comply with all visa conditions and Australian laws.\nYou must live, study and work in regional Australia or a low population growth metropolitan area. There could also be residential conditions specified by the state or territory government in your nomination.\nIf you later apply for a permanent residence Skilled – Regional visa (subclass 887), you will need to prove that you have spent the specified time in that area.\nYou must live, study and work in a designated area. If you plan to apply for permanent residence, you will need to prove that you have spent the specified time in that area.\nIf you do not comply with the conditions of your visa:\nYou must tell us if your circumstances change.  This includes a new residential address, a new passport, or a pregnancy, birth, divorce, separation, marriage, de facto relationship or death in your family.\nPlease report changes in your circumstances via ImmiAccount.  If you are not able to use ImmiAccount, you can use the following forms:\nIf you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.\n3. Sponsors\nYour sponsorship period last for two years from the date the visa is granted.\nFor two years from the date the visa is granted, you have agreed to:"
}