{
    "visaID": "visa4.1.5",
    "visaType": "visa4.1",
    "visaName": "Entrepreneur stream",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/business-innovation-and-investment-888/entrepreneur-stream",
    "content": "\n1. Business Innovation and Investment (Permanent) visa (subclass 888)\n2. Entrepreneur stream\nPermanently\nFrom AUD3,400.00\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nSee all conditions\nIf you are getting help with your visa, before you pay someone, read information on Who can help with your visa application.\nApply\n3. With this visa, you can\nNewly arrived residents may have to wait before they can access certain Australian Government payments and benefits.\n4. How long you can stay\nThis is a permanent visa. It lets you stay in Australia indefinitely.\nFor citizenship purposes, your permanent residency starts on the day:\n5. Include family\nYou can include members of the family unit in your application when you apply. You can also add members of the family unit to your application at any time before we decide on your application.\nFamily members who apply for the visa must meet our health and character requirements.\nFamily members who are not coming to Australia might also have to meet our health and character requirements.\n6. Cost\nThe visa costs AUD3,400.00 for the main applicant.\nThere is also a charge for each family member who applies for the visa with you.\nAny applicant 18 years old or older who has less than functional English. must also pay an extra charge. This charge is the second instalment charge. Pay it only when we ask you to. We will refund the charge if we do not grant you the visa.\nThe second instalment charge is AUD4,890. You only need to pay it for family members who did not pay the second instalment charge for their Business Innovation and Investment (Provisional) visa.\nYou might also have to pay other costs for health checks, police certificates and biometrics.\nTo work out what your visa will cost use the Visa pricing estimator. The estimator does not take into account the second instalment or other costs.\n7. Apply from\nYou can be in or outside Australia when you apply for the visa and when we decide your application, but not in immigration clearance.\n8. Processing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application may take longer to process if:\nWe cannot process your application if you do not pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\n9. Your obligations\nYou and your family must obey all Australian laws.\nIf you are outside Australia when we grant the visa:\n10. Travel\nYou can travel to and from Australia as many times as you want for 5 years from the date we grant this visa. This is as long as the travel facility on this visa remains valid.\nIf you want to travel after the initial 5-year travel facility:\nTo see when your travel facility ends, use VEVO\n11. Visa label\nAustralian visas are digital.\nWe do not put a visa label in your passport. Instead, we link your digital visa record to your passport.\nUnless COVID-19 concessions apply, you must have held the visa for a continuous period:\nUnless COVID-19 concessions apply, you must have resided in Australia for:\nArrangements are in place for provisional visa holders who may have been disadvantaged as a consequence of the COVID-19 pandemic.\nFrom 1 February 2020 until 3 months after the end of the COVID-19 concession period, you can also apply for this visa if you held a Business Innovation and Investment (Provisional) visa (subclass 188) Entrepreneur stream which expired during the ‘COVID-19 concession period’.\nYou must have a current nomination from a State or Territory government agency.\nWhen you applied for your provisional visa, you gave us an expression of interest. A state or Territory government agency saw your expression of interest and nominated you.\nYou do not need to provide a new expression of interest. But, the relevant government agency needs to confirm that your nomination is still current, for details see the Step by step tab.\nWe assess your (the primary applicant's) entrepreneurial activities by looking at success factors.\nYou will need to show either:\nKey success factors include:\nSupporting success factors include:\nEntrepreneurial activities in Australia can't be:\nUnless COVID-19 concessions apply, you must have been in Australia for either:\nArrangements are in place for provisional visa holders who may have been disadvantaged as a consequence of the COVID-19 pandemic.\nDuring the ‘COVID-19 concession period’, time spent overseas will count as time being in Australia Business Innovation and Investment (Provisional) visa (subclass 188) Entrepreneur stream.\nIf you held a Business Innovation and Investment (Provisional) visa (subclass 188) Entrepreneur stream which expired during the concession period, time spent overseas will count as time being in Australia.\nYour Business Innovation and Investment (Provisional) visa (subclass 188) in the Entrepreneur stream that expired during the concession period must have been granted on or before 30 June 2019.\nYou and your spouse or de facto partner must not have been involved in any business or investment activities that are unacceptable in Australia.\nYou must have a realistic commitment to continuing business or investment activities in Australia\nAll applicants aged 18 or over at time of application, who did not pay a second instalment of the visa application charge for a previous subclass 188 visa application must have functional English. If you cannot show evidence of functional English, you will be asked to pay the second instalment of the visa application charge.\nThey will not need to pay a second instalment if they have already paid a second instalment of the visa application charge in relation to an application for a Subclass 188 (Business Innovation and Investment (Provisional) visa.\nDo not make a second instalment payment until we ask you to.\nWhen operating your business in Australia, you and your partner must have followed:\nThis includes laws about taxation, superannuation and workplace relations.\nYou and any family members who apply for the visa with you must meet our health requirement.\nFamily members who are not coming to Australia might also have to meet our health requirement.\nYou and family members aged 16 years or over who apply for the visa with you must meet our character requirement.\nFamily members who are not coming to Australia must also meet our character requirement.\nIf you and your family members who have applied for the visa are 18 years of age or older at the time when the application is decided,  you and your family members must:\nIf you or any family members owe the Australian Government money, you or they must have paid it back or have an approved arrangement in place to pay it back.\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused see Limitations on applications in Australia (129KB PDF).\nIf applying for a visa from outside Australia see Can I go to Australia.\nIf you want immigration assistance, see Who can help with your visa application.\nUnless COVID-19 concessions apply, you must be the primary holder of a:\nYour family members who apply for the visa do not need to hold the provisional visa.\nYou and your family members must have valid passports or travel documents for this visa.\nArrangements are in place for provisional visa holders who may have been disadvantaged as a consequence of the COVID-19 pandemic.\nFrom 1 February 2020 until 3 months after the end of the ‘COVID-19 concession period’, you can also apply for this visa if you held a Business Innovation and Investment (Provisional) visa (subclass 188) Entrepreneur stream which expired during the ‘COVID-19 concession period’.\nYour family members who apply for the visa do not need to hold the provisional visa.\nYou and your family members must have valid passports or travel documents for this visa.\nYou (the primary applicant) must have held your provisional visa for a continuous period of at least 4 years immediately before you apply. You must have resided in Australia for at least 2 years of the 4 years that you have held the provisional visa.\nYou do not need to provide a new expression of interest. But the state or territory needs to confirm that your nomination is still current\nNew step description\nYou and your family members must have valid passports or travel documents for this visa.\nYou might need to have health examinations. You can complete them before you apply or you can wait until after you apply.\nFind out the examinations you need and how to arrange them if you want to have them before you apply.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nYou will need to prove your identity, and provide documents about your business and assets. You also need to provide documents about family members applying with you.\nYou are obliged to prove your identity and provide true information with your application. See what happens if you can't prove your identity or don't provide true information.\nYou and family members who apply for the visa with you, must provide:\nColour copies of the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\nAlso provide:\nDocuments that prove a change of name include:\nProvide a death certificate, divorce or separation documents if anyone in your application has been:\nAlso provide marriage certificates or relationship registrations for you and anyone applying for a visa in your application.\nYou do need to have a current nomination from a state or territory.\nFill out  Form 1414 Nomination - Business Skills class (306KB PDF). Then:\nProvide:\nShow us you and your spouse or de facto partner have followed Australian laws when operating your business. This includes laws about taxation, superannuation and workplace relations. Give us:\nPlease give us a short summary (no more than 2 pages) of your Australian entrepreneur activities.\nAlso provide evidence of your successful record of entrepreneurship in Australia. Evidence can include:\nIf you were invited to apply for a Business Innovation and Investment (Provisional) visa (subclass 188) in the Entrepreneur stream before 1 July 2021, to support your claims of ongoing funding or investment in your entrepreneur activity, please provide:\nIf you were invited to apply for a Business Innovation and Investment (Provisional) visa (subclass 188) in the Entrepreneur stream on or after 1 July 2021, please provide evidence of genuine intention to undertake, and continue to undertake, the complying entrepreneur activity in Australia\nYou do not need to provide health documents. The doctor will send them to us.\nYou and all applicants aged 16 years and older, provide:\nTo nominate someone to:\nUpload your written notification or your forms to ImmiAccount.\nIf your partner holds a Business Innovation and Investment (Provisional) (subclass 188) visa application as your dependant partner, we do not need evidence of your relationship.\nIf you are including a partner who does not hold a subclass 188 visa as your dependant, we need to see evidence of your partner's relationship with you along with identity and character documents and documents about other relationships.\nProvide:\nProvide either:\nIf you and your partner have a child or children, and are both named as parents on the birth certificate, you will only need to provide a few documents.\nDocuments that prove your de facto relationship include:\nProvide proof that all dependent applicants aged 18 years and older, who did not pay the second instalment of the visa application charge at provisional stage, have at least functional English.\nIf any of the dependent applicants, who did not pay the second instalment cannot show evidence of functional English, you will need to pay the second instalment of the visa application charge for each of those dependent applicants, when we ask you to.\nFor every dependant under 18 years old who is applying with you, provide:\nYou must get consent for a dependent child to migrate to Australia from anyone who:\nThey must complete either:\nInclude a document with the contact details, signature and photo of the people who complete the form or declaration, such as a:\nAlternatively you must provide evidence:\nNote: If your child is likely to turn 18 while your application is being processed, you will need to provide evidence they are dependent on you. See the section 'Dependants over 18 documents' below for further information. A child who turns 18 while your application is being processed and who is not dependent on you cannot satisfy the criteria for this visa.\nIf you are including a dependant aged over 18 years of age who holds an eligible visa (Class UR or Class EB) granted on the basis of being a member of your family unit at time of grant, this section does not apply.\nTo include your child who is over 18 in your visa application, they must be:\nIf your child is likely to turn 23 while your application is being processed, you will need to provide evidence they are dependent on you due to disability.\nProvide:\nIf you are including a dependant aged over 18 years of age who holds an eligible visa (Class UR or Class EB) granted on the basis of being a member of your family unit at time of grant, this section does not apply.\nOtherwise, you must demonstrate that the child is dependent on you, by providing:\nYou must also prove this person has been financially dependent on you for at least 12 months before you apply. You could provide:\nNote: A child who turns 23 while your application is being processed and who does not meet these requirements cannot satisfy the criteria for this visa.\nHave all non-English documents translated into English.\nProvide original and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nNote: You do not need to have any documents certified.\nScan or photograph all documents (English and non-English) in colour.\nThe scans and photos must be clear.\nIf a document is more than one page, save it all as one file.\nApply online in ImmiAccount.\nYou are obliged to prove your identity and provide true information with your application.  See what happens if you can't prove your identity or don't provide true information.\nImmiAccount will tell you the charge. We will not process your application until you pay the correct charge.\nWe will let you know when we have received your application and documents. See what you can and what you must do after you apply.\nYou can check if we need more information from you in ImmiAccount.\nYou don't have to tell us if you want to travel outside Australia while we process your application. This is because you can be outside Australia when we make a decision.\nBefore you leave Australia, make sure you have a valid visa to return.\nLearn about visa expiry\nLearn about Bridging visas.\nHealth examination results are generally valid for 12 months. If your previous health clearance for subclass 188 visa is more than 12 months old, you will need to undertake new health examinations.\nDo not undertake new health examinations until we ask you to.\nWe might ask for biometrics (fingerprints and photo). We will let you know if you need to provide them.\nIf you did not attach all documents when you applied, attach them as soon as your can in ImmiAccount.\nWe might also ask you to provide more information.\nIf you are in Australia, make sure you stay lawful by holding a valid visa while we process your application.\nWhen you applied for this visa, you were granted a Bridging visa A (BVA). If your current visa expires before we decide on your application, the BVA will start. You can stay in Australia on the BVA while we process your new visa application.\nDo not cancel your current visa. If you do, you will:\nLearn more about visa expiry.\nIf you need to pay a second instalment, we will send you an invoice after you have met all other requirements for the visa. Pay the instalment after you get the invoice. Do not ask for the invoice.\nYou can add members of the family unit to your application after you apply but before we decide on your visa\nComplete Form 1436 Adding an additional applicant after lodgement (481KB PDF) and\nFind out what to do if your child is born after you apply.\nLet us know as soon as you can if you made a mistake on your application.\nComplete Form 1023 Notification of incorrect answers (168KB PDF) and attach it in ImmiAccount.\nLet us know if you no longer want someone to:\nUpload your written notification or your forms to ImmiAccount.\nFor more information see Who can help you with your application.\nThings you need to let us know about after you have applied include:\nSee how to tell us if your situation changes.\nWe will let you know by email our decision about your visa application. You can be in or outside Australia when you apply for the visa and when we decide on your application.\nIf we grant your visa, we will tell you:\nKeep a copy of the email with you when in Australia.\nIf we refuse your visa, we will tell you:\nWe will not refund the application charge if we refuse your application.\nYou must have:\nAll people arriving Australia must complete the Incoming Passenger Card. You will be given this card onboard the aircraft.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nYou and your family members must meet all visa conditions and obey Australian laws.\nWe expect you to continue to undertake business and investment activities in Australia, following the intentions you outlined in your application.\nThings you need to let us know about include:\nSee how to tell us if there is a change in your situation.\nThis is a permanent visa. It lets you stay in Australia indefinitely.\nYou can travel to and from Australia as many times as you want for 5 years from the date we grant this visa. This is as long as the travel facility on this visa remains valid.\nIf you want to travel after the initial 5-year travel facility:\nTo see when your travel facility ends, use VEVO.\nTo prove you have a visa and show your conditions to someone, use VEVO.\nRequest your international movement records to get proof of your travel in and out of Australia.\nYou can't add a family member to your application after we have granted the visa.\nIf a member of your family wants to join you later in Australia, they must apply for a separate visa that suits their situation. See their visa options.\nAfter a certain time, you might be eligible for Australian citizenship. Find out more about becoming a citizen.\nFor citizenship purposes, your permanent residency starts on the day:\nCheck your travel documents\nYou must have a valid passport or other travel document to leave Australia.\nEnsure your visa is still valid.\nCheck your conditions and the expiry of your Resident Return visa in VEVO.\nSee what to do if your visa has expired or is about to expire.\nLeaving the airport faster\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nProving you have been to Australia\nRequest your international movement records to get proof of your travel in and out of Australia."
}