{
    "visaID": "visa7.48",
    "visaType": "visa7",
    "visaName": "Student Guardian visa (subclass 580)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/guardian-visa-subclass-580",
    "content": "Guardian visa (subclass 580)You can no longer apply for the Student Guardian visa (subclass 580). It closed for new applications on 1 July 2016. From 1 July 2016, if you need to extend your stay in Australia, you must apply for a Student Visa (subclass 590).\n1. Visa holders\nThis information is for people who have already been granted a Student Guardian visa (subclass 580) or for people who applied for the visa on or before 30 June 2016 and for which a decision has not yet been made. It explains your rights and obligations.\nYou can use the free Visa Entitlement Verification Online (VEVO) to check your visa details and conditions.\nIf you already have a Student Guardian visa (subclass 580), it will be valid until the expiry date you were given when your visa was granted.\nWith this visa you can:\nYou can enter and leave Australia during the term of the visa, but you cannot leave Australia without the nominating student unless you provide us with evidence that:\n2. Obligations\nAlternative arrangements must be approved by us and the student’s education provider. Discuss your circumstances with the education provider a soon as you know you need to travel.\nThere are two ways you can make alterative welfare arrangements:\nWe will tell you if the alternative welfare arrangements have been approved. If we decide that the welfare arrangements are not suitable, you cannot leave Australia without your nominating student.\nYou must comply with the visa’s ‘no further stay’ condition. This means that you cannot apply to stay in Australia beyond the date specified on your visa, except in certain circumstances.\nYou must not work while in Australia. If you don’t abide by the conditions of your Guardian visa (subclass 580), your visa might be cancelled, and we could also cancel the nominating student’s visa.\nYou must tell us if your circumstances change. This includes a new residential address, a new passport, or a pregnancy, birth, divorce, separation, marriage, de facto relationship or death in your family.\nPlease report changes in your circumstances via ImmiAccount.  If you are not able to use ImmiAccount, you can use the following forms:"
}