{
    "visaID": "visa1.4.5",
    "visaType": "visa1.4",
    "visaName": "Frequent traveller stream",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/visitor-600/frequent-traveller-stream",
    "content": "\n1. Visitor visa (subclass 600)\n2. Frequent traveller stream\nThe visa can be granted for up to 10 years. Stay up to 3 months each time you enter.\nAUD1,435.00\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nVisa processing times are based on the age of applications finalised in a given period. Many applications finalised recently had been on-hand for some months while borders were closed.\nFor more information see visa processing times.\nSee all conditions\nBiometric collection is currently unavailable in the People’s Republic of China. If you cannot provide biometrics outside the People’s Republic of China, you will not be able to apply for the Frequent traveller stream at this time.\nYou can explore your visa options, including visas that may not require biometrics.\nApply\n3. With this visa you can\n4. How long you can stay\nThe visa can be granted for up to 10 years. You can enter Australia as often as you like while the visa is valid but you can only stay:\nYour visa grant letter will tell you how long you can stay.\n5. Stay longer\nYou can't stay in Australia longer by extending this visa. You must apply for another visa.\nYou can apply for a new visa if your visa does not have a condition that prevents further stay, such as condition 8503. You might be able to request a waiver of the no further stay condition in limited circumstances.\nYou must not breach condition 8573, no more than 12 months stay in any 24-month period, or condition 8531, must not remain in Australia beyond visa period, if they are attached to your visa.\nYou can explore your visa options.\n6. Include family\nYou can't include family members in your application. A separate application must be made for each member of your family, including those listed on your passport.\nFind out what to do if your child is born after you apply.\n7. Cost\nThe visa costs AUD1,435.00 for each applicant.\nYou might also have to pay other costs for health checks, police certificates and biometrics.\nUse the Visa Pricing Estimator to work out what your visa will cost. The estimator does not take into account the other costs.\n8. Apply from\nYou must be in the People's Republic of China when you apply.\nYou must be outside Australia when we make a decision on your application.\n9. Processing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n10. Your obligations\nYou must meet all visa conditions and obey Australian laws.\n11. Health insurance\nWe recommend you take out health insurance to cover any unforeseen medical treatment you might need in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability.\nSee what we consider adequate health insurance.\nLearn more about health insurance for overseas visitors.\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements.\n12. Travel\nYou can travel outside Australia and return as many times as you want while the visa is valid.\nThe time you spend outside Australia does not extend the visa.\n13. Visa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.​​\nYou must meet our health requirement.\nYou must meet our character requirement.\nIf you or any family members (including those who don't apply for the visa with you) owe the Australian government money, you or they must have paid it back or arranged to pay it back.\nYou must have enough money to:\nYou must only intend to:\nWe might not grant this visa if it is not in the best interests of an applicant under 18.\nYou must provide biometrics at an Australian Visa Application Centre (AVAC) or Australian Biometric Collection Centre (ABCC) before you apply for the Visitor visa (subclass 600) Frequent traveller stream. You will be given a Visa Lodgement Number (VLN). You need this number to apply.\nBiometric collection is currently unavailable in the People’s Republic of China. If you cannot provide biometrics outside the People’s Republic of China, you will not be able to apply for the Frequent traveller stream at this time.\nYou can explore your visa options, including visas that may not require biometrics.\nYou don’t have to use a migration agent to apply for any visa. But if you want to, see how to find a registered migration agent.\nAnyone can help you fill out forms or give you general help with your application. But you must let us know if you want someone to:\nProvide accurate information.\nSee what happens if you can't prove your identity or don't provide true information.\nYou must prove your identity to us. If you can't prove your identity:\nProvide the pages of your current passport showing your photo, personal details and passport issue and expiry dates.\nAlso provide:\nProvide as much proof as you can to show you are visiting Australia as a temporary, genuine visitor:\nProof that you have reasons to return home:\nTell us what business visitor activitiesyou plan to do in Australia. You could provide:\nProvide any military service record or discharge papers if this applies.\nTo nominate someone to:\nSee more about getting help with your application.\nIf anyone with a legal right to decide where an applicant under 18 lives is not visiting Australia, they must complete either:\nInclude a document with the signature and photo of the person who completed the form or declaration, such as a:\nAlso provide a birth certificate showing the names of both parents. If you can’t provide a birth certificate, provide one of the following:\nProvide:\nIf the applicant is not staying with a relative or legal guardian, provide Form 1257 - Undertaking declaration (211KB PDF). The person they are staying with must sign the form\nIf you are a dependant aged 18 or older, also provide:\nHave all non-English documents translated into English.\nProvide original and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia don't have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nNote: You don't need to have any documents certified.\nScan or photograph all documents (English and non-English) in colour.\nThe scans and photos must be clear and legible.\nIf a document is more than one page, save it all as one file.\nAttach a document only once, even if you are using it to show more than one thing.\nLearn more about attaching documents.\nProvide accurate information.\nSee what happens if you can't prove your identity or don't provide true information.\nYou must apply:\nWe will let you know when we have received your application and documents.\nThere are other things you need to know and might need to do.\nDon't make arrangements to travel to Australia until we let you know, in writing, that you have been granted a visa.\nWe will let you know if you need health examinations.\nIf you did not send us all documents when you applied, send them via ImmiAccount as soon as you can.\nWe might also ask you to provide more information.\nLet us know as soon as you can if you made a mistake on your application.\nComplete Form 1023 Notification of incorrect answers (168KB PDF) .\nLet us know if you no longer want someone to:\nSee more about withdrawing your nomination.\nTell us if things change after you lodge your application but before we have made a decision.\nThings you need to let us know about include:\nWe will let you know our decision on your visa application in writing. We will tell you:\nKeep a copy of our decision with you when in Australia.\nIf we refuse your visa we will let you know in writing. We will tell you why we refused and whether you have a right to a review of the decision.\nCheck your travel documents\nYou must have:\nComplete an Incoming Passenger Card\nEveryone who arrives in Australia must complete an Incoming Passenger Card.\nUsing the SmartGate\nA SmartGate is an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGates.\nYou must meet all visa conditions and obey Australian laws. See your conditions in VEVO or your visa grant letter.\nLearn more about visa conditions and how they work.\nThings you need to let us know about include:\nSee how to let us know if there is a change in your situation.\nThis visa lets you:\nVolunteer work tourism schemes\nYou can't work in Australia on a Visitor visa, but you might be able to do volunteer work.\nTravel on your visa\nYou can travel to and from Australia as many times as you want while the visa is valid\nSee how long you can stay\nSee when you must leave in VEVO.\nStay longer\nYou can't stay in Australia longer by extending this visa. You must apply for a new visa if you want to stay longer. See your options.\nProve you have a visa\nTo prove you have a visa and show your conditions to someone, use VEVO.\nRequest your international movement records to get proof of your travel in and out of Australia.\nCheck your travel documents\nYou must have a valid passport or other travel document to leave Australia.\nEnsure your visa is still valid\nSee what to do if your visa has expired or is about to expire.\nDepartures SmartGate\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGates.\nInternational Movement Record\nRequest your international movement records to get proof of your travel in and out of Australia."
}