{
    "visaID": "visa7.4",
    "visaType": "visa7",
    "visaName": "Business Skills (Provisional) visa (subclass 160 and 165)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/business-skills-provisional-visas-subclasses-160-165",
    "content": "Business Skills (provisional) visas (subclasses 160-165)The following visas are closed to most new applications:\nFamily members of people who already hold these visas might be able to get the same visa.\nIf you have already applied for one of these visas and it has not yet been decided, you can also add your dependent children or your partner’s dependent children to your visa application until the application is decided.\nYour eligible family members can apply for this visa when they are in or outside Australia.\nSomeone who applies for this visa must be outside Australia when it is granted unless they held a student visa when they applied. In this case, they can be in or outside Australia when the visa is granted.\n1. Visa Applicants\nThis visa is closed to new applicants. Dependent children can be added to the visa application at any time until the application is decided.\nDependent children can be added to the visa application at any time until the application is decided. Dependent children are your or your partner's children who:\nTo add dependent children, complete:\nThe documents listed in the document checklist must be provided with this application form.\nFamily members of someone who already has one of these visas, or who has lodged an application that has not yet been decided, might be able to get the same visa. The family members must be their:\nThese family members must meet the requirements for including family members in your application. The application must include documentary evidence of their relationship to you.​​\nYour family members must be able to show that they meet health and character requirements.​\nThe family members might also need to take the International English Language Testing System (IELTS) test to show how well they speak, ready and write English.\nComplete the following form to apply for one of the visas:\nSubmit the documents listed in the document checklist with the application and pay the visa application charge by credit card, money order or bank cheque.\nYou must meet certain health requirements. However, most applicants for this visa will not be required to complete additional health examinations. Do not arrange a health examination until we ask you to.\nYou must meet certain character requirements. You must provide a police certificate from each country you have lived in for 12 months or more during the past 10 years after you turned 16 years of age.\nYou must have no outstanding debts to the Australian Government or have arranged to repay any outstanding debts to the Australian Government before this visa can be granted.\nBusiness Owner (Subclass 160):\nSenior Executive (Subclass 161):\nInvestor (Subclass 162):\nState/Territory Sponsored Business Owner (Subclass 163):\nState/Territory Sponsored Senior Executive (Subclass 164):\nBusiness Skills (Provisional) (Class UR) (Subclass 165):\nAfter you have lodged your application and documents, we will acknowledge that we have received your information\nYour application could take longer if you need character or health checks (including chest x-rays), if you need to provide more information, or if your application is incomplete.\nIf you applied for this visa outside Australia, do not make arrangements to travel to Australia until you are advised in writing that you have been granted a visa.\nYou can provide more information to us, at any time until a decision is made on the application. If you want to correct information you provided, use:\nWe could also ask you for more information. You will have to respond by a set date. After that date, we can make a decision about your application using the information that we have.\nIf another person gives us information that could result in you being refused a visa, we will usually give you the opportunity to comment on the information.\nYou might also be interviewed. If you are asked to attend an interview in person, bring your passport or other identification and any requested documents to the interview.\nYou must tell us if your circumstances change. This includes a new residential address, a new passport, or a pregnancy, birth, divorce, separation, marriage, de facto relationship or death in your family.\nPlease report changes in your circumstances via ImmiAccount. If you are not able to use ImmiAccount, you can use the following forms:\nIf you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.​​\nSee: Withdrawing your application\nIf the visa is granted, we will let you know:\nIf the visa is not granted, we will let you know:\nYou need to provide documents to support your application for this visa. We can make a decision using the information you provide when you lodge your application. It is in your interest to provide as much information as possible with your application.\nProvide certified copies of original documents. Do not include original documents unless we specifically ask for them. Police certificates should be original documents. Documents not in English must be accompanied by accredited English translations.\nUse this checklist to make sure your application is complete.\nIf you use Form 1229 or a statutory declaration, you will have to attach a certified copy of the other parent’s government-issued identification document (such as a passport or driver's licence) with their photograph and signature.\nstatutory declaration  giving their permission\nProvide the original certificates and keep a copy for yourself.\nYou should have at least functional English.\nApplicants and dependants (18 years and older) who cannot provide evidence of having at least functional English must pay a second instalment of the visa application charge.\nIf they have less than functional English provide a statement indicating your intention to pay the second visa application charge.\nTo prove you have fu​​nction​al English you must provide evidence of one of the following:\n2. Visa holders\nThis information is for people who have already been granted one of the following visas:\nIt explains your rights and obligations.\nYou can use  Visa Entitlement Verification Online (VEVO) for free to check your visa details and entitlements.\nIf you are outside Australia when the visa is granted, you will need to enter Australia by a specified date. The visa is usually valid for four years from the date specified for your first entry to Australia.\nThis visa allows you and any family members who have been granted this visa to:\nYou cannot access Medicare, family assistance or social security benefits.\nYou and your family must comply with all visa conditions and Australian laws.\nYou might also need to comply with the following conditions:\nYou need to provide valuable input into the Australian economy. You must:\nIn the business, it is expected that you will do at least one of the following:\nA failure to meet these obligations while holding a Business Skills (Provisional) visa may impact adversely upon any late application for a Business Skills (Residence) visa.\nHolders of these visas may be asked to complete a monitoring survey to provide us with information about any business activities undertaken in Australia. This assists in reporting on outcomes of the Business Skills category.\nApplicants for Investor visas must maintain their Designated Investment for a four year term. Failure to do so may result in visa cancellation.\nHolders of these visas may be asked to complete a monitoring survey to provide us with information about any business activities undertaken in Australia. This assists in reporting on outcomes of the Business Skills category."
}