{
    "visaID": "visa4.2.1",
    "visaType": "visa4.2",
    "visaName": "Business Innovation stream",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/business-innovation-and-investment-188/business-innovation-stream",
    "content": "\n1. Business Innovation and Investment (Provisional) visa (subclass 188)\n2. Business Innovation stream\nUp to 5 years.\nFrom AUD9,710.00\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nSee all conditions\nIf you are getting help with your visa, before you pay someone, read information on Who can help with your visa application.\n3. With this visa, you can\n4. How long you can stay\nThis is a provisional visa. You can stay in Australia for up to 5 years if you were invited to apply for this visa on or after 1 July 2021.\nIf you applied after 1 July 2015, and were invited to apply for this visa before 1 July 2021, you can stay in Australia for up to 4 years and 3 months.\nIf you applied before 1 July 2015, you can stay up to 4 years.\nThe visa is granted with multiple entries. You can leave and re-enter Australia as many times as you want while the visa is valid.\nThe visa starts on the date it is granted.\n5. Stay longer\nThis is a provisional visa. You must apply for a new visa if you want to stay longer. Once you have this visa, you can apply for permanent residence through the Business Innovation and Investment (Permanent) visa (subclass 888) in the Business Innovation stream if certain requirements are met. Explore your visa options.\nIf you need more time to apply for permanent residence, you can apply for a new Business Innovation and Investment (Provisional) visa (subclass 188) in the Business Innovation Extension stream. If granted, you will be able to travel to, enter and remain in Australia for up to 7 years after the date of the grant of the original Business Innovation and Investment (Provisional) visa (subclass 188) in the Business Innovation stream.\n6. Include family\nYou can add your dependent child or children to your application at any time before we decide on your application. They will need to meet our health and character (if applicable) requirements.\nThe spouse or de facto partner of the main applicant who did not make a combined application at the initial lodgement of the subclass 188 visa, can make a subsequent entrant application. A subclass 188 visa can only be granted to a subsequent entrant after the main applicant’s subclass 188 visa is granted.\nComplete the online 'Application for a Business Innovation and Investment (Subsequent Entrant) Visa' application form in ImmiAccount. An application charge is applicable.\nIn order for the primary applicant to be granted the visa, family members who are not coming to Australia must meet our character requirements, and might have to meet our health requirements.\n7. Cost\nThis visa costs from AUD9,710.00 for the main applicant.\nThere is also a charge for each family member who applies for the visa with you:\nAny applicant 18 years old or older who has less than functional English must also pay an extra charge.This charge is the second instalment charge. Pay it only when we ask you to. We will refund the charge if we do not grant you the visa.\nThe second instalment charges are:\nTo work out what your visa will cost use the Visa Pricing Estimator. The estimator does not take into account the second instalment or other costs. You might also have to pay other costs for health checks, police certificates and biometrics.\n8. Apply from\nYou can be in or outside Australia when you apply for the visa and when we decide on your application, but not in immigration clearance.\n9. Processing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application might take longer to process if:\nWe can't process your application if you do not pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\n10. Your obligations\nYou and your family members who are part of your application must comply with all visa conditions and Australian laws.\nLearn more about conditions for this visa.\nYou must also meet certain business obligations and obey Australian workplace laws.\nWhile the holder of this visa, you must:\nIn the business, you must do at least one of these things:\nAll workers in Australia (including visa holders) have rights and protections at work. Pay rates and workplace conditions are set by Australian law.\nYou must meet workplace laws when operating your business in Australia. The Pay and Conditions Tool (PACT) can help you with:\n11. Adequate health insurance\nWe recommend you take out health insurance to cover any unforeseen medical treatment you might need in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability.\nSee what we consider adequate health insurance.\nLearn more about health insurance for overseas visitors.\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements.\n12. Travel\nYou can travel outside Australia and return as many times as you want while the visa is valid.\nThe time you spend outside Australia does not extend the visa.\n13. Visa label\nAustralian visas are digital.\nWe do not put a visa label in your passport. Instead, we link your digital visa record to your passport.\nFirst, you must submit an Expression of Interest (EOI). If an Australian State or Territory government agency accepts your EOI and nominates you, we will invite you to apply for this visa.\nYou must be nominated by an Australian State or Territory government agency, before being invited to apply for this visa.\nThe State or Territory government agency that nominates you must not withdraw their nomination after you apply, or we will be unable to grant you a visa.\nFor 2 out of 4 fiscal years immediately before you receive an invitation to apply, you must have had an ownership stake in 1 or 2 businesses that had at least:\nWhether you have 1 or 2 businesses, you must own at least:\nIf your business provides professional, technical or trade services, you must have spent less than half your time providing those services, rather than general management of the business.\nWhen you are invited to apply for this visa, you, your partner, or you and your partner combined must have total net business and personal assets of at least:\nYour funds must be available to transfer to Australia within 2 years of us granting the visa.\nYou must score at least 65 points on the points test.\nYou can get points for many reasons, including your:\nCheck how many points you might get.\nYou must have a successful business career and a genuine desire to continuously own and manage a business in Australia.\nYou will not receive an invitation if you are aged 55 or older at the time of the invitation to apply for the visa.  If you are older, a State or Territory might invite you to apply for this visa if your business will be of exceptional economic benefit.\nYou and your partner must have had no history of involvement in business or investment activities that are of a nature that is not generally acceptable in Australia.\nAll applicants aged 18 or over at the time of application must either have at least functional English or you  will be asked to pay the second instalment of the visa application charge.\nYou and any family members who apply for the visa with you must meet our health requirement.\nFamily members who are not coming to Australia might also meet our health requirement.\nYou and family members aged 16 years and over who apply for the visa with you must meet our character requirement.\nFamily members who are not coming to Australia must also have to meet our meet our character requirement.\nIf you and your family members who have applied for the visa are 18 years of age or older at the time of application, you and your family members must:\nIf you or any family members owe the Australian Government money, you or they must have paid it back or have an approved arrangement in place to pay it back.\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused see Limitations on applications in Australia.\nIf applying for a visa from outside Australia see Can I go to Australia.\nIf you want immigration assistance, see Who can help with your visa application.\nYou must give us an Expression of Interest (EOI), be nominated by a State or Territory, and then be invited to apply.\nIf you need help with your EOI you can use a registered migration agent or legal practitioner. For information on how to find someone to help you see Who can help you with your application.\nYou must submit an expression of interest (EOI) to let us know you want to apply for this visa.\nYour EOI tells us about your skills, qualifications and business experience. It lets us know which states and territories you would like to operate a business in. If you are eligible and a State or Territory government nominates you, we might then invite you to apply for the visa.\nCheck that you meet all other eligibility criteria for the visa.\nEach nominator will assess your EOI using their own criteria. Learn more:\nIf you receive an invitation to apply for the visa after you submit your EOI, you will need to provide documents that:\nYou should have all these documents before you submit your EOI.\nYou must score at least 65 points on our points test to be eligible for this visa. If you can't score 65 points, you will not be considered for an invitation.\nIf we invite you to apply for the visa, you must prove the claims you make in your EOI.\nUse the points table to check how many points you might score.\nWe use the points test to help us select people who have the skills and attributes Australia needs.\nYou can get points for many reasons, including your:\nSubmit your EOI via Skillselect.\nYou can submit it from within or outside Australia.\nYour EOI is not a visa application. There is no charge for submitting an EOI.\nSelect the Business Innovation and Investment (Provisional) visa (subclass 188).\nYou will receive an email confirming your EOI has been submitted.\nSkillSelect will estimate your points score. If you score is at least 65 points, your EOI will be visible to State and Territory governments. If you have skills they need, a State or Territory government agency might nominate you for the visa.\nIf you get a nomination, you will get an invitation to apply for this visa\nAn EOI is not a visa application. Submitting an EOI does not mean you will get a bridging visa.\nIf your current visa is about to expire, you must apply for another visa to remain in Australia lawfully.\nYou can change your EOI in SkillSelect if:\nYou must be able to meet the minimum score of 65 points.\nSkillSelect will update your points score when you make changes to your EOI. You can change your EOI at any time before we invite you to apply for a visa.\nYou can't make changes to your EOI after we invite you to apply for a visa.\nYou could receive an invitation any time within 2 years of submitting your EOI. If you are invited to apply for the visa, you will receive an email from SkillSelect. Receiving an invitation does not mean you will be granted the visa.\nIf you are invited, you have 60 calendar days to apply for the visa. This time will not be extended.\nYou must demonstrate that you can score a minimum of 65 points and satisfy all other eligibility criteria. If you can't meet the points score and all other eligibility criteria, we will not grant you the visa.\nIf you do not apply for the visa after two invitations, your EOI will be removed from SkillSelect.\nIf you can't show that you can meet the points score and satisfy all other eligibility criteria, you should not apply for the visa until you can. If you want to update your EOI to better reflect your points score, you can do that after the 60-day invitation period.\nIf this is your first invitation, you might be sent a second invitation after the 60-day invitation period.\nIf this is your second invitation, you will have to submit another EOI if you still want the visa.\nIf you are not invited to apply within 2 years of submitting your EOI, your EOI will expire. We will send you an email when your EOI is about to expire.\nYou will need to submit a new EOI if you still want the visa.\nYou will not receive an invitation if you turn 55, unless the nominating State or Territory government agency has determined an exceptional economic benefit to the State or Territory in which the agency is located.\nYou and your family members who are applying for this visa, will need valid passports. If you plan to get a new passport, do this before applying.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nYou will need to prove your identity, and provide documents about your business and assets. You also need to provide documents about family members applying with you.\nApplying from China, Macau, Hong Kong or Taiwan\nIf you are applying from the People’s Republic of China, Macau (SAR), Hong Kong (SAR) or Taiwan use the document checklist from the Australian Consulate General Hong Kong.\nYou are obliged to prove your identity and provide true information with your application. See what happens if you can't prove your identity or do not provide true information.\nYou and family members who apply for the visa with you, must provide:\nColour copies of the pages of your current passport showing photo, personal details, and passport issue and expiry dates.\nAlso provide:\nDocuments that prove a change of name include:\nYou must provide documents about your business and your net assets. These documents are to prove that your business is eligible for this visa. With your application, provide:\nWith your application, give us:\nThis can include:\nThis can include:\nIf you want to include assets held by a trust, you must include a copy of the trust deed.\nThis can include:\nIf your business is a trust, provide full trust deed and amendments (including the names of all trustees and beneficiaries at the time the trust was formed).\nProvide evidence that you maintained direct and continuous involvement in management of the business from day to day and in making decisions affecting the overall direction and performance of the business for 2 of the 4 fiscal years before we invited you to apply.\nThe evidence needs to show your involvement in decisions about the management of the business. It must show you are responsible for such areas as:\nProvide your business registration certificate or licence for your main business.\nThis can include:\nProvide a full set of financial statements for your business. These must be for:\nAn independent accountant must prepare the statements to International Accounting Standards. They must include a balance sheet, profit and loss statement and notes to the accounts.\nProvide:\nIf applicable, provide:\nEvidence of assets of:\nProvide evidence that you, your partner, or you and your partner combined hold required total net business and personal assets. You must have acquired these assets legally. You must be able to transfer them to Australia within 2 years after we grant the visa.\nYou will be required to nominate a specific date within 3 months immediately before  we invited you to apply.\nProvide Form 1139A Statement of Assets and Liabilities Position.\nProvide evidence of your ownership of each asset, its value, and any liabilities against it as at the date you nominated.\nProvide:\nLabel each document so that it clearly identifies the relevant asset or liability.\nCross- reference the asset or liability to the appropriate item in the Statement of Assets and Liabilities Position. This can be found on Form 1139A Statement of Assets and Liabilities Position.\nProvide documents only for items you want points for in the Points Test. Check what you can get points for.\nTo be awarded points for English language ability you must demonstrate that you have either vocational English or proficient English.\nProvide a certified copy of the trade qualification, diploma or bachelor degree to claim points.\nProvide evidence of ownership of assets as at the 2 fiscal years prior to when we invited you to apply for the visa. Use Form 1139A Statement of Assets and Liabilities Position.\nProvide a full set of financial statements for the business:\nTurnover claims must be further supported by submitted VAT or Income Tax Returns for the business.\nProvide evidence that you have held one or more main business for:\nFor a registered patent or design, provide evidence that proves that you own it.\nThe relevant national or regional intellectual property administration office must issue this evidence. It must include enough information that we can assess whether your ownership meets the points requirement.\nAlso provide a statement outlining how the registered patent or registered design is relevant to your main business.\nThis statement must also show how it is applied in the day-to-day activities of the business. You must be able to provide evidence to support any claims made in the statement if we ask you to.\nFor a registered trademark, provide evidence that proves ownership of the trademark.\nThe relevant national or regional intellectual property administration office must issue this documentation. It must include enough information that we can assess whether your ownership meets the points requirement.\nAlso provide a statement outlining how the trademark is relevant to your main business. This statement must also show how it is applied in the day-to-day activities of the business. You must be able to provide evidence to support any claims made in the statement if we ask you to.\nFor a joint venture agreement, provide a copy of the agreement showing:\nAlso provide a statement outlining:\nFor export trade, provide:\nEvidence that at least 50% of the turnover of your main business related to export trade. This must be the case for at least 2 of the 4 fiscal years before we invited you to apply for this visa. You could provide:\nWe might ask you to provide a special-purpose report prepared by a qualified accountant attesting to your claim.\nFor a gazelle business, provide:\nAlso provide evidence that you have had 10 or more full-time employees for at least one fiscal year. This must be the same consecutive 3-year period claimed for growth in turnover. You could provide taxation records, insurance or superannuation documents or similar business records identifying each employee by name.\nTo show receipt of grant or venture capital funding, provide:\nProvide proof you have at least functional English.\nAll applicants aged 18 years and older at the time of application who can't provide evidence of having at least functional English must pay a second instalment of the visa application charge.\nIf you and any family member applying with you have less than functional English, provide a statement indicating your intention to pay the second visa application charge for each person with less than functional English.\nWe will advise you when to pay this.\nYou do not need to provide health documents. The doctor will send them to us.\nYou and family members aged 16 years and over who apply for the visa with you, provide:\nTo nominate someone to:\nUpload your written notification or your forms to ImmiAccount.\nProvide your partner's:\nProvide either:\nDocuments that prove your de facto relationship include:\nFor every dependant 18 years old or younger who is applying with you, provide:\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\nThey must complete either:\nAlternatively, you can show us:\nInclude:\nNote: If your child is likely to turn 18 while your application is being processed, you will need to provide evidence they are dependent on you. See the section 'Dependants over 18 documents' below for further information. A child who turns 18 while your application is being processed and who is not dependent on you cannot satisfy the criteria for this visa.\nTo include your child who is over 18 in your visa application, they must be:\nProvide:\nIf your child is likely to turn 23 while your application is being processed, you will need to provide evidence they are dependent on you due to disability.\nProof of dependency\nYou must demonstrate that the child is dependent on you, by providing:\nYou must also prove this person has been financially dependent on you for at least 12 months before you apply. You could provide:\nNote: A child who turns 23 while your application is being processed and who does not meet these requirements cannot satisfy the criteria for this visa.\nHave all non-English documents translated into English.\nProvide original and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nNote: You do not need to have any documents certified\nScan or photograph all documents (English and non-English) in colour.\nThe scans and photos must be clear.\nIf a document is more than one page, save it all as one file.\nApply for this visa online in ImmiAccount. You must be invited to apply. Your invitation letter contains instructions on how to lodge your application.\nFor all applications lodged from 13 November 2021, applicants should upload supporting documentation to ImmiAccount when lodging a subclass 188 Business Innovation and Investment visa application in all streams.\nUploading all documents to ImmiAccount will ensure efficient processing and help to reduce processing times. Please utilise naming conventions provided when uploading supporting documents. Where naming conventions are unavailable for a particular document/s, please ensure that a proper heading is provided to the attached document/s.\nYou are obliged to prove your identity and provide true information with your application. See what happens if you cannot prove your identity or do not provide true information.\nImmiAccount will tell you the charge. We will not process your application until you pay the correct charge.\nAfter you submit your application online, send us your documents and other forms.\nIf you are applying from the People’s Republic of China, Macau (SAR), Hong Kong (SAR) or Taiwan use the document checklist from the Australian Consulate General Hong Kong.\nIf you live elsewhere, send your supporting documents via email to the mailbox address specified in the Acknowledgement of Application Received letter. You will receive this letter after you lodge your application via ImmiAccount.\nFor all applications lodged from 13 November 2021, applicants should upload supporting documentation to ImmiAccount when lodging a subclass 188 Business Innovation and Investment visa application in all streams via ImmiAccount.\nWe will let you know when we have received your application.\nWe cannot provide updates on applications. You will be contacted if additional information is required. Please wait for us to contact you.\nYou do not have to tell us if you want to travel outside Australia while we process your application. This is because you can be outside Australia when we make a decision.\nBut if you leave Australia, you must make sure you have a valid visa if you plan to return to Australia before a decision is made on your application.\nLearn about visa expiry.\nLearn about Bridging visas\nIf you did not have health examinations before you applied, we will let you know if you need them.\nWe might ask for biometrics (fingerprints and photo). We will let you know if you need to provide them.\nIf you didn't send us all documents when you applied, send them as soon as you can.\nApplying from China, Macau, Hong Kong or Taiwan\nIf you are applying from the People’s Republic of China, Macau (SAR), Hong Kong (SAR) or Taiwan use the document checklist from the Australian Consulate General Hong Kong.\nIf you live elsewhere, send your supporting documents via email to the mailbox address specified in the Acknowledgement of Application Received letter. You will receive this letter after you lodge your application via ImmiAccount.\nIf you are in Australia, make sure you stay lawful by holding a valid visa while we process your application.\nWhen you applied for this visa, if you were in Australia, you were granted a Bridging visa A (BVA). If your current visa expires before we decide on your application, the BVA will start.\nYou can stay in Australia on the BVA while we process your new visa application. However, if you intend to leave Australia and return while holding a BVA, you will need to apply to our office for a Bridging Visa B (BVB) or make alternative visa arrangements to return, as your BVA ceases when you leave Australia.”\nDo not cancel your current visa. If you do, you will:\nLearn more about visa expiry.\nIf you need to pay a second instalment, we will send you an invoice after you have met all other requirements for the visa. Pay the invoice after you get it.\nYou must pay the instalment before we will grant the visa.\nyour dependent child or children to your application at any time before we decide on your application. They will need to meet our health and character (if applicable) requirements.\nComplete Form 1436 Adding an additional applicant after lodgement and\nThe spouse or de facto partner of the main applicant who did not make a combined application at the initial lodgement of the subclass 188 visa, can make a subsequent entrant application. A subclass 188 visa can only be granted to a subsequent entrant after the main applicant’s subclass 188 visa is granted.\nComplete the online 'Application for a Business Innovation and Investment (Subsequent Entrant) Visa' application form in ImmiAccount. An application charge is applicable.\nFind out what to do if your child is born after you apply.\nLet us know as soon as you can if you made a mistake on your application.\nComplete Form 1023 Notification of incorrect answers.\nLet us know if you no longer want someone to:\nUpload your written notification or your forms to ImmiAccount.\nFor more information see Who can help you with your application.\nThings you need to let us know about after you have applied include:\nSee how to tell us if your situation changes.\nWe will let you know in writing our decision about your visa application. If we grant you the visa, we will tell you:\nKeep a copy of this with you when in Australia.\nIf we refuse your visa we will tell you why we refused and whether you have a right to a review of the decision.\nWe will not refund the application charge if we refuse your application.\nYou must have:\nAll people arriving Australia must complete the Incoming Passenger Card. You will be given this card onboard the aircraft.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nThis is not a permanent visa. With this visa you can:\nTo see your specific conditions, work and study entitlements use VEVO.\nYou and your family members must comply with all visa conditions and obey Australian laws. See your conditions in VEVO or your visa grant letter.\nYou also must meet certain business obligations and comply with Australian workplace laws.\nYou must genuinely have a realistic commitment to:\nIn the business, you must do at least one of these things:\nDuring your stay, we might survey you about your business activities in Australia.\nAll workers in Australia (including visa holders) have rights and protections at work. Pay rates and workplace conditions are set by Australian law.\nIf you operate a business in Australia, you must comply with workplace laws. The Pay and Conditions Tool (PACT) can help you with pay rates, shift calculations, leave arrangements and notice and redundancy entitlements.\nThings you need to let us know about include:\nSee what to do if your situation changes\nThis is a provisional visa. You can stay in Australia for up to 5 years.\nThe visa starts on the date we grant it.\nTo see when you must leave, use VEVO.\nThis is a provisional visa. You must apply for a new visa if you want to stay longer. Once you have this visa, you can apply for permanent residence if certain requirements are met. Explore your visa options.\nOnce you have the provisional visa, you can apply for the Business Innovation and Investment (Permanent) visa (subclass 888) Business Innovation stream if certain requirements are met.\nIf you need more time to apply for permanent residence, you can apply for a Business Innovation and Investment (Provisional) visa (subclass 188) in the Business Innovation Extension stream to extend your stay in Australia.\nIf we grant this visa, it will be valid for up to 7 years after the date of the grant of the original provisional visa held at the time of application. The extra time gives you time to qualify for a Business Innovation and Investment (Permanent) visa (subclass 888) in the Business Innovation stream.\nThis is a multiple entry visa. You can travel outside Australia and return as many times as you want while the visa is valid.\nThe time you spend outside Australia does not extend the visa.\nSee your conditions.\nTo prove you have a visa and/or show your conditions to someone, use VEVO.\nRequest your international movement records to get proof of your travel in and out of Australia.\nAfter you are granted this visa, if members of your family want to apply for the same visa, they must submit a separate online application. Any additional family members are called 'subsequent entrants'.\nNewborn and dependent child or children can be added to your 188 visa application before we decide on your application. However, your spouse or de-facto partner, who did not make a combined application with you at the initial lodgement of your application, can make a subsequent entrant application. A subclass 188 visa can only be granted to a subsequent entrant after the main applicant’s subclass 188 visa is granted.\nComplete the online 'Application for a Business Innovation and Investment (Subsequent Entrant) Visa' application form in ImmiAccount. An application charge is applicable.\nYou must have a valid passport or other travel document to leave Australia.\nWe have an automated process that uses facial recognition technology and your ePassport. You could leave the airport faster if you use SmartGate.\nRequest your international movement records to get proof of your travel in and out of Australia."
}