{
    "visaID": "visa4.15.1",
    "visaType": "visa4.15",
    "visaName": "Skilled Work Regional (Provisional) visa - Main applicant",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/skilled-work-regional-provisional-491/application",
    "content": "\n1. Subclass 491\n2. Skilled Work Regional (Provisional) visa - Main applicant\n5 Years\nFrom AUD4,770.00\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nSee all conditions\nIf you are getting help with your visa, before you pay someone, read information on Who can help with your visa application.\n3. With this visa you can\n4. How long you can stay\nThis is a temporary visa. You can stay in Australia for 5 years from the date we grant your visa.\n5. Stay longer\nYou can't stay in Australia longer by extending this visa. Explore your visa options\n6. Include family\nYou can include members of the family unit in your application. You can:\nFamily members who apply for the visa must meet our health and character requirements.\nFamily members not accompanying you to Australia might also need to meet our health and character requirements.\nIf your partner or dependent children are not included in this application, tell us the reason why (for example, they already hold Australian citizenship or are a permanent resident).\n7. Cost\nFrom AUD4,770.00 for the main applicant.\nThere is also a charge for each family member who applies for the visa with you.\nTo work out what your visa will cost use the Visa Pricing Estimator. The estimator does not take into account the second instalment or other costs.\nYou might have to pay an extra charge for any applicant 18 years old or older who has less than functional English. This charge is called the second instalment. Pay it only when we ask you to. We ask for the charge only if we are going to grant the visa.\nThe second instalment charge for family members is AUD4,890.00.\nThe Visa Pricing Estimator does not include the second instalment or other costs. You might also have to pay other costs for health checks, police certificates and biometrics\n8. Apply from\nYou can be in or outside Australia, but not in immigration clearance when you apply for the visa and when we decide on your application.\nIf you apply in Australia, you must hold a substantive visa or a subclass 010 Bridging A visa, a subclass 020 Bridging B visa or a subclass 030 Bridging C visa, otherwise your application will not be valid.\n9. Processing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nWe assess applications on a case-by-case basis, and actual processing times can vary due to individual circumstances including:\n10. Your obligations\nYou and your family must comply with all visa conditions and Australian laws.\nLearn more about conditions for this visa.\n11. Travel\nYou can travel out of Australia and return as many times as you want while the visa is valid.\nThe time you spend outside Australia does not extend the visa.\n12. Visa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nYou can only apply for this visa if we invite you to.\nSubmit an expression of interest (EOI) in SkillSelect to let us know you would like to apply for the visa.\nIndicate if an eligible relative is going to sponsor you for this visa or if you want a state or territory government agency to nominate you.\nYou must be either nominated by an Australian state or territory government agency or indicate that you will be sponsored by an eligible relative. See below for more information.\nSubmit an expression of interest (EOI) for the visa to get an estimate of your points score.\nIf you score enough points, state and territory government agencies can see your EOI and might nominate you for the visa.\nIf you indicate in your EOI that you will be sponsored by an eligible relative the Department may invite you to apply for a visa in an invitation round.\nIf you are nominated for the visa, we will invite you to apply. All state and territory government agencies have their own criteria for deciding who they will nominate.\nContact the state or territory agency directly to find out more about their nomination process and what they want from you.\nYour sponsor must be:\nAn eligible relative can be:\nWe must approve your sponsorship before you can be granted a visa.\nYou must be aged under 45 to be invited to apply for the visa.\nYou can still apply for the visa if you turn 45 after we invite you to apply.\nIf you turn 45 after you submit your EOI but before we invite you to apply you will not receive an invite.\nFor your application to be valid, you must declare that you have a suitable skills assessment at time of invitation.\nDelegates of the Minister will now accept a suitable skills assessment for an applicant’s nominated skilled occupation which has been obtained within the 60 day invitation period.\nThis change of approach is made as a result of the decision of Thapa v Minister for Immigration, Citizenship, Migrant Services and Multicultural Affairs [2021] FCCA 686 (Thapa). The Minister will administer the Migration Regulations 1994 in accordance with the decision in Thapa, but the Minister reserves the right to make submissions in a Court that Thapa was wrongly decided.\nYou will need to provide a copy of this skills assessment with your application.\nFor medical and legal practitioners, we also accept the following as proof of a skills assessment:\nYour skills assessment must have been obtained in the 3 years before the date of your invitation. If the assessment was for a shorter period, that period must not have passed.\nIf your skills were assessed on the basis of a qualification you got in Australia when you held a student visa, the qualification must be from studying a course registered on CRICOS.\nThe subclass 491 is a points-tested visa.\nWhen you submit your EOI in SkillSelect you will be given an indicative points score based on the claims you have made. If you do not obtain a score of 65 points you will not be invited to apply for this visa.\nIf we do invite you to apply for the visa, your invitation will state the number of points that you must score when we assess your application for grant of the visa (this score may be higher than 65 points, depending on your claims in the EOI).\nWhen you lodge your application you must provide evidence supporting your claims.\nTo check how points can be awarded refer to the points table.\nAt the time of invitation, you must have at least Competent English.\nIf a family member 18 years or older is applying for the visa with you, either:\nYour occupation must be on the combined list of eligible skilled occupations for a Skilled Regional (subclass 491) visa.\nYou and any family members who apply for the visa with you must meet our health requirement. If requested, family members not accompanying you to Australia might also need to meet our health requirement.\nYou and family members aged 16 years and over who apply for the visa with you must meet our character requirement. Family members not accompanying you to Australia must also meet the character requirement.\nIf you or any family members (including those who do not apply for the visa with you) owe the Australian Government money, you or they must have paid it back or arranged to pay it back.\nIf you are 18 years of age or older, you must:\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused see Limitations on applications in Australia (129KB PDF).\nIf applying for a visa from outside Australia see Can I go to Australia.\nIf you want immigration assistance, see Who can help with your visa application.\nYou must submit an expression of interest (EOI) through SkillSelect to let us know you want to apply for this visa.\nIf you need help with your EOI you can use a registered migration agent or legal practitioner. For information on how to find someone to help you see Who can help you with your application.\nYou must submit an expression of interest (EOI) to let us know you want to apply for this visa.\nIf you score enough points, a state or territory government agency may nominate you for the visa and we will invite you to apply.\nIf you advised in your EOI that you will be sponsored by an eligible relative we may invite you to apply for a visa in an invitation round.\nCheck that your occupation is on the combined list of eligible skilled occupations for a Skilled Regional (subclass 491) visa.\nYou must have a suitable skills assessment at the time we invite you to apply.\nThe assessment must be undertaken by an assessing authority listed against your occupation in the list of eligible skilled occupations. You might have to pay for the assessment.\nTo be eligible for a visa your skills assessment must have been obtained within the 3 years before the date of invitation. If the assessment was for a shorter period, that period must not have passed.  We can't accept a skills assessment issued more than 3 years before the invitation date.\nIf your skills were assessed on the basis of a qualification you got in Australia when you held a student visa, the qualification must be from studying a course registered on CRICOS.\nFor medical practitioners we accept evidence of registration issued by the Australian Health Practitioner Regulation Agency. You must hold either:\nYou must show that you hold this registration at the time we invite you to apply.\nA suitable skills assessment for barristers and solicitors is evidence of admission to practice as a lawyer in an Australian state or territory.\nThe relevant legal admissions authority must have admitted you to practice at the time we invite you to apply.\nYou must be able to obtain at least 65 points on our points test to be eligible for this visa. If you cannot obtain 65 points we will not invite you to apply.\nIf we invite you to apply for the visa, you must prove the claims you make in your EOI when we assess your application.\nUse the points table to check how many points you might score.\nCheck that you meet all other eligibility criteria for the visa.\nIf we invite you to apply for the visa, you will have to prove the claims you make in your EOI. You will also need to show you meet the other eligibility criteria.\nSee what documents you will need to prove your claims before you submit your EOI in the Gather documents section.\nSubmit your EOI via SkillSelect. You can submit it from within or outside Australia.\nYour EOI is not a visa application. There is no fee for submitting an EOI.\nSelect the Skilled Work Regional (Provisional) visa (subclass 491) Invited pathway.\nYou will receive an email confirming your EOI has been submitted.\nSkillSelect will estimate your points score based on the claims made in your EOI.\nYou must have an estimated score of at least 65 points to be invited to apply for this visa.\nIf you score enough points and there are places allocated for your occupation, we might invite you to apply.\nIf you have expressed interested in being nominated then your EOI will be visible to state and territory government agencies and they may nominate you for the visa.\nIf you are nominated, you will get an invitation to apply for this visa.\nIf a state or territory government agency nominates you, you and all members of your family unit who are also holders of the visa, will need to live, work and study in only certain areas of Australia. See Designated regional areas for more information.\nWe may invite you to apply for the visa if you have stated in your expression of interest that you have an eligible relative willing to sponsor you.\nIf an eligible relative sponsors you, you and all members of your family unit who are also holders of the visa, will need to live, work and study in only certain designated areas of Australia. See Designated regional areas for more information.\nAn EOI is not a visa application. Submitting an EOI does not mean you will get a bridging visa.\nIf your current visa is about to expire, you must apply for another visa to remain in Australia lawfully.\nYou are not eligible for a bridging visa because the EOI is not a visa application. You are only eligible for a bridging visa after you are invited and apply for this visa.\nLet us know through SkillSelect if:\nYou must be able to meet the points score on your invitation letter if we invite you to apply.\nSkillSelect will update your indicative points score when you make changes to your EOI. You can change your EOI at any time before we invite you to apply for a visa.\nWe allocate places for the skilled migration program to meet the Australian Government’s migration planning levels.\nOnce invited, you have 60 calendar days to apply for the visa. We cannot extend this time.\nYou could receive an invitation up to 2 years after submitting an EOI. If we invite you to apply you will receive an email from SkillSelect. Getting an invitation does not mean you will be granted the visa.\nThe invitation will include an indicative points score based on your EOI claims.\nWhen you apply for the visa, you must show that you:\nIf you do not apply for the visa after two invitations, your EOI will be removed from SkillSelect.\nWe will not process your visa application if you are 45 or over at the time of your invitation.\nIf you can't show you meet the points score on your invitation or the other visa criteria, then do not apply for the visa.\nYour EOI will be suspended if an invitation is issued, but you can update information once the 60-day invitation period has passed. If this is your second invitation, you will have to submit another EOI if you still want the visa.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nYou will need to provide documents to support the claims you make in your EOI and show you meet the other visa criteria.\nProvide accurate information. See what happens if you can't prove your identity or do not provide true information.\nProvide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\nAlso provide:\nDocuments that prove a change of name include:\nIf you are or have been married, widowed, divorced or permanently separated, provide proof such as divorce documents, death certificates, separation documents or statutory declarations.\nIf your partner or dependent children are not included in this application, tell us the reason why (for example, they already hold Australian citizenship or are a permanent resident).\nProvide an Australian police certificate if you have spent a total of 12 months or more in Australia in the last 10 years since you turned 16.\nWe only accept complete disclosure National Police Certificates issued by the Australian Federal Police. We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police.\nFor immigration purposes, Australian police certificates are valid for 12 months from the date of issue.\nAlso provide:\nComplete and provide the following forms:\nProvide proof you have at least competent English at time of invitation for this\nWe need to see evidence of your partner's identity and relationship with you.\nProvide:\nFor de facto relationship provide either:\nFor both married and de facto applicants you must provide evidence that you are in a genuine and continuing relationship. Evidence can include but is not limited to:\nProvide proof that your partner has at least functional English.\nIf any of the dependent applicants, who did not pay the second instalment cannot show evidence of functional English, you will need to pay the second instalment of the visa application charge for each of those dependent applicants, when we ask you to.\nFor every dependant 18 years old or younger who is applying with you, provide:\nYou must get consent for a dependent child to migrate to Australia from anyone who:\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\nThey must complete either:\nAlternatively, you can show us:\nInclude:\nYou don't have to prove that your dependant under 18 years of age has functional English.\nNote: If your child is likely to turn 18 while your application is being processed, you will need to provide evidence they are dependent on you. See the section 'Dependants over 18 documents' below for further information. A child who turns 18 while your application is being processed and who is not dependent on you cannot satisfy the criteria for this visa.\nTo include your child who is over 18 in your visa application, they must be:\nIf your child is likely to turn 23 while your application is being processed, you will need to provide evidence they are dependent on you due to disability.\nProvide:\nYou must also provide proof the child is dependent on you.\nNote: A child who turns 23 while your application is being processed and who does not meet these requirements cannot satisfy the criteria for this visa.\nProvide proof that all dependent applicants aged 18 years and older, have at least functional English.\nIf any of the dependent applicants, who did not pay the second instalment cannot show evidence of functional English, you will need to pay the second instalment of the visa application charge for each of those dependent applicants, when we ask you to.\nYou must provide documents that support the claims you made in your EOI. To check the documents you need use the points table. Depending on your claims this could include evidence of your:\nDelegates of the Minister will now accept a suitable skills assessment for an applicant’s nominated skilled occupation which has been obtained within the 60 day invitation period.\nThis change of approach is made as a result of the decision of Thapa v Minister for Immigration, Citizenship, Migrant Services and Multicultural Affairs [2021] FCCA 686 (Thapa). The Minister will administer the Migration Regulations 1994 in accordance with the decision in Thapa, but the Minister reserves the right to make submissions in a Court that Thapa was wrongly decided.\nOne of these certificates issued by the Australian Health Practitioner Regulation Agency:\nYou must be registered at the time we invite you to apply.\nProof of admission to practice as a lawyer in the relevant state or territory. This could be your Australian legal Admission Certificate or Practising Certificate from the relevant legal admission authority for your State/Territory. You must be admitted to practice at the time we invite you to apply.\nYou must provide documents to prove all of the claims you made in your EOI. Use the points table to check the documents you need.\nIf you are being sponsored, provide:\nTo prove that your sponsor is an Australian citizen, permanent resident or an eligible New Zealand citizen, provide:\nTo prove your sponsor is usually resident in a designated area of Australia, documents you can provide include, but are not limited to:\nTo prove the sponsor's relationship with you, documents you can provide include, but are not limited to:\nIf you are being nominated you do not need to provide evidence of this with your application.\nTo nominate someone to:\nUpload your written notification or your forms to ImmiAccount.\nHave all non-English documents translated into English.\nProvide original and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nNote: You do not need to have any documents certified.\nScan or photograph all documents (English and non-English) in colour.\nThe scans and photos must be clear.\nIf a document is more than 1 page, save it all as 1 file.\nWhen you have your invitation you can apply online. You can be in or outside Australia.\nYou have 60 days from the date of your invitation to apply for the visa.\nProvide accurate information. See what happens if you can't prove your identity or do not provide true information.\nEach family member must have their application charge paid and documents attached to their application.\nWe will let you know when we have received your application.\nIf you are granted a bridging visa you will receive notification of your visa grant.\nWe do not give updates on applications within the standard processing time.\nYou can check if we need more information from you in ImmiAccount.\nIf you are in Australia, you don't have to tell us if you want to travel outside Australia while we process your application. This is because you can be outside Australia when we make a decision.\nBut if you leave Australia, make sure your visa allows you to return. To see if you can return on your current visa, check VEVO.\nLearn about visa expiry.\nIf you applied outside Australia, don't arrange travel to Australia, leave your job or sell your home until we advise you in writing that you have been granted the visa.\nIf you didn't have health examinations before you applied, we will let you know if you need them. Check ImmiAccount.\nWe might ask for biometrics (fingerprints and photo). We will let you know if you need to provide them.\nIf you did not attach all documents when you applied, attach them as soon as you can to your ImmiAccount.\nWe might also ask you to provide more information, however we are not obliged to do so and may make a decision on your application without asking for more documents\nIf you are in Australia, make sure you stay lawful by holding a valid visa while we process your application.\nWhen you applied for this visa, you were granted a Bridging visa A (BVA). If your current visa expires before we decide on your application, the BVA will come into effect. You can stay in Australia on the BVA while we process your new visa application.\nDo not ask to have the visa you currently hold cancelled. If your visa is cancelled:\nLearn more about visa expiry.\nIf you need to pay a second instalment, pay it when we send you the invoice.\nYou can add dependent children to your application after you apply but before we decide on your visa.\nUse Form 1436 Adding an additional applicant after lodgement, pay using ImmiAccount, attach the form and supporting documents to your ImmiAccount\nFamily members who apply for the visa must meet our health and character requirements.\nFamily members who are not coming to Australia do have to meet our character requirement and might have to meet our health requirement.\nIf your child is born after you submit your application but before we decide on your visa, you must tell us as soon as possible.\nFind out what to do your child is born after you apply.\nIf we grant you the visa, your family members might be able to apply to join you in Australia later as subsequent entrants.\nYou must tell us as soon as possible if you made a mistake on your application.\nComplete Form 1023 Notification of incorrect answers (168KB PDF) and attach it to your application in ImmiAccount.\nLet us know if you no longer want someone to:\nUpload your written notification or your forms to ImmiAccount.\nFor more information see Who can help you with your application.\nThings you need to let us know about after you have applied include:\nSee how to tell us if your situation changes.\nYou can be in or outside Australia when we decide your visa application but not in immigration clearance. We will let you know our decision in writing.\nIf we grant your visa, we will tell you:\nKeep a copy of the decision.\nIf we refuse your visa, we will tell you:\nWe will not refund the application charge if we refuse your application.\nIf you are outside Australia when the visa is granted, you must enter Australia before a date that we specify on your visa grant letter.\nYou must have:\nAll people arriving in Australia must complete the Incoming Passenger Card. You will be given this card onboard.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nTo see your specific conditions, work and study requirements, use VEVO.\nYou and your family members must comply with all visa conditions and Australian laws. See your conditions in your visa grant letter or VEVO.\nThings you need to let us know about include:\nSee how to tell us if there is a change in your situation.\nThis is a temporary visa.\nTo see when you must leave or apply for a further visa to remain in Australia, refer to your visa grant letter and the information in VEVO.\nYou can't stay in Australia longer by extending this visa. You must apply for a new visa if you want to stay longer.\nSee your options.\nIf you want to stay in Australia permanently and you or your partner have satisfied the work and residence requirements, you might be eligible for Permanent Residence (Skilled Regional) visa (subclass 191).\nYou can travel outside Australia and return as many times as you want while the visa is valid.\nTime spent outside Australia does not extend the visa.\nSee your conditions in VEVO.\nIf an immigration officer processes your clearance at our border, we recommend you tell them:\nIf you do not tell them, you might be granted the subclass 444 visa. Grant of a subclass 444 visa might affect your eligibility for permanent residency through a Permanent Residence (Skilled Regional) visa (subclass 191) and ultimately, your eligibility for permanent residency or  Australian citizenship.\nIf you wish to provide evidence you have a visa and conditions to someone, use VEVO.\nYou can work in any occupation and for any employer, in line with the work and residence conditions attached to your visa.\nYou will need to live and work in an area specified as a designated regional area\nSee your specific conditions in your visa grant letter or VEVO.\nYou are protected by Australian workplace law. See your workplace rights and entitlements.\nMembers of the family unit who did not apply for the visa with you can apply to join you in Australia later as subsequent entrants.\nYou must have a valid passport or other travel document to leave Australia and return.\nIf applicable ensure your visa is still valid and allows you to re-enter Australia. You can check your visa validity in VEVO.\nWe have an automated process that uses facial recognition technology and your ePassport. You could leave the airport faster if you use a SmartGate.\nYou are likely to have some money in a superannuation fund if you worked in Australia and you are:\nSee how to access your super.\nRequest your international movement records to get proof of your travel in and out of Australia."
}