{
    "visaID": "visa1.2",
    "visaType": "visa1",
    "visaName": "eVisitor (subclass 651)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/evisitor-651",
    "content": "\n1. Subclass 651\n2. eVisitor\nUp to 3 months at a time\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nSee all conditions\nApply\n3. With this visa you can\nYou can study or train for up to 3 months in total on this visa. But if your main reason for travelling to Australia is study, a student visa might be more appropriate.\nNote: Applicants who are seeking to train at a childcare centre, study to be a doctor, dentist, nurse or paramedic or enter health care or hospital environments should apply for the Visitor (subclass 600) visa and complete the relevant health checks.\nYou will need a visa if you enter Australia during a cruise.\nIf your cruise is a round trip cruise, the time you spend on the cruise counts as time spent in Australia - that is, we do not consider you have left Australia. A round trip cruise will not reset your stay period on your visa.\nAsk your cruise operator or travel agent if we consider your cruise to be a round trip cruise.\nAs a business visitor, you can:\nYou can't:\nIf you want to do short-term work in Australia that isn't a business visitor activity, consider applying for a temporary work visa.\n4. How long you can stay\nThis is a temporary visa. We grant it for 12 months. You can enter Australia any time your eVisitor is valid and stay for up to 3 months at a time.\nThe eVisitor is granted with multiple entry. You can leave and re-enter Australia as many times as you want while it is valid.\nThe eVisitor starts on the date it is granted.\n5. Stay longer\nYou can't stay in Australia longer by extending this visa. You must apply for another visa.\nIf you want to have a further short stay or stay longer for a holiday you might be eligible for a Visitor visa (subclass 600) Tourist stream (apply in Australia).\nIf you want to stay longer for other reasons, you should be able to apply for a new visa that suits your circumstances.\nExplore your visa options.\n6. Include family\nYou can't include family members in your application. A separate application must be made for each member of your family, including those listed on your passport.\n7. Cost\nThe eVisitor is free.\n8. Apply from\nYou must be outside Australia when you apply.\nDo not arrange to travel to Australia until we let you know, in writing, that we have granted you the subclass 651 visa.\nYou must be outside Australia when we decide on your application.\n9. Processing times\n10. Your obligations\nYou must meet all visa conditions and obey Australian laws.\n11. Health insurance\nWe recommend you take out health insurance to cover any unforeseen medical treatment you might need in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability.\nSee what we consider adequate health insurance.\nLearn more about health insurance for overseas visitors.\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements.\n12. Travel\nYou can travel outside Australia and return as many times as you want while the eVisitor is valid.\n13. Visa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.​​\nYou must be a citizen of and hold a valid passport from one of these countries to be eligible for the eVisitor:\nYou cannot apply with:\nYou must meet our health requirement.\nWhere a visa applicant has previously failed to meet the health requirement, the most appropriate visa for these applicants is a Visitor (subclass 600) visa.\nYou must meet our character requirement.\nIf you have a criminal conviction in any country, apply for a Visitor visa (subclass 600) instead. If you arrive in Australia on an eVisitor with a criminal conviction, you might be refused entry.\nIf you or any family members (including those who don't apply for the visa with you) owe the Australian Government money, you or they must have paid it back or arranged to pay it back.\nYou must only intend to:\nYou must have enough money to:\nWe might not grant this visa if it is not in the best interests of an applicant under 18.\nApply for the eVisitor online.\nDouble check all information is correct before you submit your application. This includes:\nIf your visa is granted with incorrect information, you may experience delays or be refused entry to Australia.\nSee what happens if you can't prove your identity or don't provide true information.\nYou must meet our character requirement.\nIf you have a criminal conviction in any country, apply for a Visitor visa (subclass 600) instead. If you arrive in Australia on an eVisitor with a criminal conviction, you might be refused entry.\nIf you still decide to apply for an eVisitor you must:\nWe may ask you to provide a police certificate.\nHave all non-English documents translated into English.\nProvide original and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nYou do not need to have any documents certified unless we ask you to.\nWe will let you know when we have received your application. If you don't receive an email from us within 12 hours of applying, check your application status in ImmiAccount.\nThere are other things you need to know and might need to do.\nDo not arrange to travel to Australia until we let you know in writing that we have granted you the visa.\nYou must be outside Australia to be granted the eVisitor.\nWe will let you know our decision on your visa application in writing. We will tell you:\nKeep a copy of our decision with you when in Australia.\nIf we refuse your visa we will let you know in writing. We will tell you why we refused and whether you have a right to a review of the decision.\nYou must have:\nEveryone who arrives in Australia must complete an Incoming Passenger Card.\nYou must meet all visa conditions and obey Australian laws. See your conditions in VEVO or your visa grant letter.\nLearn more about visa conditions and how they work.\nThings you need to let us know about include:\nSee how to let us know if there is a change in your situation.\nTravel to Australia:\nYou can study or train for up to 3 months in total on the eVisitor.\nAs a business visitor, you can:\nYou can't:\nYou can't work in Australia on an eVisitor, but you might be able to do volunteer work.\nThe eVisitor is granted with multiple entry. You can leave and re-enter Australia as many times as you want while it is valid.\nSee how long you can stay and when you must leave in VEVO.\nYou can't stay in Australia longer by extending the eVisitor. You must apply for a new visa if you want to stay longer. See your options.\nTo prove you have a visa and show your conditions to someone, use VEVO.\nYou must have a valid passport or other travel document to leave Australia.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nRequest your international movement records to get proof of your travel in and out of Australia."
}