{
    "visaID": "visa7.32",
    "visaType": "visa7",
    "visaName": "Sponsored visa (subclass 886)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/skilled-sponsored-visa-subclass-886",
    "content": "Skilled — Sponsored visa (subclass 886)The Skilled – Sponsored visa (subclass 886) closed to new applications on 1 January 2013.\nYou must be in Australia when this visa is granted. \n\n\n1. Visa applicants\nThis information is for people who have already applied for Skilled – Sponsored visa (subclass 886).\nYou can no longer apply for this visa.\nYour application will be assessed against the requirements detailed below.\nAfter you have lodged your application and documents, we will acknowledge that we have received your information.\nWe will also assign you a case officer who will consider your application and can ask for an interview, ask for more information and make a decision.\nYour application could take longer if you need character or health checks (including chest x-rays), if you need to provide more information, or if your application is incomplete.\nIf you apply for this visa in Australia, you would be able to get a Bridging visa that allows you to stay in the country lawfully while your application is processed. If you are given a Bridging visa A, you can apply for Bridging visa B to travel outside Australia while you wait for a decision.\nWe will contact you when you need to provide health or character documents.\nYou must have no outstanding debts to the Australian Government or have arranged to repay any outstanding debts to the Australian Government before this visa can be granted.\nYou can provide more information to us, at any time until a decision is made on the application. If you want to correct information you provided, use:\nWe could also ask you for more information. You will have to respond by a set date. After that date, we can make a decision about your application using the information that we have.\nIf another person gives us information that could result in you being refused a visa, we will usually give you the opportunity to comment on the information.\nYou might also be interviewed. If you are asked to attend an interview in person, bring your passport or other identification and any requested documents to the interview.\nYou can withdraw the application at any time before we make a decision about it. To do this, send us a letter or email to ask for the withdrawal. Your request must include your full name and date of birth. You should also include your file reference number, client ID, or a Transaction Reference Number.\n​​​All applicants 18 years of age or older, wishing to withdraw, must sign the request for withdrawal.​​​​​​\nYou must tell us if your circumstances change. This includes a new residential address, a new passport, or a pregnancy, birth, divorce, separation, marriage, de facto relationship or death in your family.\nPlease report changes in your circumstances via ImmiAccount. If you are not able to use ImmiAccount, you can use the following forms:\nIf you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.​​\nIf the visa is granted, we will let you know:\nIf the visa is not granted, we will let you know:\n​If information needs to be updated, contact the Adelaide General Skilled Migration (GSM) processing centre.​​\n2. Visa holders\nThis information is for people who have already been granted a Skilled Sponsored visa (subclass 886). It explains your rights and obligations.​\nYou can use  Visa Entitlement Verification Online (VEVO) for free to check your visa details and entitlements.\nThis is a permanent residence visa. It lets you and any member of your family unit who has also been granted this visa:\nYou and your family must comply with all visa conditions and Australian laws.\nIf you are nominated by a state or territory government agency, states and territories might also specify requirements that include:\n3. Sponsors\nThis information is for a person who has applied to sponsor a relative for a Skilled Sponsored visa (subclass 886).\nThis visa has now closed to new applications. ​\nYou can use  Visa Entitlement Verification Online (VEVO) for free to check your visa details and entitlements.\nYour sponsorship lasts for two years after your relative’s visa is granted.\nAs a sponsor you must sign a sponsorship undertaking and agree to help the applicant for two years after their visa is granted.\nThis includes:"
}