{
    "visaID": "visa3.10",
    "visaType": "visa3",
    "visaName": "Contributory Aged Parent visa (subclass 864)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/contributory-aged-parent-864",
    "content": "\n1. (Subclass 864)\n2. Contributory Aged Parent visa\n3. For Applicants\n4. For Sponsors\nPermanently\nAUD48,495\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nFor more information, see Parent visa queue.\n​\nSee all conditions\nIf you are getting help with your visa, before you pay someone, read information on who can help with your visa application.\n5. With this visa you can\nYou can travel to and from Australia as many times as you want for 5 years from the date we grant this visa. This is as long as the travel facility on this visa remains valid.\nIf you want to travel after the initial 5-year travel facility:\nTo see when your travel facility ends, use VEVO.\nYou can apply for the subclass 864 visa as a two-step process by first applying for a Contributory Aged Parent (Temporary) (subclass 884) visa. Applying for the subclass 884 visa and then the subclass 864 visa allows you to spread the cost of the visas over a number of years.\nYou have already met the balance of family test.\n6. How long you can stay\nThis is a permanent visa. It lets you stay in Australia indefinitely.\nFor citizenship purposes, your permanent residency starts on the day we grant the visa.\n7. Include family\nYou can include members of the family unit in your application when you apply.\nYou will be required to include details of all your family members, whether they are migrating or not, in the application form.\nIf you have a partner, include their details in your application even if they are not applying for the visa with you.\nFamily members who apply for the visa must meet our health and character requirements. Family members who are not coming to Australia might also have to meet our health and character requirements.\nFind out what to do if your child is born after you apply.\n8. Cost\nThis visa costs AUD48,495. There is an additional charge for each family member who applies with you.\nYou pay for this visa in 2 parts called instalments.\nPay the first instalment when you apply. Pay the second instalment when we ask you to.\nYou might also have to pay other costs for each applicant for health checks, police certificates and biometrics.\nUse the Visa Pricing Estimator to work out what your visa will cost. The estimator does not take into account the second instalment or other costs.\nSee more about visa fees and charges.\n9. Apply from\nYou must be in Australia, but not in immigration clearance, when you apply for the visa.\nAny family members who apply for the visa with you must also be in Australia, but not in immigration clearance, when you apply.\n10. Processing times\nThe demand for these visas is greater than the number of places available each year. As a result, processing times for these applications can be lengthy.\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application might take longer to process if:\nWe cannot process your application if you do not pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\nThe Reports on Migration Programs have further information on Migration Program outcomes against planning for each migration program year.\nApplications for this visa are subject to capping and queueing.\nLearn more about the Parent visa queue and processing priorities.\nWe assess applications for this visa in 2 stages:\nDo not arrange to stay permanently in Australia until your visa is granted. We will let you know in writing if we grant you the visa.\nLearn more about the Parent visa queue and processing priorities.\nOther Parent visas available include the:\nYou can view all visa options on our Visa list page.\n11. Your obligations\nYou and your family members must obey all Australian laws.\n12. Visa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nYou cannot apply for this visa if you have already applied for or hold a Sponsored Parent (Temporary) (subclass 870) visa.\nYou must be sponsored by an eligible sponsor.\nUsually you would be sponsored by an eligible child. If your child is under 18, you can be sponsored by an eligible relative or community organisation.\nWe must approve the sponsorship.\nIf you hold a Temporary Contributory Aged Parent (subclass 884) visa, you might still be eligible for this visa if your sponsor dies.\nSee what to do if your situation changes.\nYou must be old enough to receive the age pension in Australia.\nYou and any family members who apply for the visa with you must meet our health requirement.\nWe might also ask that other non-migrating family members meet the requirement.\nYou and any family members who apply for the visa with you must meet our character requirement.\nWe might also ask that other non-migrating family members meet the requirement.\n​If you are 18 years of age or older, you must:\nYou must meet the balance-of-family test. You meet the balance of family test if:\nSee examples of how the balance-of-family test is applied.\nIf you hold a Contributory Aged Parent (subclass 884) (Temporary) visa, you have already met the balance of family test.\nYou must be able to obtain an assurance of support.\nAn assurance of support assures us that you will not have to rely on government assistance after you enter Australia on this visa. The assurance is for you and any family members who come to Australia with you on this visa.\nWe will let you know when you need to provide the assurance of support.\nLearn more about assurances of support.\nIf you or any family members owe the Australian Government money, you or they must have paid it back or have an approved arrangement in place to pay it back.\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused, see Limitations on applications in Australia.\nIf applying for a visa from outside Australia, see Can I go to Australia.\nIf you want immigration assistance, see Who can help with your visa application.\nWe will not grant this visa if it is not in the best interests of an applicant under 18.\nCheck your passport. If you need help with your application, get someone to act on your behalf.\nYou and anyone who applies for the visa with you must have valid passports before we grant the visa. We will only grant the visa if you have a valid passport.\nHowever, we will only grant the visa if you have a valid passport.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nIf you applied for a different parent visa, but we have not made a decision about that visa, you must withdraw that application at the same time that you apply for this visa.\nIf you applied for a Contributory Parent (Temporary) visa (subclass 173) or a Contributory Aged Parent (Temporary) visa (subclass 884) you need to complete:\nIf you applied for a Parent visa (subclass 103) or Aged Parent visa (subclass 804), you need to complete:\nGather all your documents, including for any partner or dependents who might be applying with you. You will also need your sponsor documents.\nProvide accurate information. See what happens if you cannot prove your identity or do not provide true information.\nYou won't need to provide us with some of the documents we usually ask for if:\nYou will still need to provide documents:\nChanges in your situation we need evidence of include:\nWe need proof of your identity. If you cannot prove your identity:\nProvide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\nAlso provide:\nDocuments that prove a change of name include:\nYour application must be sponsored by an eligible sponsor.\nYour sponsor must complete Form 40 Sponsorship for migration to Australia.\nShow us that you meet the balance-of-family test by giving us:\nIf you hold a Contributory Aged Parent (subclass 884) (Temporary) visa, you have already met the balance of family test.\nWe might ask for character documents, including police certificates. Don’t arrange a police check until we ask you to.\nLearn more about police certificates.\nProvide us with an assurance of support when we ask for it.\nTo nominate someone to:\nSend written notification or your forms with your paper application.\nFor every dependant under 18 years old who is applying with you, provide:\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\nThey must complete either:\nAlternatively, you can show us:\nInclude:\nTo be included in your visa application as a dependent child, your child must be:\nFor every dependant 18 years old or older who is applying with you, provide:\nIf your child is likely to turn 23 while your application is being processed, you will need to provide evidence they are dependent on you due to disability.\nProvide:\nYou need to prove that this person is dependent on you. Provide:\nYou must also prove this person has been financially dependent on you for at least 12 months before you apply. You could provide:\nProvide:\nProvide either:\nDocuments that prove your de facto relationship include:\nProvide 4 recent photos (45mm x 35mm) of anyone included in the application.\nPhotographs must be:\nYou can wear untinted prescription glasses. If you wear a head covering for religious reasons, you can show only your face.\nHave all non-English documents translated into English.\nProvide original copies and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nDo not certify police certificates. You need to send us the originals.\nHave all other documents certified. This includes:\nKeep a copy of your completed application.\nSend us:\nYou must apply for this visa on paper. You must be in Australia, but not in immigration clearance, when the application is submitted.\nLearn more about where you can be when we make a decision on your application by reading the “Visa Outcome” section on this web page. (Below)\nYou cannot apply for this visa if you have already applied for or hold a Sponsored Parent (Temporary) (subclass 870) visa.\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nIf your subclass 884 visa is current or has ended within the last 28 days, complete Form 47PT Application for migration to Australia by a Contributory Parent (Temporary) or Contributory Aged Parent (Temporary) visa holder.\nIf you do not hold, (or have never held) a subclass 884 visa, you must complete Form 47PA Application for a parent to migrate to Australia\nYour sponsor will need to complete Form 40 Sponsorship for migration to Australia\nWhether migrating or not, each member of the family unit aged 18 years or over must also complete Form 47A Details of child or other dependent family member aged 18 years or over.\nYou must complete all forms in English.\nYou must pay the first instalment when you apply. For payment options see how to pay.\nYou can't apply for this visa in person. Send the application by post or courier to the address on the form. Include all required documents, forms and evidence of visa application charge payment with your application.\nDo not send original documents with your application, only send certified copies. Keep a copy of your completed application for your own records, including any supporting documents.\nIf any of the above steps are incomplete, your application may be invalid. We do not process invalid applications. We will notify you if this is the case, and if requested, return your application.\nIf you applied for a different parent visa, but we have not made a decision about that visa, you must withdraw that application at the same time that you apply for this visa.\nYou will need to complete either:\nWe will let you know when we have received your application and documents. There are other things you need to know and might have to do.\nWe can't provide updates on your application's progress within normal processing times. We will let you know if you need to provide anything further.\nLearn more about the Parent visa queue and processing priorities.\nTell us if you want to travel outside Australia while we process your application. We need to know because you must be in Australia when we make our decision.\nIf you leave Australia, make sure you have a valid visa to return.\nLearn about visa expiry.\nWe will let you know if you need health examinations\nWe will let you know when you need to provide character documents.\nWhen we do, provide an Australian police certificate if you have spent a total of 12 months or more in Australia in the last 10 years since you turned 16. We only accept complete disclosure National Police Certificates issued by the Australian Federal Police. We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police.\nLearn more about police certificates.\nAlso provide:\nComplete and provide Form 80 Personal particulars for assessment including character assessment\nWe might ask for biometrics (fingerprints and photo). We will let you know if you need to provide them.\nIf you did not send us all the documents when you applied, send them to the Parent Visa Centre as soon as you can.\nWe might also ask you to provide more information.\nMake sure you stay lawful by holding a valid visa while we process your application.\nWhen you apply for this visa in Australia, you are likely to be granted a bridging visa. If your current visa expires before we make a decision on your application, the bridging visa will start. You can stay in Australia on the bridging visa while we process your new visa application.\nLearn more about visa expiry.\nPay the second instalment when we tell you to. We will send you an invoice for the instalment after you have met all other requirements for the visa.\nYou must pay the instalment or we can't grant the visa.\nYou might be able to add family members to your application before we make a decision.\nComplete and send us Form 1436 Adding an additional applicant after lodgement.\nYou will also need to provide evidence of your relationship and the family member’s passport.\nAny family members you add to your application after you apply must be in Australia when you add them.\nFind out what to do if your child is born after you apply.\nLet us know as soon as you can if you make a mistake on your application.\nComplete Form 1023 Notification of incorrect answers.\nLet us know if you no longer want someone to:\nSend written notification or your forms to the office your submitted your application.\nFor more information see Who can help you with your application.\nThings you need to let us know about after you have applied include:\nSee what to do if your situation changes.\nYou must be in Australia, but not in immigration clearance, when we make a decision on your application.\nWe will let you know our decision in writing.\nIf we grant you the visa, we will let you know:\nKeep a copy of our decision.\nIf we refuse your visa we will let you know:\nWe will not refund the application fee if we refuse your application.\nYou and your family members must obey all Australian laws.\nSee what to do if your situation changes.\nSee your visa conditions and work and study entitlements in VEVO.\nThis is a permanent visa. It lets you stay in Australia indefinitely.\nAs a newly arrived resident, you might have to wait to access certain Australian Government payments and benefits. Learn more about newly arrived residents waiting periods from Services Australia.\nYou can travel to and from Australia as many times as you want for 5 years from the date we grant this visa. This is as long as the travel facility on this visa remains valid.\nIf you want to travel after the initial 5-year travel facility:\nTo see when your travel facility ends, use VEVO.\nTo prove you have a visa and show your conditions to someone, use VEVO.\nYou can request your international movement records by completing Form 1359 - Request for international movement records.\nYou are protected by Australian workplace law. See your workplace rights and entitlements.\nAfter a certain time, you might be eligible for Australian citizenship.  Find out more about becoming a citizen.\nFor citizenship purposes, your permanent residence starts on the day we grant the visa.\nYou must have a valid passport or other travel document to leave Australia.\nSee what to do if your visa has expired or is about to expire.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nTo prove you have been to Australia, request your international movement records by completing Form 1359 Request for international movement records."
}