{
    "visaID": "visa1.4.4",
    "visaType": "visa1.4",
    "visaName": "Approved Destination Status stream",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/visitor-600/approved-destination-stream",
    "content": "\n1. Visitor visa (subclass 600)\n2. Approved Destination Status stream\nFor the period or until the date we specify in your grant letter\nAUD195.00\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nVisa processing times are based on the age of applications finalised in a given period. Many applications finalised recently had been on-hand for some months while borders were closed.\nFor more information see visa processing times.\nSee all conditions\n3. With this visa you can\n4. How long you can stay\nThis is a temporary visa. If we grant you a visa we will let you know how long you can stay in your visa grant letter. We consider the length of your tour when we determine your stay period.\nWe grant the visa with either:\n5. Include family\nYou can't include family members in your application. A separate application must be made for each member of your family, including those listed on your passport.\nFind out what to do if your child is born after you apply.\n6. Cost\nThe visa costs AUD195.00.\nYou might also have to pay other costs for health checks, police certificates and biometrics.\nUse the Visa Pricing Estimator to work out what your visa will cost. The estimator does not take into account the other costs.\n7. Apply from\nYou must be in the People's Republic of China when your visa application is lodged and when we make a decision on your application.\n8. Processing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n9. Your obligations\nYou must meet all visa conditions and obey Australian laws.\n10. Health insurance\nWe recommend you take out health insurance to cover any unforeseen medical treatment you might need in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability.\nSee what we consider adequate health insurance.\nLearn more about health insurance for overseas visitors.\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements.\n11. Visa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.​​\nYou must meet our health requirement.\nYou must meet our character requirement.\nIf you or any family members (including those who don't apply for the visa with you) owe the Australian government money, you or they must have paid it back or arranged to pay it back.\nYou must only intend to:\nWe might not grant this visa if it is not in the best interests of an applicant under 18.\nYou might need to have health examinations. You can complete them before you apply or you can wait until we tell you to have them.\nFind out the examinations you need  and how to arrange them if you want to have them before you apply.\nProvide accurate information.\nSee what happens if you can't prove your identity or don't provide true information.\nProvide the pages of your current People's Republic of China passport showing your photo, personal details, and passport issue and expiry dates.\nAlso provide:\nDocuments that prove a change of name include:\nProvide:\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\nThey must complete either:\nAlternatively, you can show us:\nInclude:\nHave all non-English documents translated into English.\nProvide original and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nYou do not need to have any documents certified unless we ask you to.\nYou need to contact a registered Approved Destination Status scheme travel agent to ask for them to apply for this visa on your behalf. Your travel agent must be registered with the Approved Destination Status scheme.\nSee what happens if you can't prove your identity or don't provide true information.\nWe will let you know when we have received your application and documents.\nThere are other things you need to know and might need to do.\nDon't make arrangements to travel to Australia until you know you have been granted the visa.\nIf you did not have health examinations before you applied, we will let you know if you need them.\nIf you did not send us all documents when you applied, send them as soon as you can.\nWe might also ask you to provide more information.\nLet your travel agent know as soon as you can if you made a mistake on your application.\nTell your travel agent if things change after you lodge your application but before we have made a decision.\nThings you need to let them know about include:\nWe will let your travel agent know our decision about your visa application. We will send them a visa grant letter with:\nYou might like to get a copy of the letter to keep with you when in Australia.\nIf we refuse your visa we will let you know by email. We will tell you why we refused and whether you have a right to a review of the decision.\nWe will not refund the application fee if we refuse your application.\nCheck your travel documents\nYou must have:\nComplete an Incoming Passenger Card\nEveryone who arrives in Australia must complete an Incoming Passenger Card.\nUsing the SmartGate\nA SmartGate is an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use the SmartGate.\nYou must stay with your tour group.\nYou must meet all visa conditions and obey Australian laws. See your conditions in VEVO or your visa grant letter.\nLearn more about visa conditions and how they work.\nWith this visa you:\nTo see your specific conditions, work and study entitlements use VEVO.\nStay longer\nYou can't stay in Australia longer by extending this visa. You must leave Australia with your tour group at the time listed in your tour itinerary.\nCheck your travel documents\nYou must have a valid passport or other travel document to leave Australia.\nDepartures SmartGate\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nInternational Movement Record\nRequest your international movement records to get proof of your travel in and out of Australia."
}