{
    "visaID": "visa6.8",
    "visaType": "visa6",
    "visaName": "Medical Treatment visa (subclass 602)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/medical-treatment-602",
    "content": "\n1. Subclass 602\n2. Medical Treatment visa\nTemporarily\nFree if you apply outside Australia.\nAUD370.00 if you apply in Australia. If you represent a foreign government, the visa is free.\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nSee all conditions\nIf you are getting help with your visa, before you pay someone, read information on Who can help with your visa application.\n3. With this visa you can\nYou can't work except under limited circumstances.\n4. How long you can stay\nThis is a temporary visa.\nWe determine the length of your stay on a case-by-case basis.\nThings we consider when determining your stay period include your treatment plan.\n5. Stay longer\nYou can't extend this visa to stay longer in Australia. If you need more time for your medical treatment or for another reason, you will need to apply for another visa.\nExplore your visa options to stay longer in Australia.\n6. Support persons\nIf you are applying to have medical treatment or donate an organ, a support person may apply for this visa.\nA support person can be a member of your family or another person such as a friend.\nEach support person must make a separate application unless they are included in your passport.\nWe can process your applications together.\nWe must grant your visa first before granting a support person a visa.\n7. Cost\nThe visa is free if you apply outside Australia.\nThe visa costs AUD370.00 if you apply in Australia. If you represent a foreign government, the visa is free.\nYou might have to pay for health checks, police certificates and biometrics.\nTo work out what your visa will cost, use the Visa Pricing Estimator. The estimator does not take into account the other costs.\n8. Apply from\nYou can be in or outside Australia when you apply for the visa.\nIf we grant you the visa, at the time of grant you must be:\n9. Processing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application can take longer to process if:\nWe can't process your application if you do not pay the correct visa application charge. We will notify you if this is the case.\n10. Your obligations\nYou must meet all visa conditions and obey Australian laws.\nLearn more about conditions for this visa.\n11. Health insurance\nWe recommend you obtain health insurance to cover any unforeseen medical treatment you might need in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability.\nSee what we consider adequate health insurance.\nLearn more about health insurance for overseas visitors.\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements.\n12. Travel\nThe visa is granted with single or multiple entry.\nYou must arrive in Australia on or before the expiry date on your visa.\nMultiple entry:\nSingle entry:\nIf you need to travel to Australia again, you must apply for another visa.\nCheck if you have multiple or single entry in Visa Entitlement Verification Online (VEVO) or your visa grant letter.\n13. Visa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nYou must not have a medical condition that could be a threat to public health or endanger the Australian community.\nIf you are in Australia, you must not hold a Temporary Work (International Relations) visa (subclass 403) that was granted in the Domestic Worker (Diplomatic or Consular) stream. This also must not have been the last substantive visa you held.\nThe exception to this is applicants who are 50 years or older and are assessed as unfit to depart Australia after being refused a permanent visa on health grounds.\nYou might not be eligible for this visa if you do not have, or not have access to, adequate means to support yourself while you are in Australia.\nThis includes paying for:\nYou can be of any age to apply for this visa.\nYou must meet our health requirement.\nYou must meet our character requirement.\nYou must only intend to:\nAn intention to stay temporarily in Australia does not apply if you:\nIn most cases if you owe the Australian Government money, you must have:\nIn most circumstances, you must pre-arrange payment of your medical costs. This is to show that it will not cost money to an Australian government or public authority. You can show this with written proof from a public or private hospital. This must confirm that it has approved your treatment and arrangements to pay all the costs.\nYou need a valid passport or other travel document. If you need a new passport, plan to get it before you apply for this visa.\nYou can complete your health examinations before you apply or you can wait until we tell you to have them. Find out the examinations you need and how to arrange them.\nThis is in addition to details you must provide about the medical treatment you are seeking in Australia.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance, they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nInclude as much information as possible to support your application. This includes English translations of your documents.\nWe may decide your application without requesting further information from you.\nFollow these instructions to ensure you submit a complete visa application.\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nIf you are applying for this visa to receive medical treatment or donate an organ, provide a letter from your treating doctor in Australia outlining:\nYou will also need to complete Form 1507 Evidence of intended medical treatment (includes consultation) (191KB PDF) if:\nProvide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\nAlso provide:\nIf you are under the age of 18, you should provide a copy of your birth certificate showing the names of both parents. If you can’t provide a birth certificate, provide identification pages from one of the following:\nIf somebody other than your biological parents has legal guardianship over you (for example, adoptive parents or a court-appointed guardian), you must provide proof of their legal guardianship.\nProvide adoption papers or parental court orders, if applicable.\nAnyone with a legal right to decide where you live, and who is not travelling in Australia with you, must complete either:\nInclude a document with the signature and photo of the person completing the form or declaration. This could be a passport or driver’s licence.\nIn addition to consent information, if you’re not staying with a relative or legal guardian, provide Form 1257 - Undertaking declaration (211KB PDF). The person you’re staying with must sign the form.\nWe need proof that you have access to enough money to:\nProvide:\nIf you are going to be treated in a public hospital, the letter about payment arrangements must:\nWe may ask you to provide a police certificate.\nTo nominate someone to:\nUpload your written notification or your forms to ImmiAccount.\nHave all non-English documents translated into English.\nProvide original and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nNote: You do not need to have any documents certified unless we ask you to.\nScan or photograph all documents (English and non-English) in colour.\nThe scans and photos must be clear and legible.\nIf a document is more than one page, save it all as one file.\nAttach a document only once, even if you are using it to show more than one thing.\nLearn more about attaching documents.\nYou can be in or outside Australia when you apply.\nEach applicant must submit a separate application, unless they share a passport.\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nIf you are already in Australia when you apply, pay the application fee.\nWe will confirm via your ImmiAccount when we receive your application.\nThere are other things you need to know and might need to do.\nIf you applied in Australia, you must tell us if you want to travel outside Australia while we process your application.\nYou might be eligible for a Bridging visa B, if you:\nA Bridging visa B allows you to return to Australia if you leave.\nIf you did not have health examinations before you applied for the visa, have them if we tell you to.\nWe will tell you if you need to provide biometrics\nIf you did not send us all your documents when you applied, attach them to your application in ImmiAccount as soon as you can.\nWe may decide on your application without requesting further information from you.\nIf you are in Australia, you must stay lawful by holding a valid visa while we process your application.\nDon't let your current visa expire before you apply. If you do:\nLearn more about visa expiry.\nFind out what to do if your child is born after you apply.\nTell us if you made a mistake on your submitted application as soon as possible.\nTo tell us about a mistake on your visa application:\nLet us know if you no longer want someone to:\nUpload your written notification or your forms to ImmiAccount.\nFor more information see Who can help you with your application.\nTell us if things change after you submit your application but before we have made a decision.\nThings you need to tell us include:\nSee how to tell us if your situation changes.\nWe will let you know our decision in writing.\nIf you applied in Australia, you must be in Australia when we grant the visa.\nIf you applied outside Australia, you must be outside Australia when we grant the visa.\nIf we grant your visa, we will tell you:\nKeep a copy of the decision with you when in Australia.\nIf we refuse your visa, we will tell you:\nWe will not refund the application charge if we refuse your application.\nYou must have:\nEveryone who arrives in Australia must complete an Incoming Passenger Card.\nA SmartGate is an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nThis visa lets you:\nTo see your specific conditions and work entitlements use VEVO.\nYou must meet all visa conditions and obey all Australian laws.\nSee your conditions in VEVO or your visa grant letter.\nLearn more about visa conditions and how they work.\nThings you need to tell us include:\nSee how to tell us if there is a change in your situation.\nCheck whether you have been given single or multiple entries in VEVO.\nSingle entry:\nYou must arrive in Australia on or before the expiry date on your visa.\nMultiple entries:\nTime spent outside Australia does not extend the visa.\nSee your conditions in VEVO.\nSee when you must leave in VEVO.\nYou can't extend this visa to stay longer in Australia. You must apply for a new visa if you want to stay longer.\nSee your options.\nTo prove you have a visa and show your conditions to someone, use VEVO.\nYou can't work in Australia under this visa, except under limited circumstances.\nTo see your conditions for work, use VEVO.\nYou must have a valid passport or other travel document to leave Australia.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nRequest your international movement records to get proof of your travel in and out of Australia."
}