{
    "visaID": "visa6.6",
    "visaType": "visa6",
    "visaName": "Former Resident visa (subclass 151)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/former-resident-151",
    "content": "\n1. (Subclass 151)\n2. Former Resident visa\nPermanently\nFrom AUD4,665.00\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nSee all conditions\nIf you are getting help with your visa, before you pay someone, read information on Who can help with your visa application.\n3. With this visa you can\n4. How long you can stay\nThis permanent visa allows you to stay in Australia indefinitely.\nYou become a permanent resident on the day you get the visa.\nFor citizenship purposes, your permanent residency starts on the day:\n5. Include family\nYou can include members of the family unit in your application when you apply. You can also add members of the family unit to your application at any time before we decide on your application.\nFamily members who apply for the visa must meet our health and character requirements.\nIf you apply for this visa from outside Australia, family members who are not coming to Australia might also have to meet our health and character requirements.\nFind out what to do if your child is born after you apply.\n6. Cost\nThe visa costs AUD4,665.00 for the main applicant.\nThere is also a fee for each family member who applies for the visa with you.\nYou might also have to pay other costs for health checks, police certificates and biometrics.\nUse the Visa Pricing Estimator to work out what your visa will cost. The estimator does not take into account the other costs\n7. Apply from\nYou can be in or outside Australia when you apply for the visa but not in immigration clearance.\nIf you apply in Australia, we can't grant you the visa if you are outside Australia when we make our decision.\nIf you apply outside Australia, we can't grant you the visa if you are in Australia when we make our decision.\n8. Processing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application might take longer to process if:\nWe cannot process your application if you do not pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\n9. Your obligations\nYou and your family members must obey all Australian laws.\n10. Travel\nYou can travel to and from Australia as many times as you want for 5 years from the date we grant this visa.\nIf you want to travel after the initial 5-year travel validity expires:\nNote:\nFor more information on RRV, see: Resident Return visa (RRV). To see when your travel period ends, use VEVO.\n11. Visa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nYou must be able to show us that you meet all these criteria:\nYou must be able to show us that you meet one of these conditions:\nTo meet the long residence requirement, you must be younger than 45 at the time of application.\nThere is no age requirement for the defence services requirement.\nYou and any family members who apply for the visa with you must meet our health requirement.\nIf you apply for this visa from outside Australia, family members who are not coming to Australia might also have to meet our health requirement.\nYou and any family members aged 16 years or over must meet our character requirement.\nIf you apply for this visa from outside Australia, family members who are not coming to Australia might also have to meet our character requirement.\nYou might be asked to provide an Assurance of support\nIf you or any family members owe the Australian Government money you must have paid it back or have a formal arrangement to pay it back\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused, see Limitations on applications in Australia (129KB PDF).\nIf applying for a visa from outside Australia, see Can I go to Australia.\nIf you want immigration assistance, see Who can help with your visa application.\nYou might need to get health examinations. If you need help with your application, get someone to act on your behalf.\nIf you need a new passport, plan to get it before you apply for this visa.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nGather documents to prove your identity and show you meet our requirements.\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nEvidence of your ties with Australia and that you have kept these ties while you have been living overseas, such as:\nProvide the pages of your current passport showing your:\nAlso provide:\nDocuments that prove a change of name include:\nDo not arrange for police certificates until we ask you to. Learn more about police certificates.\nIf anyone included in the application has served in the armed forces of any country, provide certified copies of their military service record or discharge papers.\nProvide:\nProvide either:\nDocuments that prove your de facto relationship include:\nFor every dependant under 18 years old who is applying with you, provide:\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\nThey must complete either:\nAlternatively, you can show us:\nInclude a document with the signature and photo of the person who completed the form or declaration, such as a:\nFor every dependant aged 18 years or older who is applying with you, provide:\nYou need to prove that this person is dependent on you. Provide:\nYou must also prove this person has been financially dependent on you for at least 12 months before you apply. You could provide:\nUsually, your child or stepchild must be under 23 years old to be included in your application.\n\nHowever, a dependant older than 23 years can be included if they are unable to earn a living to support themselves due to physical or cognitive limitations. In this case, provide information about the physical or cognitive limitation.\nHide\nEvidence of service with the Australian Defence Forces before 1981 (if applicable).\nIdentity documents\nProvide the pages of your current passport showing your:\nAlso provide:\nDocuments that prove a change of name include:\nTo nominate someone to:\nSend written notification or your forms with your paper application.\nHave all non-English documents translated into English.\nProvide original copies and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters .\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nWhen you apply on paper you must provide certified copies  of your documents.\nThis includes:\nIf you are emailing us documents after you apply, the documents do not need to be certified. Use a good quality photograph or scan.\nKeep a full copy of your completed application including all supporting documents. Keep a full copy of your completed application including all supporting documents.\nSend us:\nYou must apply on paper. You can't lodge this application in person or online. You can be in or outside Australia when you apply.\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nYou can be in or outside Australia when you apply for the visa, but not in immigration clearance.\nAll applicants apply together on the one Form 47SV Application for special migration to Australia (581KB PDF) and lodge it with our Sydney office.\nPay the application charge before you send your application. Pay online in ImmiAccount.\nYou can't lodge this application in person or online.\nWe will not process your application until you pay the correct charge. We will let you know if you have paid an incorrect charge.\nMail the form and supporting documents to:\nSubclass 151 Visa Application\nDepartment of Home Affairs\nGPO Box 9984\nSydney NSW 2001\nAUSTRALIA\nIf any of the above steps are incomplete, your application may be invalid. We do not process invalid applications. We will notify you if this is the case, and if requested, return your application.\nDo not send original documents with your application, only send certified copies. Keep a copy of your completed application for your own records, including any supporting documents.\nWe will let you know when we have received your application and documents.\nSee what you can and must do after you apply.\nIf you applied in Australia, tell us if you want to travel outside Australia while we process your application. We need to know because we can't grant you the visa if you are outside of Australia.\nIf you leave Australia, make sure you have a valid visa to return.\nLearn about visa expiry.\nIf you applied outside Australia, do not arrange to travel to Australia until we let you know, in writing, that we have granted you the visa. We can't grant you the visa if you are in Australia.\nWe will let you know when you need health examinations.\nWe might ask for biometrics (fingerprints and photo). We will let you know if you need to provide them.\nSend the documents to the office where you sent the application.\nWe might also ask you to provide more information.\nIf you are in Australia, make sure you stay lawful by holding a valid visa while we process your application.\nIf you held a substantive visa when you applied for this visa, you were granted a Bridging visa A (BVA). If your current visa expires before we decide on your application, the BVA will start. You can stay in Australia on the BVA while we process your new visa application.\nDo not cancel your current visa. If you do, you will:\nLearn more about visa expiry.\nYou can add members of the family unit to your application before we decide on your visa.\nComplete Form 1436 Adding an additional applicant after lodgement (481KB PDF), and\nFind out what to do if your child is born after you apply.\nLet us know as soon as you can if you made a mistake on your application.\nComplete Form 1023 Notification of incorrect answers. (168KB PDF)\nLet us know if you no longer want someone to:\nSend written notification or your forms to the office your submitted your application.\nFor more information see Who can help you with your application.\nThings you need to let us know about after you have applied include:\nSee how to tell us if your situation changes.\nIf you apply in Australia, we can't grant the visa if you are outside Australia when we make our decision.\nIf you apply outside Australia, we can't grant the visa if you are in Australia when we make our decision.\nWe will let you know our decision in writing.\nIf we grant your visa, we will tell you:\nKeep a copy of the decision with you when in Australia.\nIf we refuse your visa, we will tell you:\nWe will not refund the application charge if we refuse your application.\nYou must have:\nAll people arriving Australia must complete the Incoming Passenger Card.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nTo see your specific conditions and work entitlements use Visa Entitlement Verification Online (VEVO).\nYou must obey all Australian laws.\nYou can travel to and from Australia as many times as you want for 5 years from the date we grant this visa.\nIf you want to travel after the initial 5-year travel validity expires:\nNote:\nFor more information on RRV, see: Resident Return visa (RRV). To see when your travel period ends, use VEVO.\nIf an immigration officer processes your clearance at our border, we recommend you tell them:\nIf you do not tell them, you might be granted the subclass 444 visa. The subclass 444 visa is not a permanent visa. Grant of a subclass 444 visa might affect your eligibility for Resident Return visa and Australian citizenship.\nTo prove you have a visa and show your conditions to someone, use VEVO\nRequest your international movement records to get proof of your travel in and out of Australia.\nTo see your conditions for work, use VEVO.\nYou have rights under Australian workplace law.\nThe  Fair Work Ombudsman's Pay and Conditions Tool  (PACT) has information on pay rates, shift calculations, leave arrangements and notice and redundancy entitlements.\nAs an Australian permanent resident, you might be able to sponsor eligible family members to come to Australia.\nTo find a visa for your family member, explore visa options.\nAfter a certain time, you might be eligible for Australian citizenship. Find out more about becoming a citizen.\nFor citizenship purposes, your permanent residency starts on the day:\nYour visa is linked to your passport. You need to tell us if you get a new passport.\nSee how to tell us if your situation changes."
}