{
    "visaID": "visa4.13.2",
    "visaType": "visa4.13",
    "visaName": "Extended stay pathway",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/skilled-regional-provisional-489/extended-stay-pathway",
    "content": "\n1. Skilled Regional (Provisional) visa (subclass 489)\n2. Extended stay pathway\n4 years from the date your current skilled visa was granted\nFrom AUD425.00\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nSee all conditions\nIf you are getting help with your visa, before you pay someone, read information on Who can help with your visa application.\n3. With this visa, you can\n4. Specified region\nYou don't need to be nominated again for the Extended stay pathway visa. If a state or territory government agency nominated you for your current skilled visa, you will need to live, work and study in regional and low-population growth metropolitan areas.\nYou don't need to be sponsored again for the Extended stay pathway visa. If a relative sponsored you for your current skilled visa, you will need to live, work and study only in a specified area of Australia.\n5. How long you can stay\nThis is a temporary visa. You can stay in Australia for a total of 4 years from the date we granted your subclass 475, 487, 495 or 496 visa.\nYou can check your current visa status in VEVO.\n6. Stay longer\nYou can't stay in Australia longer by extending this visa. Explore your visa options.\nIf you want to stay in Australia permanently, you might be eligible for a Skilled Regional visa (subclass 887).\n7. Include family\nYou can include members of the family unit in your application when you apply. You can:\nFamily members who apply for the visa must meet our health and character requirements.\nFamily members not accompanying you to Australia might also need to meet our health and character requirements.\nIf your partner or dependent children are not included in this application, tell us the reason why (for example, they already hold Australian citizenship or are a permanent resident).\n8. Cost\nFrom AUD425.00 for the main applicant.\nThere is also a charge for each family member who applies for the visa with you.\nTo work out what your visa will cost use the Visa Pricing Estimator. The estimator does not take into account the second instalment or other costs.\nYou might have to pay an extra charge for any applicant 18 years old or older who has less than functional English. This charge is called the second instalment. Pay it only when we ask you to. We ask for the charge only if we are going to grant the visa.\nThe second instalment charge for family members is AUD4,890.00.\nThe Visa Pricing Estimator does not include the second instalment or other costs. You might also have to pay other costs for health checks, police certificates and biometrics.\n9. Apply from\nYou can be in or outside Australia, but not in immigration clearance when you apply for the visa and when we decide on your application.\nIf you apply in Australia, you must hold a substantive visa or a subclass 010 Bridging A visa, a subclass 020 Bridging B visa or a subclass 030 Bridging C visa, otherwise your application will not be valid.\n10. Processing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nWe assess applications on a case-by-case basis, and actual processing times can vary due to individual circumstances including:\n11. Your obligations\nYou and your family members comply with all visa conditions and obey Australian laws.\nLearn more about conditions for this visa.\n12. Health insurance\nWe recommend you take out health insurance to cover any unforeseen medical treatment you might need in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability.\nSee what we consider adequate health insurance.\nLearn more about health insurance for overseas visitors.\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements.\n13. Travel\nYou can travel out of Australia and return as many times as you want while the visa is valid.\nThe time you spend outside Australia does not extend the visa.\n14. Visa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nThere is no age limit for this visa.\nAt the time you apply for this visa you must hold 1 of the following provisional visas and have complied with all conditions of that visa for at least 2 years:\nYou must have never held more than 1 of these visas.\nYou and any family members who apply for the visa with you must meet our health requirement.\nAs you undertook a health examination for your eligible visa, in most circumstances you will not need to undertake another one. We will let you know if you or any family members need to have a health examination.\nYou and family members aged 16 years and over who apply for the visa with you must meet our character requirement. Family members not accompanying you to Australia must also meet the character requirement.\nIf you or any family members (including those who do not apply for the visa with you) owe the Australian Government money, you or they must have paid it back or arranged to pay it back.\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused see Limitations on applications in Australia.\nIf applying for a visa from outside Australia see Can I go to Australia.\nIf you want immigration assistance, see Who can help with your visa application.\nBefore you apply you need to gather and prepare your documents.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nYou will need to provide identity, character and other documents that prove you have complied with your visa conditions in Australia. You will also need to provide documents for your partner and any dependent children.\nProvide accurate information. See what happens if you can't prove your identity or do not provide true information.\nProvide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\nAlso provide:\nDocuments that prove a change of name include:\nIf you are or have been married, widowed, divorced or permanently separated, provide proof such as divorce documents, death certificates, separation documents or statutory declarations.\nIf your partner or dependent children are not included in this application, tell us the reason why (for example, they already hold Australian citizenship or are a permanent resident).\nProvide an Australian police certificate if you have spent a total of 12 months or more in Australia in the last 10 years since you turned 16.\nWe only accept complete disclosure National Police Certificates issued by the Australian Federal Police. We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police.\nFor immigration purposes, Australian police certificates are valid for 12 months from the date of issue.\nAlso provide:\nComplete and provide the following forms:\nProvide proof that all dependent applicants aged 18 years and older, who did not pay the second instalment of the visa application charge at provisional stage, have at least functional English.\nIf any of the dependent applicants, who did not pay the second instalment cannot show evidence of functional English, you will need to pay the second instalment of the visa application charge for each of those dependent applicants, when we ask you to.\nWe need to see evidence of your partner's identity and relationship with you.\nProvide:\nFor de facto relationship provide either:\nFor both married and de facto applicants you must provide evidence that you are in a genuine and continuing relationship. Evidence can include but is not limited to:\nFor every dependant 18 years old or younger who is applying with you, provide:\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\nThey must complete either:\nAlternatively, you can show us:\nInclude:\nYou don't have to prove that your dependant under 18 years of age has functional English.\nNote: If your child is likely to turn 18 while your application is being processed, you will need to provide evidence they are dependent on you. See the section 'Dependants over 18 documents' below for further information. A child who turns 18 while your application is being processed and who is not dependent on you cannot satisfy the criteria for this visa.\nTo include your child who is over 18 in your visa application, they must be:\nIf your child is likely to turn 23 while your application is being processed, you will need to provide evidence they are dependent on you due to disability.\nProvide:\nYou must also provide proof the child is dependent on you.\nNote: A child who turns 23 while your application is being processed and who does not meet these requirements cannot satisfy the criteria for this visa.\nTo nominate someone to:\nUpload your written notification or your forms to ImmiAccount.\nHave all non-English documents translated into English.\nProvide original and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nNote: You do not need to have any documents certified.\nScan or photograph all documents (English and non-English) in colour.\nThe scans and photos must be clear.\nIf a document is more than 1 page, save it all as 1 file.\nYou must apply for this visa online. You can be in or outside Australia when you apply for the visa.\nProvide accurate information. See what happens if you can't prove your identity or do not provide true information.\nWe will let you know when we have received your application.\nIf you are granted a bridging visa you will receive notification of your visa grant.\nWe do not give updates on applications within the standard processing time.\nYou can check if we need more information from you in ImmiAccount.\nIf you are in Australia, you don't have to tell us if you want to travel outside Australia while we process your application. This is because you can be outside Australia when we make a decision.\nBut if you leave Australia, make sure your visa allows you to return. To see if you can return on your current visa, check VEVO.\nLearn about visa expiry.\nIf you applied outside Australia, don't arrange travel to Australia, leave your job or sell your home until we advise you in writing that you have been granted the visa.\nIf you didn't have health examinations before you applied, we will let you know if you need them. Check ImmiAccount.\nWe might ask for biometrics (fingerprints and photo). We will let you know if you need to provide them.\nIf you did not attach all documents when you applied, attach them as soon as you can to your ImmiAccount.\nWe might also ask you to provide more information; however we are not obliged to do so and may make a decision on your application without asking for more documents.\nIf you are in Australia, make sure you stay lawful by holding a valid visa while we process your application.\nWhen you applied for this visa, you were granted a Bridging visa A (BVA). If your current visa expires before we decide on your application, the BVA will come into effect. You can stay in Australia on the BVA while we process your new visa application.\nDo not ask to have the visa you currently hold cancelled. If your visa is cancelled:\nLearn more about visa expiry.\nIf you need to pay a second instalment, pay it when we send you the invoice.\nYou can add dependent children to your application after you apply but before we decide on your visa.\nUse Form 1436 Adding an additional applicant after lodgement, pay using ImmiAccount, attach the form and supporting documents to your ImmiAccount.\nFamily members who apply for the visa must meet our health and character requirements.\nFamily members who are not coming to Australia do have to meet our character requirement and might have to meet our health requirement.\nIf your child is born after you submit your application but before we decide on your visa, you must tell us as soon as possible.\nFind out what to do if your child is born after you apply.\nIf we grant you the visa, your family members might be able to apply to join you in Australia later as subsequent entrants.\nYou must tell us as soon as possible if you made a mistake on your application.\nComplete Form 1023 Notification of incorrect answers and attach it to your application in ImmiAccount.\nLet us know if you no longer want someone to:\nUpload your written notification or your forms to ImmiAccount.\nFor more information see Who can help you with your application.\nThings you need to let us know about after you have applied include:\nSee how to tell us if your situation changes.\nYou can be in or outside Australia when we decide your visa application but not in immigration clearance. We will let you know our decision in writing.\nIf we grant your visa, we will tell you:\nKeep a copy of the decision.\nIf we refuse your visa, we will tell you:\nWe will not refund the application charge if we refuse your application.\nIf you are outside Australia when the visa is granted, you must enter Australia before a date that we specify on your visa grant letter.\nYou must have:\nAll people arriving in Australia must complete the Incoming Passenger Card. You will be given this card onboard.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nTo see your specific conditions, work and study requirements, use VEVO.\nYou and your family members must meet all visa conditions and obey Australian laws. See your conditions in your visa grant letter or VEVO.\nThings you need to let us know about include:\nSee how to tell us if there is a change in your situation.\nThis is a temporary visa.\nTo see when you must leave or apply for a further visa to remain in Australia, refer to your visa grant letter and the information in VEVO.\nYou can't stay in Australia by extending this visa. You must apply for a new visa if you want to stay longer. See your options.\nIf you want to stay in Australia permanently and you or your partner have satisfied the work and residence requirements, you might be eligible for a Skilled Regional visa (subclass 887).\nYou can travel out of Australia and return as many times as you want while the visa is valid.\nTime spent outside Australia does not extend the visa.\nSee your conditions in VEVO.\nIf an immigration officer processes your clearance at our border, we recommend you tell them:\nIf you do not tell them, you might be granted the subclass 444 visa. Grant of a subclass 444 visa might affect your eligibility for permanent residency through a Skilled Regional (Residence) visa (subclass 887) and ultimately, your eligibility for permanent residency or Australian citizenship.\nIf you wish to provide evidence you have a visa and conditions to someone, use VEVO.\nYou can work in any occupation and for any employer, in line with the work and residence conditions attached to your visa.\nIf you were nominated for your current visa, and it was granted before 16 November 2019, you will need to live and work in an area specified as a Regional and low population growth metropolitan area.\nIf you were nominated for your current visa, and it was granted after 16 November 2019, you will need to live and work in an area specified as a Designated regional area.\nIf you were sponsored for your current visa, you will need to live and work in an area specified as Designated area, regardless of the date your visa was granted.\nSee your specific conditions in your visa grant letter or VEVO.\nYou are protected by Australian workplace law. See your workplace rights and entitlements.\nMembers of the family unit who did not apply for the visa with you can apply to join you in Australia later as subsequent entrants.\nYou must have a valid passport or other travel document to leave Australia and return.\nIf you plan to return to Australia on this visa ensure it is still valid and allows you to re-enter Australia. You can check your visa validity in VEVO.\nWe have an automated process that uses facial recognition technology and your ePassport. You could leave the airport faster if you use SmartGate.\nYou are likely to have some money in a superannuation fund if you worked in Australia and you are:\nSee how to access your super.\nTo prove you have been to Australia, request your international movement records by completing Form 1359 Request for international movement records"
}