{
    "visaID": "visa4.21",
    "visaType": "visa4",
    "visaName": "Temporary Work (Short Stay Specialist) visa (subclass 400)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-work-400",
    "content": "\n1. Subclass 400\n2. Temporary Work (Short Stay Specialist) visa\nWe can grant this visa for up to 6 months (depending on the circumstances).\nGenerally, for a stay period longer than 3 months, a strong business case must be provided with the application.\nYour stay period in Australia commences once you arrive and does not restart each time you travel.\nYou can't apply for this visa in Australia or stay longer by extending this visa.\nAUD415.00 (except in limited circumstances)\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nSee all conditions\nIf you are getting help with your visa, before you pay someone, read information on Who can help with your visa application.\n3. With this visa you can\nEmployers must provide a contract or letter of offer. See what they have to do in:\n4. How long you can stay\nThis is a temporary visa. You can stay in Australia for up to 6 months, depending on the circumstances.\nYou must arrive in Australia within 6 months of the date the visa is granted, or a lesser period specified by the Minister. We will let you know when you must arrive in your visa grant letter.\nYour visa stay period as shown on your visa grant letter will start on your first date of arrival in Australia. The stay period will not restart each time you arrive in Australia.\nYou can check your visa details in the visa grant letter or use VEVO.\n5. Stay longer\nYou can't stay in Australia longer by extending this visa.\nExplore your visa options\n6. Include family\nYou can include Members of the family unit in your application when you apply.\nBoth you and your family members who apply for the visa must meet our health requirements and character requirements.\nAny family members included in your application are not permitted to work or study in Australia. You must be able to show that you and your family have enough means to support yourselves while in Australia.\n7. Cost\nThe visa costs AUD415.00 for the main applicant.\nYou will not need to pay this application charge if you are:\nThere is also a charge for each family member who applies for the visa with you.\nYou might also have to pay other costs for health checks, police certificates and biometrics.\nTo work out what your visa will cost use the Visa Pricing Estimator. The estimator does not take into account the other costs.\n8. Apply from\nYou must be outside Australia when you apply for the visa and when we make a decision on your application.\n9. Processing times\nFor an indication of processing times for this visa, use the visa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\nYour application can take longer to process if:\nWe can't process your application if you do not pay the correct visa application charge. We will notify you if this is the case.\nWhen applying for your subclass 400 visa, you will need to allow time for the application to be processed, taking into account the date you are intending to travel to Australia.\n10. Your obligations\nYou and your family must comply with all visa conditions and Australian laws.\nLearn more about conditions for this visa.\n11. Adequate health insurance\nWe recommend you take out health insurance to cover any unforeseen medical treatment you might need in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability.\nSee more about health insurance for overseas visitors.\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements.\n12. Travel\nThis is a temporary visa. You will have 6 months from the date the visa is granted to first enter Australia (or a lesser period specified). The period of stay you were granted starts on the date you first enter Australia.\nThe visa is granted with either:\nRe-entering Australia on a multiple entry visa does not restart the period of stay you were granted.\nThe time you spend outside Australia does not extend the visa.\n13. Visa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nYou can apply for this visa if you have specialised skills, knowledge or experience that:\nNon-ongoing work means work that is likely to be completed within 6 months or less, and you do not expect or arrange to stay in Australia after this time for any reason related to that work.\nYou will need to show that you have the skills, knowledge or experience to do this work. Things you could show us include:\nThe Australian business or overseas employer might need to show that they have tried to find Australian workers to do the work first, as this visa can't be granted if it affects employment or training opportunities for Australian citizens or permanent residents.\nYou will need to provide proof that you have work.  To see what you need to provide go to Step by Step, Gather documents.\nYou can apply for a subclass 400 to:\nThe subclass 400 visa does not allow a person to:\nIf you want to do these activities, you should consider applying for the Temporary Activity visa (subclass 408) – Entertainment.\nWhile you are in Australia, you and your family members must have adequate means to support yourselves.\nYou and your family members must meet our health requirement.\nYou and family members aged 16 years and over who apply for the visa with you must meet our character requirement.\nYou must only intend to:\nYou can't use our temporary visa program to maintain ongoing residency in Australia.\nThe genuine temporary entrant (GTE) requirement helps us to make sure that you use temporary visas correctly.\nWe must be satisfied that you have a genuine intention to stay here temporarily to do the things you are allowed to do on this visa.\nWhen assessing this, we will consider:\nIf you owe the Australian Government money, you must have paid it back or have a formal arrangement to pay it back.\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused see Limitations on applications in Australia.\nIf applying for a visa from outside Australia see Can I go to Australia.\nIf you want immigration assistance, see Who can help with your visa application.\nSee if you want help with your application or to organise health exams before applying\nYou might need to have health examinations. You can complete them before you apply or you can wait until we tell you to have them.\nFind out the health examinations you need and how to arrange them if you want to have them before you apply.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nGather documents to prove your identity and show you have your employer's support, financial support and recommend health insurance. You will need to prepare them to submit online.\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nProvide the pages of your current passport showing your photo, personal details and passport issue and expiry dates.\nAlso provide:\nDocuments that prove a change of name include:\nYou should provide a letter of invitation, job offer, employment contract or other document from an Australian organisation confirming they have employed you to work in Australia showing:\nWorkers in Australia, including visa holders with permission to work, have rights under Australian workplace law. For information on pay rates, shift calculations, leave arrangements and notice and redundancy entitlements see Fair Work Ombudsman’s Pay and Conditions Tool (PACT).\nSome freelance work might be allowed (for example, a freelance journalist/photographer undertaking a media assignment). If you are doing this type of work, you will need to provide a copy of your itinerary and the details of your work assignment.\nTo prove that you can support yourself and any family you bring to Australia, provide:\nWe can also consider allowances, accommodation and other help from your employer.\nWe will tell you if and when you need to provide police certificates.\nProvide:\nProvide either:\nDocuments that prove your de facto relationship include:\nFor every dependant under 18 years old who is applying with you, provide:\nYou must get consent for the child to come to Australia from anyone who:\nThey must complete either:\nInclude a document with the signature and photo of the person who completed the form or declaration, such as a:\nTo nominate someone to:\nUpload your written notification or your forms to ImmiAccount.\nHave all non-English documents translated into English.\nProvide original and translated documents in your application.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nScan or photograph all documents (English and non-English) in colour.\nThe scans and photos must be clear.\nIf a document is more than one page, save it all as one file\nYou apply for this visa online in ImmiAccount. You and anyone included in your visa application must be outside Australia when you apply and when your visa application is decided.\nProvide accurate information. See what happens if you can't prove your identity or don't provide true information.\nWe will not process your application until you pay the charge.\nEach family member must have their application charge paid and documents attached to their application.\nYou can track and manage your application through ImmiAccount.\nWe will let you know when we have received your application and documents\nWe can't give updates on applications within the standard processing time.\nYou can check if we need more information from you in ImmiAccount.\nDo not arrange to travel to Australia until we let you know, in writing, that we have granted you the visa.\nIf you did not have health examinations before you applied, we will let you know if we need them.\nWe might ask for biometrics (fingerprints and photo). We will let you know if you need to provide them.\nIf you did not attach all documents when you applied attach them as soon as you can in ImmiAccount.\nWe might also ask you to provide more information.\nIf you travel to Australia on a different visa and that visa ends, you can't get a bridging visa to stay in Australia. This is because you must be outside Australia when we make a decision on your application.\nYou can add family members to your application at any time before we decide on your application.\nFor this visa your family members are:\nFind out what to do if your child is born after you apply.\nLet us know as soon as you can.\nComplete Form 1023 Notification of incorrect answers (168KB PDF) and attach it in ImmiAccount.\nLet us know if you no longer want someone to:\nUpload your written notification or your forms to ImmiAccount.\nFor more information see Who can help you with your application.\nThings you need to let us know about after you have applied include:\nSee how to tell us if your situation changes.\nWe will let you know our decision by email.\nIf we grant your visa, we will tell you:\nKeep a copy of the email with you when in Australia.\nIf we refuse your visa, we will tell you why we refused the visa.\nWe will not refund the application charge if we refuse your application.\nYou must have:\nAll people arriving in Australia must complete the Incoming Passenger Card. You will get the card on board.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nTo see your specific conditions and work entitlements use VEVO.\nYou and your family members must meet all visa conditions and obey Australian laws.\nSee your conditions in VEVO.\nThings you need to let us know about when you have this visa include:\nSee what to do if your situation changes.\nThe visa stay period starts on the date you enter Australia.\nYou can check your visa stay period in your visa grant letter or use VEVO.\nTo see when you must leave, use VEVO.\nYou can't stay in Australia longer by extending this visa. You can't apply for this visa from within Australia.\nYou must apply for a different visa if you want to stay longer. See your options.\nYou must arrive in Australia within 6 months of the date the visa is granted, or a lesser period specified in the grant letter.\nThe visa stay period starts on the date you enter Australia. Your visa stay period is on your visa grant letter.\nIf you are granted a single entry visa, you will only be allowed to enter Australia once. To return to Australia after you leave, you will need to apply for a new visa.\nIf you are granted a multiple entry visa, you can leave and re-enter Australia as many times as you want during the visa stay period. The visa stay period does not restart each time you enter Australia.\nTime spent outside Australia does not extend the visa.\nSee your visa details and conditions in VEVO.\nTo prove you have a visa and show your conditions to someone, use VEVO.\nTo see your conditions for work, use VEVO.\nYou are protected by Australian workplace law. See your workplace rights and entitlements.\nFamily members who come with you are not allowed to work.\nYou must have a valid passport or other travel document to leave Australia.\nSee what to do if your visa has expired or is about to expire.\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate.\nYou are likely to have some money in a superannuation fund if you worked in Australia and you are:\nSee how to access your super.\nRequest your international movement records to get proof of your travel in and out of Australia."
}