{
    "visaID": "visa6.2",
    "visaType": "visa6",
    "visaName": "Bridging visa B – BVB – (subclass 020)",
    "link_crawl": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-b-020",
    "content": "\n1. Subclass 020\n2. Bridging visa B (BVB)\nTemporarily\nAUD185.00\nThere are no processing times available for this visa.\nSee all conditions\nIf you are getting help with your visa, before you pay someone, read information on Who can help with your visa application.\n3. About this visa\nThis is a temporary visa.  The BVB travel facility may be granted with single or multiple travel and will be valid for use until a specified date. If the travel facility has ended or does not have sufficient validity remaining to cover your proposed journey, then you will need to apply for and be granted a new BVB prior to leaving Australia. Check if you already hold a Bridging visa B (BVB) with VEVO.\nA separate application for a BVB may be necessary where you have applied for judicial review.  It is not possible to apply to change conditions on your BVB.  If you want to change visa conditions, then you will need to consider applying for a Bridging visa A (BVA).\nYou can’t use a bridging visa while you wait for a citizenship application to be decided.\n4. In effect\nA BVB comes into effect when:\nVisa holders must adhere to the conditions imposed on their visa. Where you are granted a BVB, you will be notified about the conditions that apply.\nIf you hold a substantive visa when your BVB is granted, you must continue to comply with the conditions of the substantive visa.  When your substantive visa ceases, the conditions of your BVB will apply.\n5. Working in Australia\nYou might be allowed to work if the substantive visa you had or the visa you applied for lets you work. Your grant letter will tell you about the conditions that apply to your BVB.\n\nIf the visa you had, and the visa you applied for have work restrictions you will not be able to work with a BVB. See if you have work restrictions in VEVO.\nIf you are the holder of a BVB that does not permit work, and you are seeking to change conditions, you will need to consider applying for a BVA. As part of this process you will need to demonstrate that you are in financial hardship.\n6. Remaining lawful during judicial review\nIf a merits review tribunal upholds our decision to refuse your substantive visa application and you apply for judicial review, you will need to apply for a bridging visa to maintain your lawful status during the judicial review proceedings. If you have applied for judicial review you can only apply for a bridging visa by webform.\n7. With this visa you can\n8. How long you can stay\nOne of the following outcomes will determine when your BVB ceases:\nOnce you have been notified of an outcome you can see exactly how long you can stay in Australia in VEVO.\nBVB granted on or after 19 November 2016\nYour BVB will end 35 calendar days after:\nYou BVB will end 28 calendar days after:\nBVB granted before 19 November 2016\nYour BVB will end 28 days after the date that one of the following happens:\n9. Stay longer\nYou can’t stay in Australia longer by extending this visa. You must apply for a new visa if you wish to stay longer. Explore your visa options.\n10. Include family\nIf you and your family have applied together for a substantive visa in Australia, you can include them in your BVB application providing they are members of the family unit. This means you and your family have to complete only one application form and pay one visa application charge. But, each member of the family will have to meet the requirements for a BVB in their own right.\nOnly those family members who have substantial reasons for needing to travel outside Australia should be included in your BVB application. If some of your family members do not need to travel outside Australia, they can stay in Australia on their current bridging visas.\n11. Cost\nAUD185.00\n12. Apply from\nYou and anyone included in your BVB application must be in Australia to make a valid application and to be granted the visa.\n13. Your obligations\nYou and anyone included in your application must:\nYou can find your visa conditions in your grant letter or VEVO.\nWe will let you know which conditions apply to your BVB if we grant the visa.\n14. Travel\nWhen we grant your BVB, we will tell you when the specified travel period will end.\nIf you hold a BVB where the specified travel period has ended but you need to travel outside Australia again, you will have to apply for another BVB and be granted this visa before leaving Australia.\nIf you are outside Australia when the specified travel period on your BVB ends, the visa will cease. You can't return to Australia with a ceased BVB.\n15. Visa label\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nYou must have held a Substantive visa.\nYou must already hold a BVA or a BVB.\nYou must have made a valid application for a substantive visa and either:\nYou must apply for review within the prescribed timeframes.\nAdministrative Appeals Tribunal\nYou must apply for review within the prescribed timeframe.\nIf you have applied within the prescribed timeframe you may not need to apply for a further bridging visa.\nJudicial review\nThe timeframe for applying for judicial review is 35 days from the date of the Tribunal's decision.\nIf you have not applied for judicial review within the statutory timeframes, this may affect your eligibility to apply for a further bridging visa.\nYou must provide a reason and attach any supporting documents to explain why you need to depart and return to Australia while your substantive visa is being considered or while you are waiting for the outcome of a judicial review.\nYou can be any age to apply for this visa.\nYou must meet the character requirement.\nCheck whether you hold a BVA or BVB in VEVO. Check your passport is valid. You should apply for your BVB no more than 3 months, and not less than 2 weeks, before the date on which you want to travel.\nUsually, you must have a valid passport for us to grant you this visa. If you plan to get a new passport, you should do so before applying for your visa.\nIf you need to apply for a BVB, you can either apply for the visa online, or by post or courier. How you apply depends on how you applied for your associated substantive visa.\nIf you applied for your substantive visa online in ImmiAccount, you must apply for a BVB in ImmiAccount.\nIf you made an application for merits or judicial review, you must apply on paper.\nYou should apply for your BVB no more than 3 months, and not less than 2 weeks, before the date on which you want to travel.\nSome visas can only be granted while you are in Australia. If you apply for a BVB too far in advance of your travel, it could be difficult for us to assess whether your substantive visa will be ready for decision. To be granted a BVB, you must be in Australia when the decision is made on the application.\nIf you leave it until the last minute to apply for a BVB you risk not being granted a BVB before you are due to leave Australia. If this happens, you might not hold a visa that allows you to return to Australia.\nYou would then have to apply for and be granted a substantive visa before you could return to Australia and there is no guarantee that you would be granted a visa.\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\nGather the documents you need for your application.\nProvide accurate information. See what happens if you can't prove your identity or do not provide true information.\nProvide colour copies of the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\nAlso provide:\nDocuments that prove a change of name include:\nWe will tell you if and when you need to get a police certificate.\nHave all non-English documents translated into English.\nTranslators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters.\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\nThese details must be in English.\nNote: You do not need to have any documents certified.\nScan or photograph all documents (English and non-English) in colour.\nThe scans and photos must be clear.\nYou must get consent for any child included on this application to be granted a visa from anyone who:\nThey must complete either:\nInclude a document with the signature and photo of the person who completed the form or declaration, such as a:\nNew step description\nTo nominate someone to:\nUpload your written notification or your forms to ImmiAccount if you applied online, or send with your paper application.\nHow you apply for a BVB depends on:\nYou must apply for the BVB in the same way you applied for your substantive visa.\nIf you applied for your new substantive visa through ImmiAccount, you must apply for your BVB application through ImmiAccount.\nIf you applied for your new substantive visa by paper form, you must submit your BVB application by webform.\nIf you have applied for a review of a decision about your substantive visa application, you must submit your BVB application by webform.\nYou, and anyone included in your application, must be in Australia when you lodge the BVB application.\nProvide accurate information. See what happens if you can't prove your identity or do not provide accurate information.\nIf you applied for your substantive visa through ImmiAccount and a decision has not yet been made on that application, you must apply for your bridging visa through ImmiAccount.\nTo apply for a BVB through ImmiAccount:\nIf you applied for your substantive visa by paper form\nYou must pay the visa application charge.\nOnce you have made a payment, you must complete and submit your BVB application Form 1006 by webform. You need to provide receipt details of your payment on the application form to make a valid BVB application.\nIf you have applied for review of a decision on your substantive visa application\nIf you need a bridging visa to leave and return to Australia during a review process, you must pay the visa application charge. Once you have made a payment, you must complete and submit your BVB application Form 1006 by webform. You need to provide receipt details of your payment on the application form to make a valid BVB application.\nSee what you can and must do after you apply.\nWe will tell you when we have received your application and documents.\nWe do not give updates on application processing times.\nWait for us to contact you.\nTo be able to return to Australia if you travel, your BVB must be granted before you leave.\nA BVB allows you to travel outside Australia until a set date. If you have not returned before that date, your BVB will cease. If this happens, you will need a new visa to return.\nYou, and anyone included in your application, must be in Australia for us to grant the visa.\nWe might ask for Biometrics (fingerprints and photo). We will tell you if you need to provide them.\nIf you did not attach all documents when you applied, attach them as soon as possible in ImmiAccount.\nIf you are applying by webform, you must attach all documents before you submit your BVB application. This includes colour copies of your current passport, showing your:\nWe need this for all applicants included in the application.\nWe might also ask you to provide more information.\nMake sure you stay lawful by holding a valid visa while we process your substantive visa application. It is important to submit your application early. This ensures enough time for us to process your bridging visa application.\nIf you and your family have applied together for a substantive visa in Australia, you can include them in your BVB application. They need to be members of the family unit. This means you and your family have to complete only one application form and pay one visa application charge. Each member of the family has to meet the requirements for a BVB in their own right.\nOnly include family members in your BVB application who have substantial reasons for needing to leave Australia. If some family members do not need to leave Australia, they can stay in Australia on their current bridging visas.\nFind out what to do if your child is born after you apply.\nTell us as soon as you can if you made a mistake on your application.\nComplete Form 1023 Notification of incorrect answers. (168KB PDF)\nTell us if you:\nIf you applied for your substantive visa online, upload your written notification or your forms to ImmiAccount .\nIf you applied for your substantive visa by paper form, send your documents to the office assessing your visa application. You can find this information on the acknowledgement letter under Contact Us.\nFor more information see Who can help you with your application.\nSome of the things you need to tell us about after you have applied include:\nSee how to tell us if your situation changes.\nWe will let you know our decision in writing.\nTo be granted a BVB, you must be in Australia when the decision is made on the application.\nIf we grant your visa, we will tell you:\nKeep a copy of this with you when in Australia.\nIf we refuse your visa, we will tell you:\nTo see your specific conditions, use VEVO.\nWe will let you know which conditions apply to your BVB if we grant the visa.\nThings you need to let us know about include:\nSee how to let us know if there is a change in your situation."
}